[
  [
    1734750907000,
    "Why savoury Chinese dumplings are becoming a winter solstice favourite - South China Morning Post"
  ],
  [
    1734752358000,
    "Seven Chinese nationals tried to illegally enter Guam as U.S. tested missile, authorities say - Reuters.com"
  ],
  [
    1734753611000,
    "The ‘AI Olympics’ gets new hurdles in Canada as US-China tech war plays out - South China Morning Post"
  ],
  [
    1734753625000,
    "Will corruption probe into ideology top brass Miao Hua affect China’s military? - South China Morning Post"
  ],
  [
    1734760800000,
    "Starmer Is Deepening China Ties While the UK’s Allies Turn Away - Bloomberg"
  ],
  [
    1734760812000,
    "Disgraced top China banker married son’s girlfriend, causing his chronic depression - South China Morning Post"
  ],
  [
    1734760814000,
    "‘Genuinely popular’: how Africa’s positive opinion of China goes beyond the elite - South China Morning Post"
  ],
  [
    1734765280000,
    "India and China's path to lasting border peace - DW (English)"
  ],
  [
    1734768007000,
    "China sees surge in travel demand for extended Lunar New Year holiday - South China Morning Post"
  ],
  [
    1734775202000,
    "Families of Detained Americans in China Hold onto Hope Amid Recent Releases - Newsweek"
  ],
  [
    1734775213000,
    "Why China’s football goal is still a long shot despite renewed focus on the sport - South China Morning Post"
  ],
  [
    1734778800000,
    "The Father of Chinese Authoritarianism Has a Message for America - The New Yorker"
  ],
  [
    1734778811000,
    "Who is the politician at the center of the latest Chinese influence scandal? - Los Angeles Times"
  ],
  [
    1734780218000,
    "Spotting of China’s new Z-20 helicopter model suggests coming coastguard role - South China Morning Post"
  ],
  [
    1734781502000,
    "Hong Kong May Be Fresh Flashpoint in Trump’s Fight With China - Bloomberg"
  ],
  [
    1734782400000,
    "America’s Chip War With China Will Spread - The Wall Street Journal"
  ],
  [
    1734784208000,
    "China makes new overtures to foreign firms, pledging market access and services - South China Morning Post"
  ],
  [
    1734789610000,
    "China ‘not dreading’ Trump 2.0, but reforms hold key to closing power gap - South China Morning Post"
  ],
  [
    1734790140000,
    "New report warns of growing national security threat to U.S. as China builds AI: 'Significant and concerning' - Fox News"
  ],
  [
    1734793210000,
    "Pakistan’s reported J-35 deal shows Chinese fighter is ‘ready for global market’ - South China Morning Post"
  ],
  [
    1734793377000,
    "China’s Nio Launches $108,000 EV to Take on Porsche, Mercedes - Bloomberg"
  ],
  [
    1734794905000,
    "China's Nio introduces Firefly brand to take on BMW's Mini - Yahoo Finance"
  ],
  [
    1734796145000,
    "Chinese Media Mocks US 'Delusion' Over Spy Drones - Newsweek"
  ],
  [
    1734806971000,
    "US Department of Defense: Corruption halts military modernization in China - JURIST"
  ],
  [
    1734810941000,
    "Beijing slams Pentagon’s new ‘China threat’ narrative - Asia Times"
  ],
  [
    1734813121000,
    "Feds Take Aim At U.S. Chip Sales To China With New Possible Executive Order - Forbes"
  ],
  [
    1734814286000,
    "China loves Elon Musk and his hustle — but Trump could complicate that - The Washington Post"
  ],
  [
    1734816609000,
    "Opinion | Fall of Syria’s Assad narrows China’s diplomatic space in the Middle East - South China Morning Post"
  ],
  [
    1734818410000,
    "To keep calm in the South China Sea, Beijing reaches for the bilateral playbook - South China Morning Post"
  ],
  [
    1734824746000,
    "Move over Krampus, 10 days visa-free in China, Frontier's route-cuts, and the search for MH370 (Saturday Selection) - Frequent Miler"
  ],
  [
    1734825600000,
    "China Property Flare-Ups Resurface as Crisis Enters Fifth Year - Bloomberg"
  ],
  [
    1734825611000,
    "‘Very striking’: China and Vietnam tighten ties in a ‘3+3’ strategic pivot - This Week In Asia"
  ],
  [
    1734829222000,
    "Beijing takes aim at ‘deceptive’ Pentagon report on Chinese military - South China Morning Post"
  ],
  [
    1734832816000,
    "Scientists find key nutrient missing in China-grown durian - South China Morning Post"
  ],
  [
    1734837343000,
    "China calls Taiwan a 'red line', criticises new US military aid to island - Reuters.com"
  ],
  [
    1734837480000,
    "China's Nio says new Firefly EV to go on sale in Europe in H1 2025 - Reuters.com"
  ],
  [
    1734838320000,
    "House Democrats say GOP caved to Musk in funding bill, protecting his China interests - CNBC"
  ],
  [
    1734841124000,
    "‘Gravely wrong’: Beijing hits out at latest US arms pledge for Taiwan - South China Morning Post"
  ],
  [
    1734843645000,
    "How the US can overcome China’s gallium ban - Financial Times"
  ],
  [
    1734843720000,
    "Raimondo Says Holding Back China in Chips Race Is a ‘Fool’s Errand’ - The Wall Street Journal"
  ],
  [
    1734845409000,
    "Why closing Pogos won’t solve the Philippines’ China problems - South China Morning Post"
  ],
  [
    1734845635000,
    "Trump says he might demand Panama hand over canal - South China Morning Post"
  ],
  [
    1734847146000,
    "China says US is 'playing with fire' after latest military aid for Taiwan - ABC News"
  ],
  [
    1734847200000,
    "Let China build electric cars in UK, Tory ex-chancellor tells Rachel Reeves ahead of trade trip - The Guardian"
  ],
  [
    1734847217000,
    "Chinese classicists fight to save Greek, Roman works from conspiracy theorists - South China Morning Post"
  ],
  [
    1734849540000,
    "Chinese FM, Taiwan Affairs Office of the State Council slam US military aid and arms sales to the Taiwan region, vowing resolute measures to safeguard national sovereignty, security, and territorial integrity - Global Times"
  ],
  [
    1734851460000,
    "'Playing with fire': China warns US over military aid to Taiwan - The Times of India"
  ],
  [
    1734852131000,
    "China objects to US military aid to Taiwan - DW (English)"
  ],
  [
    1734854409000,
    "Xi’s anti-corruption campaign nets record number of ‘tigers’ in 2024 - South China Morning Post"
  ],
  [
    1734861617000,
    "Diamonds are plunging in value around the world. Is China to blame? - South China Morning Post"
  ],
  [
    1734862290000,
    "China sanctions Canadian institutes, individuals over Tibet, Xinjiang row - South China Morning Post"
  ],
  [
    1734863374000,
    "Sweden criticises China for refusing full access to vessel suspected of Baltic Sea cable sabotage - Financial Times"
  ],
  [
    1734863520000,
    "China places massive order for kamikaze drones - defence-blog.com"
  ],
  [
    1734865212000,
    "The new aerial radar penetrating the icy depths of China’s glaciers - South China Morning Post"
  ],
  [
    1734865245000,
    "Inside China’s alleged scheme to influence governments in L.A. County and far beyond - Los Angeles Times"
  ],
  [
    1734865920000,
    "China ‘firmly opposes’ US military aid to Taiwan: Foreign Ministry - Press TV"
  ],
  [
    1734866237000,
    "China takes steps against Canada institutions, individuals over Uyghurs, Tibet - Reuters"
  ],
  [
    1734867000000,
    "UK should designate China a national security threat, claims Priti Patel - The Independent"
  ],
  [
    1734867660000,
    "China warns US ‘playing with fire’ by supplying weapons to Taiwan - The Independent"
  ],
  [
    1734872401000,
    "Behind Amazon's quiet launch of Haul, which competes with Temu in ultra-low-price items from China - CNBC"
  ],
  [
    1734875214000,
    "China Warns US of Taiwan Red Line: 'Playing With Fire' - Newsweek"
  ],
  [
    1734876009000,
    "China’s C919 jet faces key test as it spreads its wings to 10 major cities - South China Morning Post"
  ],
  [
    1734881203000,
    "The year ahead in the Middle East: A weakened Iran has big implications for China - The Conversation Indonesia"
  ],
  [
    1734881280000,
    "Balancing popularity with quality key to China’s rising micro-drama development - Global Times"
  ],
  [
    1734881625000,
    "China says US ‘playing with fire’ by giving Taiwan more military aid - Al Jazeera English"
  ],
  [
    1734882300000,
    "Holding back China's chipmaking progress is a fool’s errand, says U.S. Commerce Secretary - Tom's Hardware"
  ],
  [
    1734884273000,
    "Is European Equidistance Between the US and China Feasible? - tovima.com"
  ],
  [
    1734885150000,
    "On GPS: President Biden’s national security adviser on relations with Russia and China - CNN"
  ],
  [
    1734888383000,
    "Harbin Celebrates Global Talent and Chinese Culture at the Dazzling “My China Story” Awards: You Need To Know - Travel And Tour World"
  ],
  [
    1734890446000,
    "Biden’s Parting Gifts to China - Daily Signal"
  ],
  [
    1734895596000,
    "Chinese Satellite Burns Up, Drops Debris Over US - Forbes"
  ],
  [
    1734897839000,
    "U.S. 'playing with fire' funding Taiwan's military, China says - UPI News"
  ],
  [
    1734900840000,
    "Massive fireball spotted streaking across US skies — and it came from China - New York Post"
  ],
  [
    1734903008000,
    "Opinion | China’s ties with Global South show a different world order is possible - South China Morning Post"
  ],
  [
    1734904819000,
    "Exclusive | How Chinese science and technology have influenced the West … and vice versa - South China Morning Post"
  ],
  [
    1734906000000,
    "How China could boost Trump’s interest in Africa - The Hill"
  ],
  [
    1734906612000,
    "Elon Musk Accused Of Bullying Republicans To Scrap US-China Investment Safeguards To Protect Tesla's Interests - Yahoo Finance"
  ],
  [
    1734908160000,
    "Chinese satellite breaks up over Mississippi upon reentering Earth’s atmosphere - WLBT"
  ],
  [
    1734910080000,
    "China Blocks Investigation of Bulker Suspected of Baltic Subsea Attack - The Maritime Executive"
  ],
  [
    1734912320000,
    "Miles Yu on the Past and Future of Trump and China - The Wire"
  ],
  [
    1734912399000,
    "Biden launches new US trade probe into legacy Chinese chips - Reuters"
  ],
  [
    1734912900000,
    "Dire situation in China is one reason for Honda, Nissan merger - Fortune"
  ],
  [
    1734913639000,
    "Tibet: How China cracked down on rare protests over Kamtok dam - BBC.com"
  ],
  [
    1734915600000,
    "China: Five years on, activists jailed in ‘cruel’ 2019 crackdown must be released - Amnesty International"
  ],
  [
    1734915613000,
    "Chinese scientists look at desert ant to create ultra-thin light sensor chip - South China Morning Post"
  ],
  [
    1734917220000,
    "China warns US to stop arming Taiwan after Biden approves $571M in military aid - Fox News"
  ],
  [
    1734917409000,
    "Opinion | China can’t rely on technology as a panacea for economic recovery - South China Morning Post"
  ],
  [
    1734918275000,
    "Breakingviews - China will wield big mop to clean up property mess - Reuters.com"
  ],
  [
    1734918840000,
    "‘Her Story’: China’s answer to ‘Barbie’ becomes latest smash hit. But some men are not amused - CNN"
  ],
  [
    1734920880000,
    "Chinese Investors Buy Record Amount of Hong Kong Stocks Via Link - Bloomberg"
  ],
  [
    1734922810000,
    "China is making it easier for Americans to visit, but where is the big uptick? - South China Morning Post"
  ],
  [
    1734925417000,
    "Makers of Taiwan's 'Zero Day' TV series set around invasion fear backlash from China - Reuters"
  ],
  [
    1734925980000,
    "Macao is becoming a city of sports and entertainment, Sands China CEO says, as President Xi urges diversification - CNBC"
  ],
  [
    1734926280000,
    "China’s state security authority warns about foreign spy agencies using social media comments to steal national secrets - Global Times"
  ],
  [
    1734926400000,
    "Russia’s Wartime Economic Woes Slow Railway Trade With China - Bloomberg"
  ],
  [
    1734928606000,
    "Chinese village’s sinkhole nightmare continues with kitchen floor collapse - South China Morning Post"
  ],
  [
    1734930300000,
    "‘Mufasa: The Lion King’ Ends ‘Her Story’ Reign at China Box Office - Variety"
  ],
  [
    1734930660000,
    "Many Americans have come to rely on Chinese-made drones. Now lawmakers want to ban them - The Associated Press"
  ],
  [
    1734930900000,
    "Xi Digs In With Top-Down Economic Plan Even as China Drowns in Debt - The Wall Street Journal"
  ],
  [
    1734932040000,
    "China's internet is upset that a knock-off of its darling video game, 'Black Myth: Wukong,' is listed on Nintendo's store - Business Insider"
  ],
  [
    1734933960000,
    "Ex-US fighter pilot accused of training Chinese military to be extradited to the United States - CNN"
  ],
  [
    1734934260000,
    "China’s SMIC Extends Rally on AI Enthusiasm, Accelerated Chip Localization - The Wall Street Journal"
  ],
  [
    1734934837000,
    "China’s diplomatic clout in Mideast at risk as threats build around ally Iran - South China Morning Post"
  ],
  [
    1734935094000,
    "Indonesian Billionaire Mochtar Riady’s OUE REIT To Sell China Property For $264 Million - Forbes"
  ],
  [
    1734935408000,
    "Open Questions | China’s rise, potential recession, no WWIII yet: 11 key interviews from 2024 - South China Morning Post"
  ],
  [
    1734935460000,
    "China says economists who spread 'inappropriate' views should be fired - Nikkei Asia"
  ],
  [
    1734935625000,
    "Vietnam to start construction of new railway linking with China by end-2025 - Reuters"
  ],
  [
    1734936768000,
    "From Trump to Bitcoin, inflation and China: the big economic trends of 2024 - Al Jazeera English"
  ],
  [
    1734937814000,
    "“It Would Double J-20 Stealth Fighter’s Range”! China May Have Inducted Y-20B ‘Chubby Girl’ Aircraft: Reports - EurAsian Times"
  ],
  [
    1734941320000,
    "China says it provided information, documents in Baltic Sea cables inquiry - Reuters"
  ],
  [
    1734943001000,
    "China’s security ministry says foreign spies slander revolutionary heroes online - South China Morning Post"
  ],
  [
    1734943574000,
    "China Hits Back at US Over Nuclear Weapons Alarm - Newsweek"
  ],
  [
    1734943735000,
    "Taiwan leads Asian stocks higher in 2024 — but Trump tariffs, China economy cloud region's outlook - CNBC"
  ],
  [
    1734945934000,
    "Chinese media hail consumption boost even as caution spurs rentals, not buying - Reuters"
  ],
  [
    1734946262000,
    "The ‘Invisible Wall’ Amplifying China’s Population Doom Loop - The Wall Street Journal"
  ],
  [
    1734947280000,
    "Foreign Ministry Spokesperson Mao Ning’s Regular Press Conference on December 23, 2024 - MFA China"
  ],
  [
    1734947520000,
    "U.S. Pilot Accused of Helping Chinese Military to Be Extradited From Australia - The Wall Street Journal"
  ],
  [
    1734948000000,
    "Biden Team to Probe Chinese Chips, Setting Up Trump for Tariffs - Bloomberg"
  ],
  [
    1734948068000,
    "U.S. Takes Aim at China’s Production of Essential Computer Chips - The New York Times"
  ],
  [
    1734948162000,
    "Biden takes final shot at China chip industry with new investigation - Axios"
  ],
  [
    1734948236000,
    "China slams Philippines’ decision to acquire US Typhon missile system - Al Jazeera English"
  ],
  [
    1734949045000,
    "U.S. launches new probe into legacy Chinese chips as tech pressure on Beijing escalates - CNBC"
  ],
  [
    1734949977000,
    "greenhouse and outdoor kitchen pavilion in china bridges the body and land through food - Designboom"
  ],
  [
    1734950466000,
    "Former Marines pilot who worked in China to be extradited to U.S. - NBC News"
  ],
  [
    1734951650000,
    "The Panama Canal: Hostage to the US-China Trade War? - Geopolitical Futures"
  ],
  [
    1734952885000,
    "Can cultural exchanges fix ‘ambiguity and uncertainty’ in China-India ties? - South China Morning Post"
  ],
  [
    1734954960000,
    "Sweden says China denied request for prosecutors to board ship linked to severed cables - The Guardian"
  ],
  [
    1734956618000,
    "China's Mid-Range Missiles Threaten Nearby US Bases - Newsweek"
  ],
  [
    1734956928000,
    "Philippines says it will acquire U.S. Typhon missile system, sparking warnings from China - CBS News"
  ],
  [
    1734958800000,
    "TikTok divestment could be ‘deal of the century’ for Trump, House China Committee chair says - Fox News"
  ],
  [
    1734958808000,
    "Chinese electric vehicle exports plummet in November as EU tariffs bite - South China Morning Post"
  ],
  [
    1734958860000,
    "China says Philippine plan to deploy midrange missiles would be ‘extremely irresponsible’ - The Associated Press"
  ],
  [
    1734959158000,
    "India-China frozen ties witness thaw in 2024 - VOA Asia"
  ],
  [
    1734960300000,
    "Honda, Nissan, and Mitsubishi may merge to compete with Tesla and China's EV makers - Yahoo Finance"
  ],
  [
    1734960540000,
    "Congress is looking to ban Chinese drones that are widely used in US. What to know about the debate - The Associated Press"
  ],
  [
    1734960685000,
    "Post-Assad Syria: What It Means for China - Geopoliticalmonitor.com"
  ],
  [
    1734960703000,
    "China's Dahua Technology to exit projects in Xinjiang - Yahoo Finance"
  ],
  [
    1734960866000,
    "Explained: Donald Trump's Big Warning Over Panama Canal Amid Rising Chinese Influence - NDTV"
  ],
  [
    1734961080000,
    "How to Profit From Volatility in China’s Market - Barron's"
  ],
  [
    1734961479000,
    "Toyota to build plant to produce EVs in China, Nikkei reports - Reuters"
  ],
  [
    1734962410000,
    "China-born biologist Wang Cunyu returns from decades in US to head institute - South China Morning Post"
  ],
  [
    1734963703000,
    "Feds lay blame while Chinese telecom attack continues - CyberScoop"
  ],
  [
    1734964216000,
    "Here’s what to know about China’s alleged spy scheme in L.A. County and beyond - Los Angeles Times"
  ],
  [
    1734966014000,
    "The So-Called Chinese “Overcapacity” Is Completely Untenable - EURACTIV"
  ],
  [
    1734966372000,
    "Trump’s Balancing Act with China on Frontier AI Policy - Just Security"
  ],
  [
    1734967379000,
    "China says it has given info, documents in probe of cut Baltic Sea cables - Yahoo News Canada"
  ],
  [
    1734968169000,
    "Joe Biden Launches Major Trade Investigation Into China - Newsweek"
  ],
  [
    1734968485000,
    "China has banned US exports of key minerals for computer chips – leaving Washington with limited options - The Conversation"
  ],
  [
    1734968551000,
    "China’s GDP Growth is Now Lagging the Rest of Asia - Visual Capitalist"
  ],
  [
    1734968645000,
    "US launches trade investigation into China’s ‘legacy’ chips - South China Morning Post"
  ],
  [
    1734969780000,
    "China urges US to stop wrongdoing, vows to defend interests, after Washington announces new chip probe - Global Times"
  ],
  [
    1734970183000,
    "The End of China As a Great Power: Population Collapse | Opinion - Newsweek"
  ],
  [
    1734972960000,
    "US targets China with probe into semiconductor industry - The Hill"
  ],
  [
    1734973236000,
    "What to Expect With Trump’s Future China Policy - The Nation"
  ],
  [
    1734974100000,
    "Did Elon Musk kill a bill blocking investments in China to help Tesla? - MarketWatch"
  ],
  [
    1734975000000,
    "China claims cooperation in Baltic Sea cable probe, Sweden says otherwise - Al Jazeera English"
  ],
  [
    1734979664000,
    "America First Legal Obtains Photos of Joe Biden Meeting with Hunter Biden’s Chinese Business Associates and Introducing Hunter to China’s President Xi Jinping - America First Legal"
  ],
  [
    1734980423000,
    "US launches probe into Chinese semiconductor industry - Financial Times"
  ],
  [
    1734984330000,
    "Trump's Undersecretary of Defense for Policy repeatedly said TSMC fabs should be destroyed if China invades Taiwan - DatacenterDynamics"
  ],
  [
    1734986750000,
    "Experts urge US to use Taiwan logistics pact to counter China's military coercion - VOA Asia"
  ],
  [
    1734987900000,
    "Space Station keeps dodging debris from China’s 2007 satellite weapon test - The Washington Post"
  ],
  [
    1734989408000,
    "Opinion | Besides the border, 4 issues obstruct warmer China-India ties - South China Morning Post"
  ],
  [
    1734990078000,
    "Moolenaar: Chinese Communist Party 'Denies Citizens the Joy of Christmas' - Select Committee on the CCP |"
  ],
  [
    1734990525000,
    "Chinese workers found in ‘slavery-like conditions’ at BYD site in Brazil - South China Morning Post"
  ],
  [
    1734991200000,
    "China’s in the driver’s seat as EV sales are set to keep growing into 2025 - Fortune"
  ],
  [
    1734993073000,
    "See a dead Chinese satellite burn up as a brilliant fireball in the night sky (video) - Space.com"
  ],
  [
    1734994808000,
    "My Take | China’s extended visa-free tourist stays drive momentum for opening - South China Morning Post"
  ],
  [
    1734994901000,
    "Why China's chip industry has the U.S. concerned - Marketplace"
  ],
  [
    1734995110000,
    "China’s Property Stock Rebound Faces a Reality Check in 2025 - Bloomberg"
  ],
  [
    1734996628000,
    "China's foreign adoption ban leaves hundreds of children and families in limbo - PBS NewsHour"
  ],
  [
    1735005600000,
    "What is neijuan, and why is China worried about it? - The Guardian"
  ],
  [
    1735005667000,
    "Chinese EV industry’s lithium demand fuels research into ‘low-quality’ sources - South China Morning Post"
  ],
  [
    1735009198000,
    "Biden fires grand finale chip war salvo at China - Asia Times"
  ],
  [
    1735011060000,
    "China Abruptly Changes Army General Overseeing Political Loyalty - Bloomberg"
  ],
  [
    1735012819000,
    "‘Extremely irresponsible’: Philippine army’s Typhon purchase plan angers China - This Week In Asia"
  ],
  [
    1735015440000,
    "China EV insurance registrations for week ending Dec 22: Nio 5,400, Tesla 17,600, Xiaomi 6,000, BYD 87,700 - CnEVPost"
  ],
  [
    1735016220000,
    "China’s Finance Ministry Vows Greater, Faster Spending in 2025 - Bloomberg"
  ],
  [
    1735016453000,
    "Private equity investors trapped in China as top firms fail to find exit deals - Financial Times"
  ],
  [
    1735017539000,
    "China: Suspended death sentence for driver in school kids attack - BBC.com"
  ],
  [
    1735018980000,
    "Driver who plowed into school crowd in southern China given suspended death sentence - CNN"
  ],
  [
    1735019460000,
    "China to ramp up fiscal support for consumption next year - Reuters"
  ],
  [
    1735020012000,
    "Chinese court delivers suspended death sentence for primary school SUV attack - South China Morning Post"
  ],
  [
    1735021456000,
    "China plans $411 billion special treasury bond issuance next year, Reuters reports - CNBC"
  ],
  [
    1735027620000,
    "Driver in China’s Hunan car ramming incident handed suspended death penalty - The Independent"
  ],
  [
    1735028790000,
    "China Mulls Record $411 Billion Special Bonds, Reuters Says - Bloomberg"
  ],
  [
    1735029547000,
    "China’s Sanhua Is Said to Pick Banks for Hong Kong 2025 Listing - Bloomberg"
  ],
  [
    1735030191000,
    "China and Japan expected to discuss seafood ban on Wednesday - Reuters"
  ],
  [
    1735031178000,
    "Data Center Operator GDS Is Said to Consider IPO of China REIT - Bloomberg"
  ],
  [
    1735031945000,
    "Ukraine war: Zelensky thanks China for supporting territorial integrity - South China Morning Post"
  ],
  [
    1735031954000,
    "China Plans Special Bonds Amid Vows to Spend - Bloomberg"
  ],
  [
    1735033331000,
    "After protests, China reverses course on law that hurt shareholders - Reuters"
  ],
  [
    1735033335000,
    "Portfolio manager names Chinese and European stocks promising 'strong returns' despite market uncertainty - CNBC"
  ],
  [
    1735033560000,
    "‘A sense of freedom’: China’s small bookshops relocate across the world - The Guardian"
  ],
  [
    1735034225000,
    "Missing in the Gray Zone? China’s Maritime Militia Forces Around Taiwan - The Diplomat"
  ],
  [
    1735034266000,
    "China plans decade-long drive to boost cereal grain consumption - Reuters.com"
  ],
  [
    1735034480000,
    "Questions Emerge About Data Used by China to Defend Against Doping Allegations - The New York Times"
  ],
  [
    1735034821000,
    "China names Chen Hui to lead army political work amid PLA personnel shake-up - South China Morning Post"
  ],
  [
    1735036200000,
    "Don’t Look Now, but China’s AI Is Catching Up Fast - The Wall Street Journal"
  ],
  [
    1735036210000,
    "China’s finance ministry vows measures to boost consumption and investment next year - South China Morning Post"
  ],
  [
    1735036488000,
    "Base Metals Head Higher on Report of China Borrowing Boost - Yahoo Finance"
  ],
  [
    1735036488000,
    "Iron Ore Dips Below $100 as China’s Property Woes Set to Worsen - Bloomberg"
  ],
  [
    1735038488000,
    "FirstFT: Private equity groups unable to sell or list China-based portfolio companies - Financial Times"
  ],
  [
    1735041608000,
    "China sets world record with ‘polar ready’ 58,000-tonne flat-top cargo ship - South China Morning Post"
  ],
  [
    1735042020000,
    "‘We need to be prepared’: China adapts to era of extreme flooding - The Guardian"
  ],
  [
    1735043593000,
    "China's CATL launches EV chassis, flagging safety as top selling point - Reuters"
  ],
  [
    1735044299000,
    "Tech supply chains at risk as US launches probe into China’s legacy chip dominance - CIO"
  ],
  [
    1735048809000,
    "How friendly will Europe’s right wing be to Trump on China? It’s complicated - South China Morning Post"
  ],
  [
    1735052400000,
    "How Trump’s tariffs can generate both economic and political reform in China - The Hill"
  ],
  [
    1735052400000,
    "Vice Foreign Minister Sun Weidong Meets with Vietnamese Ambassador to China Pham Sao Mai - MFA China"
  ],
  [
    1735056180000,
    "UK must be less dependent on China for critical minerals, says thinktank - The Guardian"
  ],
  [
    1735057137000,
    "China's Territorial Ambitions Challenged by New Missiles on Doorstep - Newsweek"
  ],
  [
    1735057800000,
    "China Brief: The Year in Review 2024 - Foreign Policy"
  ],
  [
    1735059311000,
    "Why younger residents of China’s “median city” are so risk-averse - The Economist"
  ],
  [
    1735059660000,
    "China plans to issue $3T in special bonds: Report - Semafor"
  ],
  [
    1735063440000,
    "Tesla Announces Quarterly Deliveries Next Week. China Continues To Offer Good News. - Investor's Business Daily"
  ],
  [
    1735065596000,
    "China Reacts After Biden Signs Record US National Defense Bill - Newsweek"
  ],
  [
    1735070407000,
    "Opinion | What I Learned Most From My Trip to China - The New York Times"
  ],
  [
    1735071949000,
    "China's WuXi to sell Advanced Therapies unit amid US restrictions - Yahoo Finance"
  ],
  [
    1735072440000,
    "Former Chelsea player Oscar returns to Brazil’s Sao Paulo from China - The Associated Press"
  ],
  [
    1735077085000,
    "Trump’s Panama Canal threats designed to scuttle China influence - The Washington Post"
  ],
  [
    1735079439000,
    "‘I've worked Christmas since I was in 7th grade': San Diego Chinese restaurants open on holidays - NBC San Diego"
  ],
  [
    1735084800000,
    "China wants its people to watch for spies. Here's what it's asked them to beware of this year, from online dating to suspicious dragonflies. - Business Insider"
  ],
  [
    1735084822000,
    "Beijing urged to strengthen legal talent pool in South China Sea dispute - South China Morning Post"
  ],
  [
    1735086780000,
    "Major cybersecurity attack from China exposes systematic flaws - TheStreet"
  ],
  [
    1735091614000,
    "Brazil: Chinese workers found in 'slave-like' conditions - DW (English)"
  ],
  [
    1735092000000,
    "China cenbank conducts medium-term loan operation, leaves rate unchanged - Reuters"
  ],
  [
    1735092014000,
    "Former Taiwan leader emphasises shared roots of island and mainland Chinese - South China Morning Post"
  ],
  [
    1735096210000,
    "China approves value-added tax law, taking effect in 2026 - Reuters"
  ],
  [
    1735097412000,
    "How ‘made in China’ became trendy, thanks to Labubu toy’s Asia-wide success - South China Morning Post"
  ],
  [
    1735099238000,
    "Chinese satellite posed no danger but gave US observers ‘spectacular’ light show - South China Morning Post"
  ],
  [
    1735099380000,
    "China to focus on stabilising housing market in 2025, housing regulator says - Reuters"
  ],
  [
    1735100304000,
    "Prosecutors find workers in 'slavery like' conditions at Chinese car company site in Brazil - ABC News"
  ],
  [
    1735101007000,
    "EU tariffs slow Chinese EV exports, Geely looks to expand in Asia: 7 EV reads - South China Morning Post"
  ],
  [
    1735102800000,
    "The Roots of “Revenge Against Society” Attacks in China - Foreign Affairs Magazine"
  ],
  [
    1735102833000,
    "China steps up campaign for single people to date, marry and give birth - Financial Times"
  ],
  [
    1735102833000,
    "Fine wine market in the red as Chinese demand dries up - Financial Times"
  ],
  [
    1735106278000,
    "‘Japan’s neighbourhood more dangerous’? Fears over Chinese land purchases - South China Morning Post"
  ],
  [
    1735106409000,
    "China school ditches ‘elite dining’ for high-achieving students after backlash - South China Morning Post"
  ],
  [
    1735106411000,
    "Chinese firms seek European base for factories amid trade tensions, tariffs - South China Morning Post"
  ],
  [
    1735107191000,
    "China sets dates for ‘two sessions’ as investors await 2025 growth target - South China Morning Post"
  ],
  [
    1735108140000,
    "Chinese tricksters take cue from Squid Game to prey on the indebted - Reuters"
  ],
  [
    1735111860000,
    "Honda, Nissan Deal Could Be Key to Comeback Against China’s BYD - Bloomberg"
  ],
  [
    1735112400000,
    "China Avoids Rate Cut to Keep Ammunition For Future Pressure - Bloomberg"
  ],
  [
    1735113612000,
    "Chinese, South Korean foreign ministers in first call since martial law crisis - South China Morning Post"
  ],
  [
    1735115413000,
    "China approves over 1,400 video game titles for the year, the most since 2019 - South China Morning Post"
  ],
  [
    1735115610000,
    "China extends EU brandy anti-dumping investigation by three months - Reuters.com"
  ],
  [
    1735117743000,
    "Japan, China Agree to Visit by Top Beijing Diplomat in 2025 - Bloomberg"
  ],
  [
    1735117761000,
    "China's Christmas Eve box office plunges to 13-year low - Reuters.com"
  ],
  [
    1735120154000,
    "Japan-China Foreign Ministers’ Meeting and Working Lunch - Ministry of Foreign Affairs of Japan"
  ],
  [
    1735121040000,
    "The rise and rise of Maye Musk: China’s love affair with Elon Musk’s mother - The Guardian"
  ],
  [
    1735121840000,
    "Japan offers to ease visa rules for Chinese tourists during foreign minister’s visit - South China Morning Post"
  ],
  [
    1735121858000,
    "China Sets Another “World Record” With 58,000-Tonne Cargo Ship Akin To Fujian Aircraft Carrier: Chinese Media - EurAsian Times"
  ],
  [
    1735124100000,
    "The 'godfather of EVs' explains why China is winning the race to go electric — and why hybrids are a 'fool's errand' - Business Insider"
  ],
  [
    1735124400000,
    "China and India rebuild trust on the path to reconciliation - East Asia Forum"
  ],
  [
    1735124760000,
    "China is catching up to US tech rivals - Semafor"
  ],
  [
    1735125886000,
    "Japan FM visits China, seeking 'positive direction' for ties - DW (English)"
  ],
  [
    1735126928000,
    "China, Japan foreign ministers agree visit, security dialogue - Reuters"
  ],
  [
    1735128018000,
    "China’s ideology tsar signals to Dalai Lama at Buddhism reincarnation exhibit - South China Morning Post"
  ],
  [
    1735129918000,
    "China claims ‘world record’ with powerful 58,000-ton polar-ready cargo ship - Yahoo! Voices"
  ],
  [
    1735130220000,
    "China tests Fujian carrier-sized cargo ship with 58,000-ton capacity - Interesting Engineering"
  ],
  [
    1735131657000,
    "China Seeks to Spur Growth by Giving Local Officials Bond Leeway - Bloomberg"
  ],
  [
    1735135208000,
    "What fate awaits undocumented Chinese migrants in the US under Trump? - South China Morning Post"
  ],
  [
    1735138200000,
    "China and Japan agree to talks on security issues as they seek to mend ties - The Associated Press"
  ],
  [
    1735138326000,
    "ASML CEO says China is 10 to 15 years behind in chipmaking capabilities - Tom's Hardware"
  ],
  [
    1735138638000,
    "Japan to ease visa requirements, agrees on top China diplomat visit - Kyodo News Plus"
  ],
  [
    1735138805000,
    "China prepares a massive counterattack on Europe with $41 billion investments in its own lithography equipment - Jason Deegan"
  ],
  [
    1735146294000,
    "panda-shaped cradle defines biodiverse performance hub by ZXD architects in china - Designboom"
  ],
  [
    1735153800000,
    "Analysis: China military in disarray over Xi's monopoly on power - Nikkei Asia"
  ],
  [
    1735154880000,
    "The Year of Concentration, Crypto, China - The Motley Fool"
  ],
  [
    1735156802000,
    "Xi May Be Facing a No Good, Very Bad 2025 - Bloomberg"
  ],
  [
    1735159761000,
    "China Reports Building World’s Largest Heavy Lift Vessel - The Maritime Executive"
  ],
  [
    1735161350000,
    "Trump picks ambassador to Panama, knocks Central American country and China in Christmas messages - Yahoo! Voices"
  ],
  [
    1735162208000,
    "Opinion | 2024 shows US-China tensions no longer the biggest story - South China Morning Post"
  ],
  [
    1735164020000,
    "Three Gorges times 3: China will build the largest dam in Earth’s deepest canyon - South China Morning Post"
  ],
  [
    1735165865000,
    "China banned sale of these minerals to the U.S. It matters to all of us - Yahoo! Voices"
  ],
  [
    1735166386000,
    "Panama's president calls Trump's Chinese canal claim 'nonsense' - BBC.com"
  ],
  [
    1735168856000,
    "Hong Kong dollar peg at risk in Trump’s coming fight with China - Asia Times"
  ],
  [
    1735175520000,
    "China Debuts First Polysilicon Futures After Huge Price Swings - Bloomberg"
  ],
  [
    1735177920000,
    "Japan’s Retail, Tourism Stocks Climb on Travel Pact With China - Bloomberg"
  ],
  [
    1735178205000,
    "Trump takes aim at Canada, China, ‘left lunatics’ in Christmas wishes - South China Morning Post"
  ],
  [
    1735178408000,
    "A song of ice and snow: China’s Harbin and the winter economy push - South China Morning Post"
  ],
  [
    1735178414000,
    "Huawei’s latest phones still rely on South Korean memory chips - South China Morning Post"
  ],
  [
    1735180218000,
    "China’s stocks edge up as traders await clarity on stimulus amid holidays - South China Morning Post"
  ],
  [
    1735180260000,
    "China Ousts Two Military Lawmakers as Xi’s Defense Purge Widens - Bloomberg"
  ],
  [
    1735182420000,
    "Sinopec Completes Construction of China's Largest Petrochemical Industrial Base - PR Newswire"
  ],
  [
    1735183808000,
    "How China can help Trump save face at his inauguration - South China Morning Post"
  ],
  [
    1735185608000,
    "Chinese scientists say new sunblock can lower body heat by 6 degrees Celsius - South China Morning Post"
  ],
  [
    1735186200000,
    "In a first, Taiwan's Presidential Office runs war games to simulate a China emergency - Reuters"
  ],
  [
    1735188858000,
    "Fact Check: Does China Control the Panama Canal, as Trump Suggests? - Newsweek"
  ],
  [
    1735189208000,
    "Fake baby bumps, live dim sum wrestling, disgraced banker: 5 trending stories - South China Morning Post"
  ],
  [
    1735189222000,
    "India roars ahead of China to top Asian IPO rankings - Financial Times"
  ],
  [
    1735189222000,
    "China’s EV sales set to overtake traditional cars years ahead of west - Financial Times"
  ],
  [
    1735189320000,
    "China to build world's largest hydropower dam in Tibet - Yahoo! Voices"
  ],
  [
    1735190147000,
    "New Years resolution? Taking the US-China heat down a notch - Responsible Statecraft"
  ],
  [
    1735192269000,
    "World Bank lifts China growth forecast but calls for deeper reforms - Financial Times"
  ],
  [
    1735192800000,
    "China Rolls Out a Private Pension Plan. The Public System Isn’t Enough. - Barron's"
  ],
  [
    1735192810000,
    "‘China’s grandma’ hospital cleaner saves 38 lost babies, nominated for top award - South China Morning Post"
  ],
  [
    1735193034000,
    "2 more Chinese generals fall in anti-corruption campaign in military - South China Morning Post"
  ],
  [
    1735193160000,
    "China's GDP growth to decelerate to 4.4% in 2025, say economists - Nikkei Asia"
  ],
  [
    1735198725000,
    "Oil Prices Inch Higher on China Stimulus Hopes - OilPrice.com"
  ],
  [
    1735199220000,
    "World Bank raises China's GDP forecast for 2024, 2025 - Reuters"
  ],
  [
    1735200013000,
    "Will delayed launch put China’s plans to build Starlink rival at long-term risk? - South China Morning Post"
  ],
  [
    1735200519000,
    "China urges Philippines to return to 'peaceful development' - Reuters"
  ],
  [
    1735201260000,
    "Chinese automaker BYD slams reports of poor conditions at a factory site in Brazil - The Associated Press"
  ],
  [
    1735201800000,
    "The U.S. Has 2 Choices on China Chip Policy. Neither Are Good for Stocks. - Barron's"
  ],
  [
    1735202700000,
    "Ex-PM Miyazawa aired doubts about China's democratization to Clinton in '93 - The Japan Times"
  ],
  [
    1735203600000,
    "Trump's defense policy pick once said TSMC can't end up in Chinese hands if China takes Taiwan - Business Insider"
  ],
  [
    1735203960000,
    "In a Japanese restaurant in west London, this Chinese woman felt truly at home - The Guardian"
  ],
  [
    1735205193000,
    "China’s Finance, Property Firm Workforces Shrink for First Time - Bloomberg"
  ],
  [
    1735206900000,
    "India concerned as China approves world’s largest dam in Tibet - The Independent"
  ],
  [
    1735207674000,
    "China's Xi sends condolences over Azerbaijan Airlines plane crash - Reuters"
  ],
  [
    1735208640000,
    "World Bank upgrades China forecast citing recent reform efforts - Semafor"
  ],
  [
    1735209479000,
    "FirstFT: China’s EV sales zoom past western rivals - Financial Times"
  ],
  [
    1735210326000,
    "China's next-gen fighter-bomber takes to the skies - defence-blog.com"
  ],
  [
    1735210680000,
    "China raises its estimate for the size of its economy in 2023 - The Associated Press"
  ],
  [
    1735210959000,
    "China revises up 2023 GDP, sees little impact on 2024 growth - Reuters"
  ],
  [
    1735211783000,
    "How China turns members of its diaspora into spies - The Economist"
  ],
  [
    1735211941000,
    "China Flies Brand New Stealth Fighter Jet, Believed To Be 6th Generation - NDTV"
  ],
  [
    1735212168000,
    "Possible First Flight of China’s Sixth-Generation Aircraft - The Aviationist"
  ],
  [
    1735214581000,
    "China Pressures Women To Help Avert Population Crisis - Newsweek"
  ],
  [
    1735214820000,
    "Inside China’s secret plan to send weapons disguised as Covid aid to warlord - The Telegraph"
  ],
  [
    1735216200000,
    "China's EV Uptake Is Years Ahead of Targets and Forecasts - OilPrice.com"
  ],
  [
    1735217027000,
    "Chinese lithium firm reaches milestone in Mali mine project despite strict rules - South China Morning Post"
  ],
  [
    1735217100000,
    "New Chinese Advanced Combat Aircraft Emerge In Flight - Aviation Week"
  ],
  [
    1735217438000,
    "China Stuns With Heavy Stealth Tactical Jet’s Sudden Appearance - Yahoo! Voices"
  ],
  [
    1735217734000,
    "China’s economy gains new growth and deep scars over past 5 years: NBS census - South China Morning Post"
  ],
  [
    1735218000000,
    "Chinese Students in U.S. Warned to Stay Put Ahead of Second Trump Term - The Wall Street Journal"
  ],
  [
    1735218000000,
    "US Oil Exports to China Dwindle as Demand Wanes, Buying Shifts - Bloomberg"
  ],
  [
    1735218176000,
    "China warns ‘dangerous’ US actions are raising risk of space arms race - South China Morning Post"
  ],
  [
    1735221420000,
    "Panama Canal power play: Donald Trump pushes back against China’s rising role - The Times of India"
  ],
  [
    1735221608000,
    "Chinese firm unveils world’s first ride-on robot dog for all-terrain adventures - South China Morning Post"
  ],
  [
    1735223797000,
    "China's CATL to seek Hong Kong listing - Yahoo Finance"
  ],
  [
    1735228564000,
    "China pushes ahead with huge — and controversial — dam in Tibet - The Washington Post"
  ],
  [
    1735230300000,
    "3 ways a trade war with China could hit US profits, according to Goldman Sachs - Business Insider"
  ],
  [
    1735231267000,
    "China has a stealthy new warplane - Axios"
  ],
  [
    1735234902000,
    "Hyde Park restaurant China Gourmet closing permanently after 47 years - The Cincinnati Enquirer"
  ],
  [
    1735235940000,
    "Lichen China (LICN) Announces $2.8M Direct Offering at $0.14 Per Share, Issues 20M New Shares - StockTitan"
  ],
  [
    1735237800000,
    "India's Oil Demand Growth Set to Surpass China's - OilPrice.com"
  ],
  [
    1735238700000,
    "Carl Vinson Carrier Strike Group Now Operating in South China Sea - USNI News"
  ],
  [
    1735239615000,
    "New Chinese fighter jet seen over Chengdu tacitly confirmed by military - South China Morning Post"
  ],
  [
    1735243716000,
    "Oil prices ease as markets weigh China stimulus hopes - Reuters"
  ],
  [
    1735243931000,
    "China Videos Tease Beijing's Newest 'Sixth Generation' Fighter Jets - Newsweek"
  ],
  [
    1735244056000,
    "Taiwan seeks clarity on Trump team policy amid Chinese pressure - VOA Asia"
  ],
  [
    1735244107000,
    "How Chinese film fans embraced Cloud Atlas, movie spurned elsewhere - South China Morning Post"
  ],
  [
    1735244940000,
    "Alarming videos show possible new Chinese stealth jet — which could indicate unveiling of 6th-generation fighter - New York Post"
  ],
  [
    1735247460000,
    "China Flew Striking Prototypes of a Future Stealth Fighter - Business Insider"
  ],
  [
    1735247804000,
    "Yes, China Just Flew Another Tailless Next-Generation Stealth Combat Aircraft - The War Zone"
  ],
  [
    1735250074000,
    "Japan seeks better ties with China ahead of second Trump term - VOA Asia"
  ],
  [
    1735250411000,
    "In China’s industry, it’s the law of the jungle. How should Beijing intervene? - South China Morning Post"
  ],
  [
    1735250881000,
    "US nerve center to combat China and Russia global propaganda shut down by GOP opposition - USA TODAY"
  ],
  [
    1735252702000,
    "China’s Landspace secures state-backed funding for reusable rockets - SpaceNews"
  ],
  [
    1735254000000,
    "China’s Local-Finance Cleanup Opens New Chapter With State Firms - Bloomberg"
  ],
  [
    1735255155000,
    "China Revealed Two New Stealth Fighter Designs In One Momentous Day - Forbes"
  ],
  [
    1735255809000,
    "‘Old money’ look beats nouveau riche glitz in China’s spending slump - South China Morning Post"
  ],
  [
    1735258256000,
    "China's November industrial profits narrow decline but 2024 likely worst year in decades - Reuters.com"
  ],
  [
    1735260559000,
    "China's top diplomat Wang Yi mulls trip to Japan in Feb. - Kyodo News Plus"
  ],
  [
    1735261209000,
    "China Yiche ethnic minority embrace open marriage, first to wear mini-shorts - South China Morning Post"
  ],
  [
    1735262145000,
    "China Green-Lights World's Most Ambitious Hydropower Project - The Maritime Executive"
  ],
  [
    1735263360000,
    "China's industrial profits extend decline to a fourth straight month, dropping 7.3% in November - CNBC"
  ],
  [
    1735264810000,
    "China’s military tests remote 3D printed parts for the battlefield: report - South China Morning Post"
  ],
  [
    1735265520000,
    "China’s Xi orders a stop to a spree of mass killings known as ‘revenge on society crimes’ - The Associated Press"
  ],
  [
    1735265520000,
    "China launches world’s first electromagnetic catapult-equipped amphibious assault ship Type 076 - Global Times"
  ],
  [
    1735266058000,
    "VIEWPOINT: Preparing for Great Power War with China - National Defense Magazine"
  ],
  [
    1735266211000,
    "How a Mao-era system creates second-class citizens in modern China - Financial Times"
  ],
  [
    1735266375000,
    "\"Nonsense\": Panama's president slams Trump's claims that Chinese soldiers operate in canal - Axios"
  ],
  [
    1735267800000,
    "China's BYD offers year-end discounts of up to 11.5% - Reuters.com"
  ],
  [
    1735271640000,
    "China Dividend ETF Flows Surge as Investors Shift From Bonds - Bloomberg"
  ],
  [
    1735273500000,
    "China Industrial Profits Set for Steepest Annual Drop Since 2000 - Bloomberg"
  ],
  [
    1735279213000,
    "China launches icebreaker to help forge path in research and Arctic influence - South China Morning Post"
  ],
  [
    1735279473000,
    "China's fast-expanding commercial space sector logs rare rocket failure - Reuters.com"
  ],
  [
    1735280580000,
    "China Launches Largest Amphibious Warship in Show of Naval Power - Bloomberg"
  ],
  [
    1735280880000,
    "China says new housing metrics behind upward revision to 2023 GDP - Reuters.com"
  ],
  [
    1735282811000,
    "China’s high-speed rail enthusiasts glimpse the future as 450km/h train spotted - South China Morning Post"
  ],
  [
    1735284180000,
    "Taiwan Is Preparing More Than Just the Military for a China Invasion - Business Insider"
  ],
  [
    1735284540000,
    "China sanctions 7 US military companies and relevant senior executives over recent military assistance and arms sale to Taiwan region - Global Times"
  ],
  [
    1735285072000,
    "China launches new generation assault ship 'Sichuan' - DW (English)"
  ],
  [
    1735287107000,
    "China's Xi will visit Russia in 2025, Russian ambassador says - Reuters"
  ],
  [
    1735287676000,
    "China surpasses rivals with ‘world-class’ sixth-gen stealth fighter jet: experts - South China Morning Post"
  ],
  [
    1735288584000,
    "China Names Type 076 Amphibious Catapult Carrier “Sichuan” At Launch Ceremony In Shanghai - Naval News"
  ],
  [
    1735288661000,
    "What is China's Jinjiang, the BYD contractor under fire in Brazil? - Reuters.com"
  ],
  [
    1735289238000,
    "China Olympic champions Fan, Chen stun table tennis fans with ‘retirement’ posts - South China Morning Post"
  ],
  [
    1735289884000,
    "China sanctions military firms and executives over US arms sales to Taiwan - Reuters.com"
  ],
  [
    1735291560000,
    "Taiwan’s presidential office runs first ‘tabletop’ simulation of Chinese military escalation - CNN"
  ],
  [
    1735292433000,
    "China conducted patrols around Scarborough Shoal in South China Sea, state media reports - Reuters"
  ],
  [
    1735292542000,
    "Boxing clever? China's next-gen tailless combat aircraft analysed - Royal Aeronautical Society"
  ],
  [
    1735294140000,
    "China Is Winning the Race for 5-Minute EV Charging - Business Insider"
  ],
  [
    1735295316000,
    "China Approves Dam on India Border That Could Be World’s Biggest - Bloomberg"
  ],
  [
    1735296064000,
    "China suffers commercial rocket failure but sets record for annual launches - SpaceNews"
  ],
  [
    1735296300000,
    "Chinese start-up DeepSeek’s new AI model outperforms Meta, OpenAI products - South China Morning Post"
  ],
  [
    1735296712000,
    "Trump's China strategy hinges on crippling Russia’s economy - Kyiv Independent"
  ],
  [
    1735297218000,
    "China Is Still Suffering an Economic Hangover - Foreign Policy"
  ],
  [
    1735297565000,
    "China’s launches new warship tipped to become world’s first ‘drone carrier’ - South China Morning Post"
  ],
  [
    1735297828000,
    "How China’s EV market could endure higher tariffs - Marketplace"
  ],
  [
    1735298673000,
    "Watch: China secretly flies advanced fighter jet - Yahoo! Voices"
  ],
  [
    1735299327000,
    "China steps up monitoring of emerging respiratory diseases - Reuters"
  ],
  [
    1735300483000,
    "Outgoing Raimondo admits China chip war a ‘fool’s errand’ - Asia Times"
  ],
  [
    1735300639000,
    "China's Economy Has a Tourism Problem - Newsweek"
  ],
  [
    1735300800000,
    "Joe Biden poses with Hunter's Chinese business associates in newly surfaced photos: 'Incredibly damning' - Fox News"
  ],
  [
    1735300809000,
    "China’s C919 airliner could spread wings to parts of Asia next year - South China Morning Post"
  ],
  [
    1735301437000,
    "China sanctions 7 companies over US military assistance to Taiwan - ABC News"
  ],
  [
    1735304307000,
    "Gao upsets Haddad Maia in United Cup marathon; China defeat Brazil - WTA Tennis"
  ],
  [
    1735305240000,
    "Driver in China Car-Ramming Attack Sentenced to Death - The Wall Street Journal"
  ],
  [
    1735306208000,
    "China’s trade tensions with US remain high as Trump tariffs loom - South China Morning Post"
  ],
  [
    1735306336000,
    "China’s Xi Says Nation Faces ‘Arduous’ Reform, Stability Tasks - Bloomberg"
  ],
  [
    1735306380000,
    "China unveils world's largest amphibious warship - Fox News"
  ],
  [
    1735306920000,
    "Escalating US-China Trade War to Hurt These Stocks in 2025 - Yahoo Finance"
  ],
  [
    1735307239000,
    "China and Nigeria Renew Currency Swap to Boost Bilateral Trade - Bloomberg"
  ],
  [
    1735307758000,
    "Images show novel Chinese military aircraft designs, experts say - Reuters"
  ],
  [
    1735308550000,
    "Chinese man sentenced to death for killing 35 people after driving into a crowd - ABC News"
  ],
  [
    1735310137000,
    "China investigates beef imports as oversupply squeezes prices - Reuters.com"
  ],
  [
    1735311600000,
    "Forget Beijing — The House China committee is up against Trump and Elon Musk - POLITICO"
  ],
  [
    1735311610000,
    "How a China-Philippines flashpoint could prove an early test for Trump - South China Morning Post"
  ],
  [
    1735313787000,
    "Seven Companies Hit With Chinese Sanctions Over US Support for Taiwan - Newsweek"
  ],
  [
    1735316372000,
    "Holiday china and an ode to Christmas - Smoky Mountain News"
  ],
  [
    1735318273000,
    "Brazil says workers at China's BYD site are victims of human trafficking - Reuters Canada"
  ],
  [
    1735319000000,
    "Driver who killed 35 in China car ramming sentenced to death - Al Jazeera English"
  ],
  [
    1735320006000,
    "US Plans More Actions Targeting China for Salt Typhoon Breach - Bloomberg"
  ],
  [
    1735320423000,
    "JBS, Marfrig Shares Drop as China Launches Beef-Import Probe - Yahoo Finance"
  ],
  [
    1735320446000,
    "See China’s new cutting-edge warship - CNN"
  ],
  [
    1735321200000,
    "China launches new amphibious assault ship in a race to rival US military - CNN"
  ],
  [
    1735326233000,
    "Elon Musk's Business Ties to China—What to Know as MAGA Turns on Trump Ally - Newsweek"
  ],
  [
    1735326658000,
    "Chinese court sentences man to death for driving into a crowd and killing 35 people - PBS NewsHour"
  ],
  [
    1735327817000,
    "New US cybersecurity measures follow alleged China-backed Salt Typhoon campaign - South China Morning Post"
  ],
  [
    1735328552000,
    "Massive Chinese espionage scheme hit 9th telecom firm, US says - VOA Asia"
  ],
  [
    1735328693000,
    "China's sixth-generation stealth jet takes maiden flight - Fox News"
  ],
  [
    1735328693000,
    "SEE IT: China stuns with maiden flight of sixth-generation aircraft - Fox News"
  ],
  [
    1735329600000,
    "China unveils amphibious assault ship that can launch fighter jets - Defense News"
  ],
  [
    1735329838000,
    "US adds 9th telcom to list of companies hacked by Chinese-backed Salt Typhoon cyberespionage - Reuters"
  ],
  [
    1735329981000,
    "China approves construction of mega-dam in Tibet - Radio Free Asia"
  ],
  [
    1735334040000,
    "Opinion | What ‘Engagers’ Got Right About China - The Wall Street Journal"
  ],
  [
    1735334157000,
    "China Floats Largest, Next-Generation Amphibious Assault Ship - The Maritime Executive"
  ],
  [
    1735334742000,
    "Chinese hackers used broad telco access to geolocate millions of Americans and record phone calls - POLITICO"
  ],
  [
    1735335720000,
    "Best China Stocks 2025: Tesla Rivals, Travel Plays Near Buy Points Amid Trump Tariff Fears - Investor's Business Daily"
  ],
  [
    1735336812000,
    "What will China’s new mega dam mean for India ties and Tibetan ecosystem? - South China Morning Post"
  ],
  [
    1735343312000,
    "Exclusive: Brazil yanks temp work visas for China's BYD after trafficking claims - Reuters.com"
  ],
  [
    1735343773000,
    "Comedy film 'Her Story' crushing China’s box office, could signal feminist culture shift - NBC News"
  ],
  [
    1735344732000,
    "China: A year of mass attacks reveals anger and frustration - BBC.com"
  ],
  [
    1735346940000,
    "China Launches Probe Into Beef Imports as Local Farmers Struggle - Bloomberg"
  ],
  [
    1735347613000,
    "Durian, the fashionable fruit that is changing tastes across China - South China Morning Post"
  ],
  [
    1735349408000,
    "Being Chinese | No stereotypes please, overseas Chinese students are a wonderful mix - South China Morning Post"
  ],
  [
    1735349820000,
    "Driver behind China car ramming attack that killed 35 is sentenced to death - The Guardian"
  ],
  [
    1735350840000,
    "A 9th telecoms firm has been hit by a massive Chinese espionage campaign, the White House says - The Associated Press"
  ],
  [
    1735351209000,
    "China catches up fast in AI race, but US chip curbs cast shadow - South China Morning Post"
  ],
  [
    1735354813000,
    "China’s Communist Party finds room for younger faces on promotions ladder - South China Morning Post"
  ],
  [
    1735357080000,
    "China to cut import tariffs on some recycled copper and aluminium raw materials - Reuters"
  ],
  [
    1735357980000,
    "Man who plowed car into crowd in China, killing 35, sentenced to death - CNN"
  ],
  [
    1735358695000,
    "‘Out of Africa’? Not so, says Chinese scientist challenging evolutionary theory - South China Morning Post"
  ],
  [
    1735363620000,
    "China is building new detention centers all over the country as Xi Jinping widens corruption purge - CNN"
  ],
  [
    1735363920000,
    "U.S.’s Channels With China Have Gone Dark With Trump’s Return - The Wall Street Journal"
  ],
  [
    1735365600000,
    "Inside China’s plan to conquer the Pacific - The Telegraph"
  ],
  [
    1735365609000,
    "Chinese woman wrapped in big plastic bag post-childbirth sparks curiosity - South China Morning Post"
  ],
  [
    1735372318000,
    "China unveils new futuristic fighter jets in surprise flyby - The Washington Post"
  ],
  [
    1735372320000,
    "China Urges Local Governments to Give Cash Handouts for New Year - Bloomberg"
  ],
  [
    1735380044000,
    "Mexico, Betting Trump Is Bluffing on Tariffs, Sees an Opportunity - The New York Times"
  ],
  [
    1735383600000,
    "Hunt: Laughter, lessons and dish towels found in a china cabinet - Wyoming Tribune"
  ],
  [
    1735384804000,
    "New railway linking China to Central Asia countries, bypassing Russia, begins construction in Kyrgyzstan - Kyiv Independent"
  ],
  [
    1735388577000,
    "China’s Xi calls on Politburo to lead by example in anti-corruption fight - South China Morning Post"
  ],
  [
    1735390800000,
    "How Jimmy Lai, a young entrepreneur-turned-billionaire, became China’s most dangerous man - New York Post"
  ],
  [
    1735390809000,
    "China’s final 2024 rocket fails but it’s still a record year for launches - South China Morning Post"
  ],
  [
    1735390833000,
    "China Built A Legal Great Wall. Congress Can’t Break It With PowerPoint - Forbes"
  ],
  [
    1735394412000,
    "Mideast and Trump front of mind as China, Iran foreign ministers meet - South China Morning Post"
  ],
  [
    1735399648000,
    "Notes from a Trip to China - NEJM Journal Watch Medical Blogs"
  ],
  [
    1735400760000,
    "See aboard China's new massive assault ship that can launch fighter jets or drones - Business Insider"
  ],
  [
    1735421146000,
    "WADA Unanimously Approves Recommendations Based on Chinese Doping Investigation - SwimSwam"
  ],
  [
    1735421907000,
    "Jimmy Carter: The US president who became China's friend - BBC.com"
  ],
  [
    1735423225000,
    "Too busy for love in time of baby bust: Chinese university students embrace being single - South China Morning Post"
  ],
  [
    1735426622000,
    "Ex-CDC Director Says 'Possible' US Created Viruses in China - Newsweek"
  ],
  [
    1735430400000,
    "China’s Record Dividend Payout Intensifies Pressure on the Yuan - Bloomberg"
  ],
  [
    1735431858000,
    "Bracing for a Chinese storm in the Indian Ocean - Deccan Herald"
  ],
  [
    1735432143000,
    "Video series: ‘China Beyond Borders’ looks at Beijing’s influence and intimidation - Radio Free Asia"
  ],
  [
    1735434008000,
    "China Olympic dive queen’s brother shuns US$28 million contracts to help farmers - South China Morning Post"
  ],
  [
    1735435807000,
    "Opinion | Hong Kong, Macau can grow China’s appeal in age of US containment - South China Morning Post"
  ],
  [
    1735437600000,
    "China Has Limited Firepower to Counter U.S. Tariffs - The Wall Street Journal"
  ],
  [
    1735437600000,
    "Why Japan is wary of teaming up with China to decarbonize Asia - Nikkei Asia"
  ],
  [
    1735437607000,
    "China’s visa-entry scheme leaves EU trio out in the cold. Why? - South China Morning Post"
  ],
  [
    1735437900000,
    "China unveils 450 km/h high-speed train prototype - China Daily"
  ],
  [
    1735437991000,
    "One-China is an indisputable fact, and Israelis must know this - opinion - The Jerusalem Post"
  ],
  [
    1735438920000,
    "Newly released pictures show Joe Biden meeting Hunter Biden’s Chinese business partners - CNN"
  ],
  [
    1735443254000,
    "Beijing seeks to curb ‘shakedown’ detentions of Chinese executives - Financial Times"
  ],
  [
    1735444826000,
    "Did a wet climate give rise to China’s first empires over 2,000 years ago? - South China Morning Post"
  ],
  [
    1735445100000,
    "China's fastest CR450 high-speed train prototype unveiled in Beijing, consolidating nation's edge in railway innovation - Global Times"
  ],
  [
    1735445460000,
    "Nio exceeds 2,900 swap stations in China, with 1,000 available to Onvo - CnEVPost"
  ],
  [
    1735446307000,
    "China’s record dividend payout puts yuan under pressure as US-China tensions simmer - South China Morning Post"
  ],
  [
    1735453047000,
    "China’s health bonds with key African partner Djibouti grow closer over TCM - South China Morning Post"
  ],
  [
    1735459200000,
    "J-36: Assessing China’s New Generation Combat Aircraft - The Diplomat"
  ],
  [
    1735459200000,
    "Why China Is Building a Thorium Molten-Salt Reactor - IEEE Spectrum"
  ],
  [
    1735459209000,
    "In Africa’s Gulf of Guinea, China is proving it is master of the sea - South China Morning Post"
  ],
  [
    1735459402000,
    "China Builds Over 200 New Prisons As Xi Jinping Ups Anti-Corruption Drive - NDTV"
  ],
  [
    1735462213000,
    "China Olympic champion Fan says fines were a surprise - Reuters.com"
  ],
  [
    1735466410000,
    "China ‘genius’ Blossoms Shanghai actress Wang Ju overcomes appearance criticism - South China Morning Post"
  ],
  [
    1735469280000,
    "Inside China's paramilitary force that could be key in an invasion of Taiwan - Business Insider"
  ],
  [
    1735470000000,
    "When Is Chinese New Year 2025? Why Monday’s Rare ‘Black Moon’ Sets Up ‘Year Of The Snake’ - Forbes"
  ],
  [
    1735470004000,
    "Opinion | A Revived Trump-Kim Bromance Could Shake Up the Authoritarian Axis - The New York Times"
  ],
  [
    1735470009000,
    "China’s ‘city of the future’ Xiongan marks latest step towards ambitious goals - South China Morning Post"
  ],
  [
    1735472442000,
    "Trader Joe's Of China? Pangdonglai, A Grocery Store The Masses Love To Trust - Worldcrunch"
  ],
  [
    1735473609000,
    "China-US team charts early evolution, from ‘boring billion’ to biodiversity boom - South China Morning Post"
  ],
  [
    1735473609000,
    "‘Boring billion’ to biodiversity boom: China-US team charts early evolutionary upheaval - South China Morning Post"
  ],
  [
    1735478205000,
    "China Focus: China debuts prototypes of world's fastest high-speed train - Xinhua"
  ],
  [
    1735478640000,
    "China's CR450: A new era of high-speed rail at 400 km/h - China Daily"
  ],
  [
    1735480320000,
    "Iran is going all-in on improving ties with China - this is why - analysis - The Jerusalem Post"
  ],
  [
    1735480614000,
    "Goldman sees nearly 43% upside for this little-known China robotaxi stock - CNBC"
  ],
  [
    1735480800000,
    "Fear That China Rules the Waves Jolts U.S. to Pursue Maritime Revival - The Wall Street Journal"
  ],
  [
    1735480815000,
    "China unveils the future of high-speed rail with a next-gen prototype - South China Morning Post"
  ],
  [
    1735481890000,
    "After 6th Gen Fighter Jet, China Unveils World's Largest Amphibious Ship. All About It - NDTV"
  ],
  [
    1735483440000,
    "China directs largest military build-up since 1930s Nazi Germany, expert warns, citing Pentagon report - Fox News"
  ],
  [
    1735484340000,
    "Boban Marjanovic heading to China - BasketNews.com"
  ],
  [
    1735485765000,
    "China’s firms are taking flight, worrying its rulers - The Economist"
  ],
  [
    1735486620000,
    "China unveils prototype of world's fastest train, capable of reaching 450 km/h - The Times of India"
  ],
  [
    1735486643000,
    "Panamanian President gives major reality check to Trump over China operates Panama Canal claim: ‘Whole world is free…' - Hindustan Times"
  ],
  [
    1735488002000,
    "Nvidia's defeatured H20 GPUs in China sell surprisingly well - Tom's Hardware"
  ],
  [
    1735488009000,
    "China stocks: Where to put money in 2025 - Yahoo Finance"
  ],
  [
    1735490192000,
    "Is China worried about Trump’s threats of a trade war? - Al Jazeera English"
  ],
  [
    1735494900000,
    "China's Xi Jinping asked 'What’s so bad about deflation?' amid economic slowdown, report says - Fortune"
  ],
  [
    1735496461000,
    "Sen. Cardin says Trump's tough talk on Panama Canal could push allies to China, Russia - ABC News"
  ],
  [
    1735499296000,
    "Share Covid data, World Health Organization tells China - BBC.com"
  ],
  [
    1735502404000,
    "The World’s Biggest Dam Is the Last Thing China Needs - Bloomberg"
  ],
  [
    1735508140000,
    "‘An old friend’ of China: former US president Jimmy Carter dies aged 100 - South China Morning Post"
  ],
  [
    1735508287000,
    "Carter Will be Remembered for His Betrayal of Free China - The New York Sun"
  ],
  [
    1735509622000,
    "‘Phase 2 China shock is coming’: Adam Tooze on Europe, America and manufacturing - South China Morning Post"
  ],
  [
    1735511409000,
    "Editorial | Clean start needed for China football to score - South China Morning Post"
  ],
  [
    1735513626000,
    "Building a Great Solar Wall in China - nasa.gov"
  ],
  [
    1735514280000,
    "China’s efforts to prop up its flagging stock market has made yuan a casualty - ForexLive"
  ],
  [
    1735518660000,
    "China’s Top Stock of 2024 Cambricon Eyes Boost From AI Self-Reliance - Bloomberg"
  ],
  [
    1735520410000,
    "Classmates’ love dispels fears over Chinese girl with different coloured eyes - South China Morning Post"
  ],
  [
    1735520415000,
    "How Vietnam emerged as a serious rival to China’s export machine - South China Morning Post"
  ],
  [
    1735520760000,
    "Chinese youth flock to civil service, but slow economy puts 'iron rice bowl' jobs at risk - Reuters"
  ],
  [
    1735521452000,
    "Chinese teen sentenced to life in prison for classmate's death - BBC.com"
  ],
  [
    1735522783000,
    "China Shocked, EU Heartbroken: How World Reacted To South Korea Plane Crash - NDTV"
  ],
  [
    1735524013000,
    "Did China’s Baidu discover scaling laws before OpenAI? A debate is rekindled - South China Morning Post"
  ],
  [
    1735525808000,
    "Visa-free China, students embrace being single, Tibet mega dam: 5 weekend reads - South China Morning Post"
  ],
  [
    1735527600000,
    "China races to secure advanced U.S. chip materials ahead of new year - Nikkei Asia"
  ],
  [
    1735528500000,
    "Carter made the decision to establish relations with China - New Hampshire Public Radio"
  ],
  [
    1735530120000,
    "China’s Stock Fund Issuance Drops as Fixed Income Back in Favor - Bloomberg"
  ],
  [
    1735531591000,
    "A Trump defence pick points to US Forces Korea shifting focus to China - South China Morning Post"
  ],
  [
    1735532460000,
    "‘An old friend’: Former US President Jimmy Carter remembered in China for establishing diplomatic ties - CNN"
  ],
  [
    1735532700000,
    "‘Big World,’ ‘Octopus’ Propel China’s Box Office to Year-End Surge as ‘Mufasa’ Drops to Fifth Place - Variety"
  ],
  [
    1735534200000,
    "China's Dec manufacturing activity seen expanding for third month: Reuters poll - Reuters"
  ],
  [
    1735534320000,
    "China court hands boy life sentence for murdering classmate - The Times of India"
  ],
  [
    1735534860000,
    "LVMH Sales Have Been Hurt By Weakness in China. A Turnaround Could Boost U.S. Shares. - Barron's"
  ],
  [
    1735536600000,
    "Tesla denies Cybertruck will go on sale in China in Jan after rumors resurface - CnEVPost"
  ],
  [
    1735536830000,
    "China-developed Audi E gets ready to launch in summer 2025 - CarNewsChina.com"
  ],
  [
    1735537977000,
    "What UK fighter pilots did and didn’t teach China’s PLA - Asia Times"
  ],
  [
    1735540385000,
    "Local officials replaced in wake of China’s worst lone wolf car attack in Zhuhai - South China Morning Post"
  ],
  [
    1735541340000,
    "China’s Xinjiang completes world’s longest expressway tunnel, paving way for new shortcut - Global Times"
  ],
  [
    1735544040000,
    "China Fights Rumors of Panda Abuse at US Zoo in Sign of Goodwill - Bloomberg"
  ],
  [
    1735545614000,
    "China’s cattle farmers, in beef with importers, lobby for trade probe as prices drop - South China Morning Post"
  ],
  [
    1735546252000,
    "ECB’s Knot Says Trade War Could Export China Deflation to Europe - Bloomberg"
  ],
  [
    1735546264000,
    "Five things at the top of China’s agenda for 2025 - The Conversation"
  ],
  [
    1735546800000,
    "China's Xi offers deep condolences over Jimmy Carter's death - CNA"
  ],
  [
    1735547066000,
    "Is Australia taking myopic approach in wooing Pacific nations to counter China? - South China Morning Post"
  ],
  [
    1735548286000,
    "China ramps up combat readiness at Scarborough Shoal - Radio Free Asia"
  ],
  [
    1735548671000,
    "China Unveils World's Fastest High-Speed Train Prototype - NDTV"
  ],
  [
    1735549201000,
    "China's Plans To Tackle Population Crisis in 2025 - Newsweek"
  ],
  [
    1735549975000,
    "China urges more aid for people in need as economic woes persist - Reuters"
  ],
  [
    1735551000000,
    "Huawei slashes prices in fight for China's high-end smartphone market share - Yahoo Finance"
  ],
  [
    1735551514000,
    "Taiwan board game invites players to imagine Chinese invasion - Reuters"
  ],
  [
    1735552402000,
    "China’s space agency faces leadership change amid shake-up - SpaceNews"
  ],
  [
    1735552825000,
    "Chinese tunnel crews punch through mountains for Xinjiang expressway project - South China Morning Post"
  ],
  [
    1735552884000,
    "Oral History Project Considers Impact of Bringing Modern Dance to China - The New York Times"
  ],
  [
    1735552884000,
    "Bringing Modern Dance, Once Forbidden, to China - The New York Times"
  ],
  [
    1735553716000,
    "AT&T and Verizon say networks are secure after being breached by China-linked Salt Typhoon hackers - TechCrunch"
  ],
  [
    1735554623000,
    "China charges Myanmar Golden Triangle suspects with murder and fraud - South China Morning Post"
  ],
  [
    1735554786000,
    "China court hands schoolboy a life sentence for murder - Al Jazeera English"
  ],
  [
    1735556400000,
    "China wants to restore the sea with high-tech marine ranches - MIT Technology Review"
  ],
  [
    1735557330000,
    "Gao upsets Siegemund to seal China's United Cup quarterfinal spot - WTA Tennis"
  ],
  [
    1735559619000,
    "Xi Tells Biden China-US Ties \"One Of The Most Important\" In World: Report - NDTV"
  ],
  [
    1735560120000,
    "China unveils cutting-edge aerial and maritime military equipment - Semafor"
  ],
  [
    1735560276000,
    "China mandates 30% EVs in government fleets in boost for carmakers, net zero - South China Morning Post"
  ],
  [
    1735561800000,
    "Panama Canal controversy may deepen strain in US-China relations - The Hill"
  ],
  [
    1735562695000,
    "China's November net gold imports via Hong Kong hit seven-month high - Reuters"
  ],
  [
    1735563613000,
    "China’s C919 preps for busy 2025 as manufacturer makes expansion plans - South China Morning Post"
  ],
  [
    1735563822000,
    "Satellite manufacturer for Chinese megaconstellation secures $137 million funding - SpaceNews"
  ],
  [
    1735565400000,
    "China Issues Second Batch of Crude Oil Import Quotas - OilPrice.com"
  ],
  [
    1735565577000,
    "China Is Building More Prisons for Xi's Political Enemies—Report - Newsweek"
  ],
  [
    1735565898000,
    "China’s CTG Said to Ink Deal for Northleaf’s Spanish Solar Plant - Bloomberg"
  ],
  [
    1735567111000,
    "China unveils new assault ship and futuristic fighter jets - VOA Asia"
  ],
  [
    1735567213000,
    "Trump’s first 100 days: can Beijing stop downwards spiral in US-China ties? - South China Morning Post"
  ],
  [
    1735567860000,
    "China court hands teen life prison sentence for classmate's \"particularly cruel\" murder - CBS News"
  ],
  [
    1735570291000,
    "China’s Central Bank Highlights Cryptocurrency Regulation in Financial Stability Report - Yahoo Finance"
  ],
  [
    1735577028000,
    "Tesla China denies Cybertruck sale rumors for January - TESLARATI"
  ],
  [
    1735578000000,
    "China's reliance on U.S. trade hits new low as Trump tariffs loom - Nikkei Asia"
  ],
  [
    1735579860000,
    "Trump tariff threat has 40% of Japan execs rethinking China strategy - Nikkei Asia"
  ],
  [
    1735582280000,
    "WHO implores China to share data, access to learn about Covid-19’s origins - South China Morning Post"
  ],
  [
    1735585290000,
    "Jimmy Carter's passing met with mixed reactions in China, Taiwan - VOA Asia"
  ],
  [
    1735589286000,
    "US Treasury Says Was Targeted By China State-sponsored Cyberattack - Barron's"
  ],
  [
    1735590007000,
    "China Hacked Treasury Dept. in ‘Major’ Breach, U.S. Says - The New York Times"
  ],
  [
    1735592127000,
    "US Treasury Says It Was Breached by Chinese-Backed Hacker - Bloomberg"
  ],
  [
    1735592400000,
    "Chinese hackers breach US treasury network, gain access to some files - The Guardian US"
  ],
  [
    1735594364000,
    "US Treasury says China accessed government documents in ‘major’ cyberattack - TechCrunch"
  ],
  [
    1735594620000,
    "Chinese hackers infiltrate US Treasury in major cyberattack, officials tell Congress - New York Post"
  ],
  [
    1735594690000,
    "'It was destiny': How Jimmy Carter embraced China and changed history - BBC.com"
  ],
  [
    1735595429000,
    "U.S. Treasury says computers hacked by a Chinese 'threat actor' - NBC News"
  ],
  [
    1735595790000,
    "China denies it was behind US Treasury hack - South China Morning Post"
  ],
  [
    1735595885000,
    "Treasury workstations hacked by China-linked threat actors - CyberScoop"
  ],
  [
    1735596008000,
    "China rolls out world’s first military-proof 5G that can connect 10,000 robots - South China Morning Post"
  ],
  [
    1735596277000,
    "China blamed by US for Treasury Department hack - Al Jazeera English"
  ],
  [
    1735596424000,
    "Treasury Department hit in cyberbreach by China-sponsored actor, officials say - ABC News"
  ],
  [
    1735596933000,
    "China’s Dominance In EVs Is A Warning For U.S. Automakers - Forbes"
  ],
  [
    1735597022000,
    "US Treasury says it was hacked by China in 'major incident' - BBC.com"
  ],
  [
    1735597232000,
    "China hacked Treasury Department earlier this month: Officials - NewsNation Now"
  ],
  [
    1735598735000,
    "US Treasury says China-backed hackers breached its computer systems - Scripps News"
  ],
  [
    1735598831000,
    "China hacked U.S. Treasury Department to access workstations and documents, agency says - CBC.ca"
  ],
  [
    1735598880000,
    "Chinese hackers access U.S. Treasury Department workstations, obtain unclassified documents - CBS News"
  ],
  [
    1735599150000,
    "Chinese hackers stole documents in 'major incident,' Treasury Department says - USA TODAY"
  ],
  [
    1735599215000,
    "China hacked several Treasury workstations as part of BeyondTrust intrusions, U.S. says - Axios"
  ],
  [
    1735599608000,
    "My Take | China economy: Beijing must make strong preparations for a period of slow growth - South China Morning Post"
  ],
  [
    1735599617000,
    "Treasury Dept. says China state-sponsored hacker accessed unclassified documents - NBC News"
  ],
  [
    1735601405000,
    "Chinese State Hackers Breach US Treasury Department - Dark Reading"
  ],
  [
    1735601421000,
    "'China Is Not A Developing Nation,' Says Kevin O'Leary Claims They're At 'An Economic War With Us' - Yahoo Finance"
  ],
  [
    1735601880000,
    "Treasury Department Says Systems Hacked by China-Backed Actor - The Wall Street Journal"
  ],
  [
    1735606409000,
    "China slams claims of cyberattack on US Treasury - DW (English)"
  ],
  [
    1735606437000,
    "WHO still waiting on COVID origins data from China - DW (English)"
  ],
  [
    1735606710000,
    "China’s big new combat aircraft: a technical assessment - The Strategist"
  ],
  [
    1735609140000,
    "China's December factory activity growth misses expectations as analysts decry insufficient stimulus - CNBC"
  ],
  [
    1735609980000,
    "China’s Manufacturing Activity Expands at Slower Pace - The Wall Street Journal"
  ],
  [
    1735610424000,
    "Philippines wrestles with how to face down China while policing 7,000 islands - Financial Times"
  ],
  [
    1735612063000,
    "China EV maker BYD closes in on Tesla as sales jump - BBC.com"
  ],
  [
    1735613520000,
    "China's Xpeng plans to hire more than 6,000 workers in 2025 - Reuters"
  ],
  [
    1735614609000,
    "China charged Japanese woman with espionage for activities in Japan - Kyodo News Plus"
  ],
  [
    1735615797000,
    "US Treasury Department Admits It Got Hacked by China - WIRED"
  ],
  [
    1735617044000,
    "China’s Services Activity Jumps as Stimulus Lifts Local Demand - Yahoo Finance"
  ],
  [
    1735618021000,
    "China, Russia always moving forward 'hand in hand', Xi tells Putin - Reuters"
  ],
  [
    1735618560000,
    "China’s Factory Activity Expands Again as Economy Stabilizes - Bloomberg"
  ],
  [
    1735619892000,
    "Weakened Russia yields to China’s energy, railway desires - Asia Times"
  ],
  [
    1735621020000,
    "China approves more GM crops to boost yields, ensure food security - Reuters.com"
  ],
  [
    1735621200000,
    "The Obstacles to China’s AI Power - Foreign Affairs Magazine"
  ],
  [
    1735621271000,
    "Chinese Muslims, After Finding a Refuge in Queens, Now Fear Trump - The New York Times"
  ],
  [
    1735621271000,
    "Migrant Chinese Muslims in NYC Say They Now Fear Trump - The New York Times"
  ],
  [
    1735621320000,
    "Beijing Pushes to Use China-Made Chips in Its EVs - The Wall Street Journal"
  ],
  [
    1735622820000,
    "Cocoa tops global commodities rally for 2nd year, steel ingredients struggle on China demand - Reuters"
  ],
  [
    1735623208000,
    "Hong Kong’s Billionaire Cheng Family Seeks to Sell China Toll Roads for $2 Billion - Yahoo Finance"
  ],
  [
    1735623420000,
    "The US Treasury says some computers were breached by China-backed hackers - Business Insider"
  ],
  [
    1735624804000,
    "Opinion | A China-Taiwan War Would Start an Economic Crisis. America Isn’t Ready. - The New York Times"
  ],
  [
    1735624833000,
    "Treasury says Chinese hackers remotely accessed documents in 'major' cyber incident - NPR"
  ],
  [
    1735625176000,
    "China Industries to Watch in 2025 - China Briefing"
  ],
  [
    1735625700000,
    "China Raises Salaries for Government Workers to Boost Spending - Bloomberg"
  ],
  [
    1735626449000,
    "China's Xi expects 2024 GDP growth of around 5%, state media says - Reuters.com"
  ],
  [
    1735626720000,
    "China’s manufacturing activity slows in December as trade risks grow - The Associated Press"
  ],
  [
    1735627860000,
    "China factory activity grows more slowly, services recover - Reuters.com"
  ],
  [
    1735630200000,
    "WHO implores China to finally share Covid origins data, five years on - The Guardian"
  ],
  [
    1735630980000,
    "‘Major incident’: China-backed hackers breached US Treasury workstations - CNN"
  ],
  [
    1735631580000,
    "China unveils prototype for what could be the world’s fastest high-speed train - CNN"
  ],
  [
    1735632535000,
    "China rejects accusations it targeted US Treasury in cyberattack - FRANCE 24 English"
  ],
  [
    1735632840000,
    "WHO urges China to share Covid origins data, five years on from pandemic’s emergence - CNN"
  ],
  [
    1735632840000,
    "Chinese hackers accessed workstations and documents in a ‘major’ cyber incident, Treasury says - The Associated Press"
  ],
  [
    1735636999000,
    "‘Moral imperative’: WHO presses China to share COVID origins data - Al Jazeera English"
  ],
  [
    1735639320000,
    "Chinese Companies Have Sidestepped Trump’s Tariffs. They Could Do It Again. - The New York Times"
  ],
  [
    1735642550000,
    "U.S. Treasury Hacked—FBI Investigation Underway, China Suspected - Forbes"
  ],
  [
    1735644591000,
    "Treasury Department Systems Hacked by China, Reports Say - Investopedia"
  ],
  [
    1735644940000,
    "China recalls cars from Tesla, Trumpchi as safety issues emerge - South China Morning Post"
  ],
  [
    1735644987000,
    "China's Xi Says 'No One Can Stop' Unification With Taiwan - Barron's"
  ],
  [
    1735646171000,
    "Xi says no one can stop China's 'reunification' with Taiwan - Reuters"
  ],
  [
    1735646340000,
    "Full text of President Xi Jinping's 2025 New Year message_Ministry of Foreign Affairs of the People's Republic of China - MFA China"
  ],
  [
    1735646409000,
    "‘All frequencies’: China releases sixth-generation stealth fighter standard - South China Morning Post"
  ],
  [
    1735646975000,
    "Xi Says China’s 2024 GDP Growth Set to Hit Target of Around 5% - Bloomberg"
  ],
  [
    1735647075000,
    "China's Xi pledges more proactive economic policies in 2025 - Reuters.com"
  ],
  [
    1735647300000,
    "China's cyber intrusions took a sinister turn in 2024 - The Register"
  ],
  [
    1735648028000,
    "China’s Xi highlights ‘world peace’ in New Year’s message to Russia’s Putin - Al Jazeera English"
  ],
  [
    1735649119000,
    "China’s December Home Sales Stay Flat in Sign of Stabilization - Bloomberg"
  ],
  [
    1735649348000,
    "Xi Jinping signals growth is priority in speech acknowledging China’s strains - Financial Times"
  ],
  [
    1735649880000,
    "Xi says China’s economy on course to expand by 5% despite Trump concerns - The Guardian"
  ],
  [
    1735650512000,
    "For China, 2025 Will Be About How Xi Tackles the Economy - World Politics Review"
  ],
  [
    1735653608000,
    "China’s bid to bring back foreign visitors is bearing fruit, but is it enough? - South China Morning Post"
  ],
  [
    1735653960000,
    "As Covid lab leak suspicion lingers, WHO urges China to share virus origin data - POLITICO Europe"
  ],
  [
    1735655566000,
    "China defends COVID-19 data-sharing as WHO seeks more access - Reuters"
  ],
  [
    1735655634000,
    "China seeks greater global cooperation on drug control - Reuters"
  ],
  [
    1735657446000,
    "Xi urges confidence in China’s economy as GDP growth on track to hit target - South China Morning Post"
  ],
  [
    1735658300000,
    "\"No One Can Stop...\": China's Xi Jinping Ends 2024 With A Threat To Taiwan - NDTV"
  ],
  [
    1735658615000,
    "Xi Jinping has much to worry about in 2025 - The Economist"
  ],
  [
    1735659017000,
    "China to lower dollar, euro and yen weightings in CFETS yuan basket in 2025 - Reuters"
  ],
  [
    1735661400000,
    "China’s Xi Jinping Nods to ‘External Uncertainties’ in New Year’s Speech - The Wall Street Journal"
  ],
  [
    1735662600000,
    "Trump confidant Elon Musk’s China ties pose security risk, ex-general warns - The Guardian"
  ],
  [
    1735663603000,
    "Why Nvidia’s (NVDA) China Revenue Is Guaranteed Despite Restrictions - Yahoo Finance"
  ],
  [
    1735664567000,
    "Tesla to fix software for 77,650 China-made vehicles, says market regulator - Reuters"
  ],
  [
    1735667135000,
    "2025’s Biggest Surprise: Could China’s Economy Fall Off a Cliff? - FOREX.com US"
  ],
  [
    1735667325000,
    "After the Fall: China’s Economy in 2025 - Rhodium Group"
  ],
  [
    1735670581000,
    "China is catching up with America in quantum technology - The Economist"
  ],
  [
    1735672198000,
    "5 Predictions for China in 2025 - Foreign Policy"
  ],
  [
    1735675630000,
    "WHO continues to urge China to share data five years after COVID-19 - UN News"
  ],
  [
    1735675860000,
    "Top Republican demands 'costs' for China after it hacked Treasury Dept in year marked by CCP espionage - Fox News"
  ],
  [
    1735676218000,
    "Chinese stocks post first annual gain since 2020, HK ends 4-year rout - Reuters.com"
  ],
  [
    1735677296000,
    "Tesla sales stall as China's BYD closes in - BBC.com"
  ],
  [
    1735677552000,
    "US Blames China for Treasury Breach Amid Telecom Hacking Spree - Yahoo Finance"
  ],
  [
    1735679100000,
    "Tesla China Shines But Will U.S., Europe Weigh On Q4 Deliveries? - Investor's Business Daily"
  ],
  [
    1735682291000,
    "Xi says China's annexation of Taiwan can't be stopped - UPI News"
  ],
  [
    1735682625000,
    "This 100-Year Set of Fine China Has Passed Through 5 Generations of Women - The New York Times"
  ],
  [
    1735682625000,
    "One Set of China. Five Generations. - The New York Times"
  ],
  [
    1735688780000,
    "US prepares to deorbit International Space Station amid China competition - Fox News"
  ],
  [
    1735691150000,
    "What to know about string of US hacks blamed on China - BBC.com"
  ],
  [
    1735693680000,
    "Taiwan president wants exchanges with China, sees lack of goodwill - Yahoo! Voices"
  ],
  [
    1735697340000,
    "Taiwan’s Lai Vows to Show Determination to Fight as China Looms - Bloomberg"
  ],
  [
    1735699082000,
    "China steps up drive to break Boeing and Airbus grip on plane market - Financial Times"
  ],
  [
    1735700040000,
    "China December new home prices rise a touch faster, survey shows - Reuters"
  ],
  [
    1735701900000,
    "South Korea’s Export Momentum Grows on Demand From China - Bloomberg"
  ],
  [
    1735702812000,
    "Xi Jinping, China’s Leader, Nods to Economic Challenges - The New York Times"
  ],
  [
    1735704132000,
    "Trump 2.0, conflict in Ukraine to end and China challenging global world order - what can we expect in 2025? - Sky News"
  ],
  [
    1735705808000,
    "Chinese high-speed rail, Covid-19’s origins: 7 science highlights - South China Morning Post"
  ],
  [
    1735707657000,
    "US investors in China venture funds race to comply with new tech rules - Financial Times"
  ],
  [
    1735708140000,
    "China’s Economy Is Burdened by Years of Excess. Here’s How Bad It Really Is. - The Wall Street Journal"
  ],
  [
    1735709340000,
    "Taiwan president vows to boost the island’s defense budget as China threats rise - The Associated Press"
  ],
  [
    1735710018000,
    "Taiwan's president says Beijing remains the obstacle for resuming cross-strait exchanges - VOA Asia"
  ],
  [
    1735711204000,
    "Opinion | The Panama Canal Has a Big Problem, but It’s Not China or Trump - The New York Times"
  ],
  [
    1735712031000,
    "U.S. Companies Vouched for China During Trump’s First Term. Not Anymore. - The Wall Street Journal"
  ],
  [
    1735718409000,
    "Chinese military’s range in West Pacific expands with new early warning aircraft - South China Morning Post"
  ],
  [
    1735719995000,
    "US Treasury hacked: Are China and the US stepping up their cyberwar? - Al Jazeera English"
  ],
  [
    1735720948000,
    "China 2024 box office revenue plunges as industry downturn deepens - Reuters"
  ],
  [
    1735722015000,
    "Over 350 top figures punished in China’s medical corruption crackdown in 2024 - South China Morning Post"
  ],
  [
    1735723800000,
    "China struggles to build car chip supply chain to break free of heavy reliance on imports - Yahoo Finance"
  ],
  [
    1735724528000,
    "China In Eurasia Briefing: The Stories To Watch In 2025 - Radio Free Europe / Radio Liberty"
  ],
  [
    1735725613000,
    "Tiny Chinese doctor carried to house calls on wife’s back, treats 2,000-plus people - South China Morning Post"
  ],
  [
    1735726052000,
    "Kim's Closeness With Putin Tests North Korea's Alliance With China - Newsweek"
  ],
  [
    1735728782000,
    "Taiwan president welcomes exchanges with China as Xi says no one can stop 'reunification' - NBC News"
  ],
  [
    1735729367000,
    "Will China Invade Taiwan? Will Trump Keep His Promises? And Is Polyamory Finally Out? - The FP"
  ],
  [
    1735732809000,
    "China’s drones reignite firework industry after years-long decline - South China Morning Post"
  ],
  [
    1735733011000,
    "How China box office losing $1.64 billion in revenue due to historic industry downturn can dash Bollywood's 2025 hopes - Hindustan Times"
  ],
  [
    1735733510000,
    "China's Alibaba to sell Sun Art stake to DCP for $1.6 billion - Reuters"
  ],
  [
    1735734608000,
    "Opinion | US sanctions on Pakistan will only push it closer to China - South China Morning Post"
  ],
  [
    1735736400000,
    "China is forcing out foreign car companies - The Hill"
  ],
  [
    1735737063000,
    "Putin orders Russian government and top bank to develop AI cooperation with China - Reuters"
  ],
  [
    1735738809000,
    "China’s 6th-gen stealth jet smashes radar evasion military standard, claims study - Yahoo! Voices"
  ],
  [
    1735738904000,
    "In 2024, China saw warmest year in decades, breaking records yet again - Reuters"
  ],
  [
    1735740009000,
    "Why Trump 2.0 could push China-US relations into ‘high-risk’ territory - South China Morning Post"
  ],
  [
    1735740011000,
    "Beijing sanctions, US’ Chinese migrants under Trump: 7 US-China relations reads - South China Morning Post"
  ],
  [
    1735740960000,
    "China EV Makers Report Record Sales To End 2024 As Tesla-BYD Price War Rages - Investor's Business Daily"
  ],
  [
    1735750208000,
    "China says Tesla to update software for over 77K China-made cars, Reuters says - Yahoo Finance"
  ],
  [
    1735764206000,
    "China-backed election raises fears of 'negative peace' in Myanmar - VOA Asia"
  ],
  [
    1735767008000,
    "Opinion | Dialogue can help China, India sidestep disputes over mega dam - South China Morning Post"
  ],
  [
    1735768820000,
    "Why Beijing’s Taiwan integration experiment in Fujian is starting to fizzle - South China Morning Post"
  ],
  [
    1735769634000,
    "Putin orders Russian government, top bank to cooperate with China on AI tech. - Kyiv Independent"
  ],
  [
    1735770180000,
    "The Guardian view on Russia and China: an old friendship poses new threats - The Guardian"
  ],
  [
    1735770600000,
    "How COVID-19 Transformed China’s Domestic and International Trajectory - The Diplomat"
  ],
  [
    1735771360000,
    "China’s Xi addresses economic challenges, threatens Taiwan in New Year speech - The Washington Post"
  ],
  [
    1735772795000,
    "The new Great Wall: China’s $70 billion, 2,700-mile water transfer mega-project - Yahoo! Voices"
  ],
  [
    1735772947000,
    "China's young workers - overqualified and in low-paying jobs - BBC.com"
  ],
  [
    1735775962000,
    "China stocks lead losses in Asia as manufacturing slows; Singapore annual GDP growth rises to 4% - CNBC"
  ],
  [
    1735776327000,
    "VOA Mandarin: Quantum technology a key battleground in US-China competition - VOA Asia"
  ],
  [
    1735777066000,
    "VOA Mandarin: What cards does China hold in US-China tech, trade battles? - VOA Asia"
  ],
  [
    1735777655000,
    "China Health Commission to narrow gaps in mental health services - Reuters"
  ],
  [
    1735778971000,
    "China’s J-36 stealth fighter another blow to US air superiority - Asia Times"
  ],
  [
    1735779600000,
    "China May Miss Target for Cleaning Up Largest Steel Industry - Bloomberg"
  ],
  [
    1735782420000,
    "Growth in China's factory activity slows, Caixin PMI shows - Reuters"
  ],
  [
    1735783209000,
    "Why 2024 was the ‘most violent, dangerous’ point in Philippine-China ties - South China Morning Post"
  ],
  [
    1735784220000,
    "Chinese hack of US Treasury breached sanctions office, Washington Post says - Reuters"
  ],
  [
    1735786860000,
    "China's Wingtech abandons Apple ambitions after U.S. blacklisting - Nikkei Asia"
  ],
  [
    1735787460000,
    "Metals Push Higher With Focus on Outlook for China as 2025 Opens - Bloomberg"
  ],
  [
    1735790409000,
    "China beats Starlink to hi-res space-ground laser transmission at 6G standard - South China Morning Post"
  ],
  [
    1735794044000,
    "How to invest in a much-changed China - Financial Times"
  ],
  [
    1735794091000,
    "Shipowners switch to smaller vessels as world trade reroutes from China - Financial Times"
  ],
  [
    1735795817000,
    "Philippines recovers suspected Chinese submarine drone from sea - South China Morning Post"
  ],
  [
    1735796460000,
    "China’s Late-Year EV Sales Boom Gives Way to Rocky 2025 View - Bloomberg"
  ],
  [
    1735797161000,
    "2025 Import-Export Tariffs in China: Latest Adjustments - China Briefing"
  ],
  [
    1735797360000,
    "Taiwan reports first Chinese 'combat patrol' of the New Year - Reuters"
  ],
  [
    1735797684000,
    "Weather agency says China experienced hottest year on record in 2024 - Al Jazeera English"
  ],
  [
    1735797734000,
    "Apple offers iPhone discounts in China as competition intensifies - Reuters"
  ],
  [
    1735799040000,
    "China's 2025 iron ore imports set to hit new high even as steel demand dwindles - Reuters.com"
  ],
  [
    1735801980000,
    "China Helping Houthis Obtain Weapons For Unmolested Red Sea Passage - i24NEWS"
  ],
  [
    1735802820000,
    "Chinese Stocks Tumble in Worst Start to a Year Since 2016 - Bloomberg"
  ],
  [
    1735803331000,
    "Treasury’s sanctions office hacked by Chinese government, officials say - The Washington Post"
  ],
  [
    1735804260000,
    "China’s box office had a terrible 2024 - CNN"
  ],
  [
    1735804800000,
    "China’s Growth in 2025 Depends on Battling Storms on Many Fronts - Bloomberg"
  ],
  [
    1735805647000,
    "China slaps dual-use export ban on 28 US defence contractors - South China Morning Post"
  ],
  [
    1735806094000,
    "China adds 28 US entities to export control list - Yahoo! Voices"
  ],
  [
    1735810138000,
    "Chinese Naval Developments 2024 In Review – Part 1: Major Programs - Naval News"
  ],
  [
    1735810172000,
    "China's electric car boom is increasingly more about hybrids - CNBC"
  ],
  [
    1735810860000,
    "‘I was very lucky’: activist and blogger Lu Yuyu on escaping China - The Guardian"
  ],
  [
    1735810860000,
    "Chinese government hackers targeted US Treasury office that administers sanctions – report - The Guardian US"
  ],
  [
    1735811640000,
    "This lantern workshop in China is making snakes look cute for the Lunar New Year - The Associated Press"
  ],
  [
    1735812588000,
    "Chinese EV makers extend buying incentives as price war enters third year - Reuters.com"
  ],
  [
    1735814714000,
    "Beijing Calls Washington’s Bluff on Strategic Metals - The Nation"
  ],
  [
    1735817405000,
    "A ‘Made in China’ Crisis Awaits Big Auto in 2025 - Bloomberg"
  ],
  [
    1735817784000,
    "China and Russia Forge Major Tech Collaboration To Challenge US - Newsweek"
  ],
  [
    1735818162000,
    "China Hits Dozens of U.S. Companies With Trade Controls - The New York Times"
  ],
  [
    1735819484000,
    "China’s electric-vehicle leader BYD posts record sales in 2024 - Financial Times"
  ],
  [
    1735820092000,
    "U.S. Department of Defense Sounds Alarm Bells About China’s Growing Presence in Arctic - gCaptain"
  ],
  [
    1735820155000,
    "Donald Trump’s China Nightmare Could Have Already Come True - Forbes"
  ],
  [
    1735820994000,
    "Suspected Chinese underwater spy drone found by fishermen in waters off the Philippines - CBS News"
  ],
  [
    1735821558000,
    "Lockheed Martin, Boeing Defense Among 45 US Entities Penalised By China - NDTV"
  ],
  [
    1735821660000,
    "Oil prices rise to kick off 2025, boosted by China stimulus hopes - MarketWatch"
  ],
  [
    1735821765000,
    "China Sanctions Lockheed, Raytheon, Eight Others Over Taiwan Arms Sales - The Defense Post"
  ],
  [
    1735825226000,
    "China to debut new Long March and commercial rockets in 2025 - SpaceNews"
  ],
  [
    1735826785000,
    "China approves the world’s most expensive infrastructure project - The Economist"
  ],
  [
    1735827480000,
    "China adds 28 US companies to export control list, 10 to unreliable entities list - Global Times"
  ],
  [
    1735827511000,
    "Breaking Down China's Economic Challenges - The Wall Street Journal"
  ],
  [
    1735830249000,
    "China Faces New Virus Outbreak Five Years After Covid Crisis - NDTV"
  ],
  [
    1735832841000,
    "US considers potential rules to restrict or bar Chinese drones - Reuters"
  ],
  [
    1735833093000,
    "China proposes further export curbs on battery, critical minerals tech - Reuters.com"
  ],
  [
    1735835640000,
    "GOP lawmakers request Yellen briefing on Chinese hackers’ Treasury breach - The Hill"
  ],
  [
    1735835760000,
    "China 2025: 5 Predictions to Watch in the New Year - Agweb Powered by Farm Journal"
  ],
  [
    1735837425000,
    "Commerce Department seeks to potentially restrict or ban drones from China - ABC News"
  ],
  [
    1735839064000,
    "China, Russia, and Ukraine: December 2024 - Council on Foreign Relations"
  ],
  [
    1735839360000,
    "Apple discounts new iPhones in China amid increasing smartphone competition - Business Insider"
  ],
  [
    1735840562000,
    "China Plans Export Curbs on Battery Parts, Mineral Technology - Bloomberg"
  ],
  [
    1735842060000,
    "Apple Stock Falls on Report of China iPhone Discounts. ‘Winter Is Here,’ Analyst Says. - Barron's"
  ],
  [
    1735842557000,
    "Video. After the Dragon, China prepares for the Year of the Snake - Euronews"
  ],
  [
    1735842721000,
    "Cobalt miner Jervois in rescue deal to better compete with China - Reuters.com"
  ],
  [
    1735843568000,
    "'Slow grind' tipped for 2025 economy as interest rates, unemployment, inflation, China and Trump collide - ABC News"
  ],
  [
    1735847132000,
    "U.S. Weighs Ban on Chinese Drones, Citing National Security Concerns - The New York Times"
  ],
  [
    1735848853000,
    "Oil prices settle up on China optimism as investors return from holiday - Reuters"
  ],
  [
    1735850479000,
    "China Arming Houthi Rebels in Yemen in Exchange For Unimpeded Red Sea Passage - Foundation for Defense of Democracies"
  ],
  [
    1735851605000,
    "India and China Should Admit Their Economies Are Intertwined - Bloomberg"
  ],
  [
    1735852140000,
    "Lockheed Stock Is Downgraded. It’s About China, the F-35, and Air Dominance. - Barron's"
  ],
  [
    1735852863000,
    "China targets dozens of U.S. companies ahead of anticipated Trump tariffs - CBS News"
  ],
  [
    1735854960000,
    "Apple Stock Falls On iPhone Discounts In China - Investor's Business Daily"
  ],
  [
    1735855208000,
    "What happened when mainland China recruited Taiwanese for governance - South China Morning Post"
  ],
  [
    1735857783000,
    "Trump’s Falsehoods Aside, China’s Influence Over Global Ports Raises Concerns - The New York Times"
  ],
  [
    1735862115000,
    "Tesla's China sales hit record high in 2024, bucking global decline - Reuters"
  ],
  [
    1735862481000,
    "China’s central bank plans policy overhaul as pressure mounts on economy - Financial Times"
  ],
  [
    1735862867000,
    "Apple's China troubles mount as foreign phone sales sink for 4th month - Reuters"
  ],
  [
    1735863433000,
    "China targets US defense companies with new sanctions - VOA Asia"
  ],
  [
    1735867380000,
    "China’s escalating cyber attacks highlight Biden, Trump differences - Defense One"
  ],
  [
    1735872172000,
    "Trouble in China's shopping paradise as Hainan duty-free spending falls 29% - Yahoo Finance"
  ],
  [
    1735874359000,
    "China Sends New Years' Message With Muscular Naval Drills - The Maritime Executive"
  ],
  [
    1735877394000,
    "Bracing for the US-China trade war to come - Asia Times"
  ],
  [
    1735878494000,
    "HMPV Outbreak In China: Symptoms, Spread And What You Should Know - NDTV"
  ],
  [
    1735878609000,
    "Chinese war games system sees surprise US attack on PLA in South China Sea - South China Morning Post"
  ],
  [
    1735879500000,
    "China to Subsidize Smartphone Purchases in Bid to Lift Spending - Bloomberg"
  ],
  [
    1735883340000,
    "China urges safety assessments after deadly year in commercial aviation - Reuters"
  ],
  [
    1735884000000,
    "China flexes lithium dominance with plans for tech-export curbs - MINING.com"
  ],
  [
    1735884348000,
    "What does China’s EV dominance mean for Europe and the environment? - Euronews"
  ],
  [
    1735885016000,
    "Why Apple is offering rare iPhone discounts in China - BBC.com"
  ],
  [
    1735887542000,
    "New Virus Outbreak In China: What Is HMPV? Know Symptoms, Prevention Tips And More - NDTV"
  ],
  [
    1735888740000,
    "China Adds to Sanctions of U.S. Defense Contractors Over Taiwan Arms Sales - The Wall Street Journal"
  ],
  [
    1735889220000,
    "China proposes fresh export curbs on EV technology - CNN"
  ],
  [
    1735890600000,
    "AI-hungry Middle East nations retreat from China to please U.S. - Nikkei Asia"
  ],
  [
    1735892760000,
    "F-35 maker’s stock downgraded after alleged China’s 6th-gen fighter debut: US media - Global Times"
  ],
  [
    1735894200000,
    "China may be pressured to hasten economic stimulus in 2025, analysts say - Nikkei Asia"
  ],
  [
    1735894506000,
    "Yuan’s Rally Versus Peers Suggests China’s Defense Can Backfire - Bloomberg"
  ]
]