[
  [
    1737360000000,
    "U.S. Relations With China - Department of State"
  ],
  [
    1738012818000,
    "Tech stocks fall as China's DeepSeek sparks U.S. worries about the AI race - NBC News"
  ],
  [
    1738062673000,
    "China’s DeepSeek and its Open-Source AI Models - China Briefing"
  ],
  [
    1738065963000,
    "Exclusive: Images show China building huge fusion research facility, analysts say - Reuters"
  ],
  [
    1738067870000,
    "DeepSeek: How China's 'AI heroes' overcame US curbs to stun Silicon Valley - BBC.com"
  ],
  [
    1738082046000,
    "Inside China, DeepSeek Provides a National Mic Drop Moment - The New York Times"
  ],
  [
    1738088051000,
    "UK will not be able to resist China's tech dominance - BBC.com"
  ],
  [
    1738094640000,
    "China built out record amount of wind and solar power in 2024 - The Associated Press"
  ],
  [
    1738101633000,
    "A big, beautiful Trump deal with China? - The Economist"
  ],
  [
    1738127580000,
    "After talking tough during campaign, Trump appears to ease up on China at start of presidency - The Associated Press"
  ],
  [
    1738137112000,
    "China’s DeepSeek faces questions over claims after shaking up global tech - Al Jazeera English"
  ],
  [
    1738158177000,
    "Commerce Nominee Defends Trump Tariffs and Promises Strong Stance on China - The New York Times"
  ],
  [
    1738159200000,
    "The Case for “Avalanche Decoupling” From China - Foreign Affairs Magazine"
  ],
  [
    1738166791000,
    "The world should take the prospect of Chinese tech dominance seriously, and start preparing now - Chatham House"
  ],
  [
    1738171909000,
    "As Trump's tariffs loom, analysts say China is better prepared than ever for a trade war with the U.S. - CBS News"
  ],
  [
    1738175537000,
    "OpenAI says Chinese rivals using its work for their AI apps - BBC.com"
  ],
  [
    1738182247000,
    "Why blocking China's DeepSeek from using US AI may be difficult - Reuters"
  ],
  [
    1738224000000,
    "China’s cheap, open AI model DeepSeek thrills scientists - Nature.com"
  ],
  [
    1738231225000,
    "DeepSeek, TikTok, RedNote: How Did China’s Internet Become So Cool? - Bloomberg"
  ],
  [
    1738233419000,
    "How China created AI model DeepSeek and shocked the world - Nature.com"
  ],
  [
    1738236540000,
    "Philippine president offers a deal to China: Stop sea aggression and I’ll return missiles to US - The Associated Press"
  ],
  [
    1738250233000,
    "Coming Together or Falling Apart Over China? - Center for European Policy Analysis"
  ],
  [
    1738251752000,
    "Is Cambodia slipping out of China’s orbit? - The Economist"
  ],
  [
    1738257553000,
    "Managing the Risks of China’s Access to U.S. Data and Control of Software and Connected Technology - Carnegie Endowment for International Peace"
  ],
  [
    1738263084000,
    "Moolenaar, Krishnamoorthi Call For Tightening Export Controls on Chips Critical to China's AI Platform DeepSeek and Other Measures to Address its Risks to Americans’ Data and Security - Select Committee on the CCP |"
  ],
  [
    1738278008000,
    "Why The China Bubble Still Hasn’t Popped - Bloomberg"
  ],
  [
    1738282920000,
    "Rubio warns of risk of China shutting down Panama Canal in any conflict - Reuters Canada"
  ],
  [
    1738283580000,
    "Cook points to 'fiscal stimulus' after Apple suffers steepest China sales decline in a year - CNBC"
  ],
  [
    1738307185000,
    "Trump support for denuclearization talks with Russia, China raises hopes - VOA Asia"
  ],
  [
    1738321652000,
    "China says Japan's plans for chip export controls could damage business relations - Reuters"
  ],
  [
    1738324359000,
    "China builds nuke-resistant bunker - Axios"
  ],
  [
    1738326594000,
    "China passes on US soybeans despite Brazilian delays - Reuters"
  ],
  [
    1738331700000,
    "DeepSeek’s Breakthrough Sparks National Pride in China - The Wall Street Journal"
  ],
  [
    1738334775000,
    "Rubio heads to Central America, pursuing ‘America First’ diplomacy, countering China - VOA Asia"
  ],
  [
    1738335600000,
    "What questions will China's DeepSeek not answer? - DW (English)"
  ],
  [
    1738335879000,
    "Trump Will Hit Mexico, Canada and China With Tariffs - The New York Times"
  ],
  [
    1738336932000,
    "Here's what Trump’s tariff threats look like on the ground in China - CNBC"
  ],
  [
    1738339844000,
    "Trump says he will impose tariffs on Mexico, Canada, China beginning Saturday - Scripps News"
  ],
  [
    1738340013000,
    "DeepSeek’s Answers Include Chinese Propaganda, Researchers Say - The New York Times"
  ],
  [
    1738348274000,
    "Trump tariffs on Canada, Mexico and China begin Saturday, White House says - CNBC"
  ],
  [
    1738348807000,
    "White House Says China, Mexico, Canada Tariffs to Hit Feb. 1 - Bloomberg"
  ],
  [
    1738349220000,
    "Trump to impose tariffs on imports from Canada, Mexico and China - The Guardian US"
  ],
  [
    1738349392000,
    "Reacting to DeepSeek, US Senate bill would separate US and China AI efforts - South China Morning Post"
  ],
  [
    1738350873000,
    "The global AI race: Is China catching up to the US? - Financial Times"
  ],
  [
    1738352340000,
    "Trump to enact tariffs on Canada, Mexico, China - VOA Asia"
  ],
  [
    1738353275000,
    "White House Says Trump Tariffs on Canada, Mexico and China Will Come Saturday - TIME"
  ]
]