[
  [
    1733533025000,
    "How China's cyberespionage has changed - Fox News"
  ],
  [
    1733533102000,
    "China-Russia cooperation poses rising threat in Arctic, Pentagon warns - Defense News"
  ],
  [
    1733535383000,
    "China business groups campaign against using US chips - Asia Times"
  ],
  [
    1733536825000,
    "China’s traffic barrier business is booming after deadly vehicle rammings - South China Morning Post"
  ],
  [
    1733539560000,
    "China's central bank resumes gold purchases after six-month hiatus in Nov - Reuters"
  ],
  [
    1733539680000,
    "China Resumes Buying Gold Reserves in Nov. After 6-Month Halt - Bloomberg"
  ],
  [
    1733541234000,
    "Tesla China highlights its milestones in some of world’s coldest regions - TESLARATI"
  ],
  [
    1733543933000,
    "China Resumed Gold Purchases Last Month After Prices Soared - Yahoo Finance"
  ],
  [
    1733544007000,
    "Backlash against ‘sexy’ China athletes a reflection of traditional values: experts - South China Morning Post"
  ],
  [
    1733545808000,
    "Opinion | China’s Middle East strategy falters as Aleppo falls to rebel forces - South China Morning Post"
  ],
  [
    1733545846000,
    "What Do the Latest Purges Mean for China’s Military? - The Diplomat"
  ],
  [
    1733547720000,
    "Inside a High-Stakes U.S.-China Prisoner Swap - The Wall Street Journal"
  ],
  [
    1733551209000,
    "Profile | Ex-China gymnast Wu Liufang gains 3.5 million fans after sexy dance ban lifted - South China Morning Post"
  ],
  [
    1733551308000,
    "Why China’s TikTok and EU are going head to head over Romanian election - South China Morning Post"
  ],
  [
    1733558400000,
    "GM’s China Writedown Won’t Be the End of Its Problems. - Barron's"
  ],
  [
    1733558410000,
    "Chinese economists’ social media on ice after critical comments fire up debate - South China Morning Post"
  ],
  [
    1733561385000,
    "In table tennis, Europe challenges China's dominance - DW (English)"
  ],
  [
    1733565720000,
    "China's special forces are untested. Success in a Taiwan invasion could depend on them. - Business Insider"
  ],
  [
    1733569209000,
    "‘Groundless’: China slams cyber spying accusations as West issues fresh warning - South China Morning Post"
  ],
  [
    1733572800000,
    "How the U.S. Can Maintain Its Military Edge Over China - TIME"
  ],
  [
    1733572808000,
    "African banks set up shop in China as Beijing pushes for yuan-based trade - South China Morning Post"
  ],
  [
    1733577511000,
    "German far-right leader is Chinese-speaking economist with foreign partner - Reuters"
  ],
  [
    1733580002000,
    "Climate patterns from cave mineral deposits linked to Chinese dynasty collapses - Phys.org"
  ],
  [
    1733580010000,
    "Chinese rocket scientists find ICBMs age much faster than they thought - South China Morning Post"
  ],
  [
    1733583652000,
    "China Deploys Fruit Flies in Space Station - Futurism"
  ],
  [
    1733587214000,
    "Lamborghini in 'best shape ever' despite hiccups in China and tariff threats, CEO says - Yahoo Finance"
  ],
  [
    1733593722000,
    "US alleges China hacked calls of 'very senior' political figures, official says - Reuters"
  ],
  [
    1733598914000,
    "Trump Taps Perdue for China, Signaling More Tension with Beijing - Benzinga"
  ],
  [
    1733605200000,
    "FBI Says Everyone Should Use Encryption Apps for Their Calls and Texts After China Hack: ‘Encryption Is Your Friend’ - PEOPLE"
  ],
  [
    1733605860000,
    "The US provided no evidence that China manipulates TikTok content inside the country, court says - Business Insider"
  ],
  [
    1733608808000,
    "The English impediment: why Chinese scientists can’t use Chinese - South China Morning Post"
  ],
  [
    1733614714000,
    "NSA Jake Sullivan says Russia, China, North Korea and Iran are all 'under pressure' - Fox News"
  ],
  [
    1733619614000,
    "Chinese exporters eye procurement to lift sales, offset Trump tariff impact - South China Morning Post"
  ],
  [
    1733619633000,
    "US House to vote to provide $3 billion to remove Chinese telecoms equipment - Reuters"
  ],
  [
    1733621408000,
    "Opinion | How China is quietly becoming the world’s climate champion - South China Morning Post"
  ],
  [
    1733622840000,
    "Taiwan reports near doubling of Chinese warships nearby - Reuters"
  ],
  [
    1733623225000,
    "China’s graft watchdog targets villages in national anti-corruption campaign - South China Morning Post"
  ],
  [
    1733623380000,
    "Singapore says no China request made to arrest alleged money launderer - Yahoo Singapore News"
  ],
  [
    1733626814000,
    "No Black Friday windfall for Chinese online shops selling overseas - South China Morning Post"
  ],
  [
    1733627220000,
    "Notre-Dame de Paris reopens with China's pioneering role in restoration - Global Times"
  ],
  [
    1733630410000,
    "China’s ‘explosive’ ironmaking breakthrough achieves 3,600-fold speed boost - South China Morning Post"
  ],
  [
    1733631660000,
    "Taiwan reports 14 Chinese warships and 4 balloons near the island - The Associated Press"
  ],
  [
    1733634015000,
    "Say YES: young Americans urged to ‘pioneer’ correct views of China - South China Morning Post"
  ],
  [
    1733634066000,
    "She Sued Over Transgender ‘Conversion Therapy,’ a First for China - The New York Times"
  ],
  [
    1733634071000,
    "TikTok-owner ByteDance takes lead in race to capitalise on AI in China - Financial Times"
  ],
  [
    1733634180000,
    "As Russia and China Rewrite Rules of War, NATO Adapts Its Game Plan - The Wall Street Journal"
  ],
  [
    1733637360000,
    "What is high bandwidth memory and why is the US trying to block China’s access to it? - CNN"
  ],
  [
    1733637610000,
    "‘Should I wear a down jacket?’ Ex China national athlete counters criticism over skimpy swimsuit - South China Morning Post"
  ],
  [
    1733637619000,
    "Why alarm bells are ringing for China-based ‘smartphone king of Africa’ - South China Morning Post"
  ],
  [
    1733638257000,
    "China’s Communist Comic Books - History Today"
  ],
  [
    1733639761000,
    "The green revolution, ‘made in China’: The two sides of Europe’s ecological transition - EL PAÍS USA"
  ],
  [
    1733639962000,
    "What do Chinese people think about Germany? - DW (English)"
  ],
  [
    1733641200000,
    "China’s Stock Market Upswing Is Still Going. Mom and Pop Investors Have Taken Notice. - Barron's"
  ],
  [
    1733644809000,
    "Chinese scientists shed light on how animals ‘run away’ from deadly viruses - South China Morning Post"
  ],
  [
    1733648700000,
    "Chinese data centers told to stick to Nvidia chips, domestic chips not compatible - TechRadar"
  ],
  [
    1733650041000,
    "9 killed in fire at cold storage facility in eastern China - South China Morning Post"
  ],
  [
    1733651032000,
    "As Assad regime falls, China urges Syria to ensure safety of Chinese nationals - South China Morning Post"
  ],
  [
    1733652000000,
    "'Modern Silk Road' brings booming trade to China-Kazakhstan border - Nikkei Asia"
  ],
  [
    1733652137000,
    "Commerce Dept. Is on the Front Lines of China Policy - The New York Times"
  ],
  [
    1733653740000,
    "Tomb of Chinese emperor Liu He gives up Han dynasty battle secrets - South China Morning Post"
  ],
  [
    1733654400000,
    "China To Counter “Trump Tariffs” By Preferring “Made-In-China” Goods For Official Use, Combating The Influence Of US Products - Wccftech"
  ],
  [
    1733655600000,
    "US–China relationship’s fragile stability shows fractures in 2024 - East Asia Forum"
  ],
  [
    1733659209000,
    "Chinese students in US advised to return to campus before Trump takes office - South China Morning Post"
  ],
  [
    1733659720000,
    "Electric car stock plays for 2025 as GM, Tesla struggle in China - CNBC"
  ],
  [
    1733662433000,
    "China’s Regulators Seek Improvements to Property Market: Xinhua - Bloomberg"
  ],
  [
    1733662808000,
    "Countdown to NEO brain-computer interface clinical trial in China - South China Morning Post"
  ],
  [
    1733663556000,
    "Russia’s Pipe-Gas Flows to China at New Daily Record - Bloomberg"
  ],
  [
    1733666406000,
    "What’s good for China has been very bad for General Motors | Analysis - The Seattle Times"
  ],
  [
    1733666410000,
    "Top mathematician says Chinese scientists have no choice but to leave US - South China Morning Post"
  ],
  [
    1733668027000,
    "BIOSECURE Act, aimed at Chinese drug manufacturers, is dealt a major blow - STAT"
  ],
  [
    1733671921000,
    "PACAF Boss: As China Expands Reach of Missiles and Warplanes, US Needs ‘Inside Force’ - Air & Space Forces Magazine"
  ],
  [
    1733673600000,
    "China warships near Taiwan nearly doubles - 台北時報"
  ],
  [
    1733674752000,
    "From Apple to Starbucks, Western firms’ China dreams are dying - The Economist"
  ],
  [
    1733684067000,
    "Will China Take Over the Global Auto Industry? - Council on Foreign Relations"
  ],
  [
    1733684647000,
    "How Russia, Iran, China and Israel Responded to Assad's Ouster in Syria - Newsweek"
  ],
  [
    1733691600000,
    "Why GM’s $5 billion China gamble may not pay off - Autoblog"
  ],
  [
    1733691793000,
    "U.S. Space Force official warns of rising Chinese threats - SpaceNews"
  ],
  [
    1733694090000,
    "‘Multi-headed monster’: Biden, Trump officials address China-Russia-Iran coordination - Defense One"
  ],
  [
    1733694502000,
    "Morning Bid: China inflation, global political uncertainty bubbling up - Reuters"
  ],
  [
    1733700615000,
    "Gold Advances as China’s Central Bank Resumes Buying After Pause - Yahoo Finance"
  ],
  [
    1733701871000,
    "Trump asks China to help bring Ukraine peace, says he ‘had communication’ with Xi recently - South China Morning Post"
  ],
  [
    1733702412000,
    "China preps policy support for economic conference held under Trump’s shadow - South China Morning Post"
  ],
  [
    1733703896000,
    "China's inflation weakens as new risks cloud horizon - Reuters"
  ],
  [
    1733703900000,
    "Ukraine war briefing: Trump urges China to help end Ukraine war - The Guardian"
  ],
  [
    1733705100000,
    "China launches AI that writes politically correct docs for bureaucrats - The Register"
  ],
  [
    1733707916000,
    "China’s Solar Industry Looks to OPEC for Guide to Survival - Yahoo Finance"
  ],
  [
    1733708063000,
    "Deflationary pressure persists as China’s consumer inflation hits 5-month low - South China Morning Post"
  ],
  [
    1733708460000,
    "China consumer inflation rate drops to a five-month low, missing expectations as economy slows - CNBC"
  ],
  [
    1733709622000,
    "First salvo of a Russia-China trade war - Asia Times"
  ],
  [
    1733710128000,
    "China’s Belt And Road Initiative Aims For Long-Term Global Leadership - Forbes"
  ],
  [
    1733710560000,
    "Oil prices rise as China moves toward monetary easing to boost growth - CNBC"
  ],
  [
    1733716440000,
    "China's Nov exports likely grew 8.5% as factories shift stocks overseas: Reuters poll - Reuters.com"
  ],
  [
    1733721960000,
    "China’s Consumer Inflation Slows Even After Stimulus Efforts - Bloomberg"
  ],
  [
    1733723040000,
    "China Box Office: ‘Her Story’ Stays on Top as ‘Moana 2’ Drops to Third Place - Variety"
  ],
  [
    1733723246000,
    "China's top leaders are set to discuss GDP growth target, stimulus measures amid economic worries - CNBC"
  ],
  [
    1733726711000,
    "Why is Canada scrambling to counter Russia, China in the Arctic? - Al Jazeera English"
  ],
  [
    1733729100000,
    "China's CSI300 rises amid broader gains in Asia markets as Beijing's stimulus pledge boosts sentiment - CNBC"
  ],
  [
    1733729786000,
    "China starts military movements after Taiwan leader’s first foreign trip - Financial Times"
  ],
  [
    1733729820000,
    "Taiwan on Alert as China Restricts Airspace in Potential Drills - Bloomberg"
  ],
  [
    1733730420000,
    "China calls for 'political solution' to restore stability in Syria - Reuters"
  ],
  [
    1733730822000,
    "China vows 'more proactive' fiscal stimulus measures, 'moderately' looser monetary policy - CNBC"
  ],
  [
    1733731148000,
    "Taiwan's military on high alert as Chinese warships spotted near island - FRANCE 24 English"
  ],
  [
    1733731200000,
    "Why did China hack the world’s phone networks? - The Guardian"
  ],
  [
    1733731211000,
    "How a Criminal With Close Ties to China Became a New York Power Broker - The New York Times"
  ],
  [
    1733732135000,
    "China's Nov car sales rise fastest since January, subsidised trade-ins gain steam - Reuters"
  ],
  [
    1733732188000,
    "Exclusive: China regulators tell banks to expedite offshore company listings, sources say - Reuters"
  ],
  [
    1733733320000,
    "62 Years After the ’62 War, Where Do China and India Go From Here? - War On The Rocks"
  ],
  [
    1733733720000,
    "Hong Kong stocks jump nearly 3% as China pledges 'more proactive' stimulus measures - CNBC"
  ],
  [
    1733733840000,
    "China's Politburo calls for 'proactive' fiscal policy in 2025 - Nikkei Asia"
  ],
  [
    1733734080000,
    "China’s Politburo mentioned these two words for the first time in more than a decade. Stocks soared. - MarketWatch"
  ],
  [
    1733735125000,
    "China Politburo policy shift spurs surge in stocks, bonds - Reuters"
  ],
  [
    1733735174000,
    "China loosens monetary policy stance for first time in 14 years - Financial Times"
  ],
  [
    1733736150000,
    "Taiwan raises alert to ‘high’ amid presence of Chinese warships - Al Jazeera English"
  ],
  [
    1733736655000,
    "Chinese Stocks, Yuan Stage Late Rebound on Politburo Pledges - Bloomberg"
  ],
  [
    1733738036000,
    "China vows to ramp up policy stimulus to spur growth in 2025 - Reuters"
  ],
  [
    1733738423000,
    "Land Of The Rising Sun ‘Rising Again’! Japan Challenges China In 6th-Gen Military Race With ‘New Age’ Tech - EurAsian Times"
  ],
  [
    1733738455000,
    "Chinese Carmakers Are Taking Mexico by Storm While Eyeing U.S. - The New York Times"
  ],
  [
    1733739956000,
    "China’s Politburo revives crisis-era language in pledge to bolster economy - South China Morning Post"
  ],
  [
    1733740500000,
    "Chinese leaders pledge 'moderately loose' monetary policy, more support for slowing economy - The Associated Press"
  ],
  [
    1733740560000,
    "China Adopts Crisis-Era Language as Leaders Signal More Forceful Stimulus - The Wall Street Journal"
  ],
  [
    1733741340000,
    "Taiwan says China has sent naval ships into nearby waters ahead of anticipated drills - The Associated Press"
  ],
  [
    1733742019000,
    "China, Philippines put tensions aside to work together on gambling crackdown - South China Morning Post"
  ],
  [
    1733742584000,
    "Morning Bid: Fed cut gets baked in, China shifts monetary stance - Yahoo Finance"
  ],
  [
    1733743152000,
    "Gold extends gains on geopolitical tensions and China buying - FXStreet"
  ],
  [
    1733744068000,
    "China Signals Bolder Stimulus for Next Year as Trump Returns - Bloomberg"
  ],
  [
    1733744806000,
    "Nvidia Hit With China Probe in Global Tech War Escalation - Bloomberg"
  ],
  [
    1733745824000,
    "China launches antitrust probe into US chip giant Nvidia in tech war escalation - South China Morning Post"
  ],
  [
    1733745922000,
    "Nvidia shares fall after China opens investigation over possible violation of antimonopoly law - CNBC"
  ],
  [
    1733746029000,
    "Map shows China's suspected spy bases on US doorstep - Newsweek"
  ],
  [
    1733747820000,
    "China begins military movements around Taiwan as the island braces for potential drills - CNN"
  ],
  [
    1733749381000,
    "China Opens Investigation Into Nvidia Over Potential Antitrust Violations - The New York Times"
  ],
  [
    1733749440000,
    "Nvidia reportedly facing China antitrust probe. Why that matters for the stock. - MarketWatch"
  ],
  [
    1733750325000,
    "China is probing Nvidia in a major escalation of its chip war with the US - CNN"
  ],
  [
    1733752800000,
    "Why Big Amazon China Sellers Are Branching Out - The Information"
  ],
  [
    1733754242000,
    "China's Xiaomi to launch new SUV next summer amid rising demands - Reuters"
  ],
  [
    1733754493000,
    "China 2025: What To Watch - Asia Society"
  ],
  [
    1733756097000,
    "Nvidia Shares Slide After China Starts Antitrust Probe - Forbes"
  ],
  [
    1733757272000,
    "Aboard Japan-based carrier with stealth fighter jets, Austin spotlights China as top threat - DefenseScoop"
  ],
  [
    1733760116000,
    "China's BYD to focus on plug-in hybrid cars in European expansion - Reuters"
  ],
  [
    1733761057000,
    "China’s Critical Minerals Embargo Is Even Tougher Than Expected - The New York Times"
  ],
  [
    1733761750000,
    "Nvidia is facing an antitrust investigation in China - Axios"
  ],
  [
    1733761785000,
    "China Is Cutting Off Drone Supplies Critical to Ukraine War Effort - Bloomberg"
  ],
  [
    1733763566000,
    "China launches antitrust probe into Nvidia - Financial Times"
  ],
  [
    1733764548000,
    "European shares close at six-week high on expected China stimulus - Reuters"
  ],
  [
    1733765950000,
    "MAGA with Chinese characteristics - The Economist"
  ],
  [
    1733767301000,
    "Russia Hits China With Trade Tariffs - Newsweek"
  ],
  [
    1733767440000,
    "Nvidia Stock Drops. Why China Is Probing the AI Chip Maker. - Barron's"
  ],
  [
    1733768940000,
    "Nvidia Probed in China Over Possible Antimonopoly Violations - The Wall Street Journal"
  ],
  [
    1733769840000,
    "Nvidia Offers Glimpse of What’s Ahead in U.S.-China Trade War - Barron's"
  ],
  [
    1733770147000,
    "Gold hits 2-week high on China buying, Fed rate cut expectations - Reuters"
  ],
  [
    1733770292000,
    "China opens probe into Nvidia, accusing company of violating its anti-monopoly law - NBC News"
  ],
  [
    1733771640000,
    "Alibaba, Nio Stock Jump. What China's Latest Stimulus News Is All About. - Barron's"
  ],
  [
    1733772135000,
    "Taiwan raises alert as China deploys 90 ships in likely exercises - Reuters"
  ],
  [
    1733773102000,
    "China Curbing Drone Part Sales to Ukraine, US as Export Restrictions Loom - PCMag"
  ],
  [
    1733774142000,
    "China's big monetary policy shift spurred a stock surge. But 'a lot of volatility' still looms. - Yahoo Finance"
  ],
  [
    1733775360000,
    "Expanding U.S. Naval Repair Overseas, New Icebreaker Fleet Key to Competing with China, Says Panel - USNI News"
  ],
  [
    1733776440000,
    "Alibaba Stock Jumps, Trip.com Breaks Out On Latest China Stimulus Pledge - Investor's Business Daily"
  ],
  [
    1733776601000,
    "Oil Advances as China Signals Bolder Stimulus for Next Year - Yahoo Finance"
  ],
  [
    1733778531000,
    "China's plans for large new London embassy rejected by local officials - Reuters"
  ],
  [
    1733778810000,
    "Nvidia stock slides as China opens antitrust probe against AI chip heavyweight - Yahoo Finance"
  ],
  [
    1733779104000,
    "Gold Rises as China Resumes Buying and Syria Boosts Haven Demand - Yahoo Finance"
  ],
  [
    1733779457000,
    "2 reasons China stocks are popping on economic policy shift news - Yahoo Finance"
  ],
  [
    1733780259000,
    "China-US Trade Conflict Escalates With Drone Part Curbs, Nvidia Probe - Bloomberg"
  ],
  [
    1733782020000,
    "Nvidia Stock Falls As China Opens Anti-Monopoly Probe - Investor's Business Daily"
  ],
  [
    1733784077000,
    "Nvidia targeted by China in new chip war probe - BBC.com"
  ],
  [
    1733785273000,
    "US agencies to brief House on Chinese Salt Typhoon telecom hacking - Reuters"
  ],
  [
    1733786785000,
    "China Escalates US Trade Tensions on Two New Fronts - Bloomberg"
  ],
  [
    1733787051000,
    "Beware of China’s Political Grandstanding on Stimulus - Bloomberg"
  ],
  [
    1733789267000,
    "A wonky memento and a China metaphor - The Interpreter"
  ],
  [
    1733792400000,
    "Nvidia’s China Risk - The Information"
  ],
  [
    1733794860000,
    "In China, people are hiring ‘climbing buddies’ for big money. The more attractive they are, the higher the price - CNN"
  ],
  [
    1733796000000,
    "In China’s Rapidly Aging Cities, Young People Flee and Few Babies Are Born - The Wall Street Journal"
  ],
  [
    1733796253000,
    "'Self-evolving' virtual hospital concept in China to go public in 2025 - Healthcare IT News"
  ],
  [
    1733801160000,
    "China's November imports post surprise drop; sharpest decline in 14 months - CNBC"
  ],
  [
    1733801400000,
    "Flying over Russia: Chinese airlines win and Europeans lose - POLITICO Europe"
  ],
  [
    1733802900000,
    "Nvidia's stock dips after China opens probe of the AI chip company for violating anti-monopoly laws - The Associated Press"
  ],
  [
    1733804880000,
    "China EV insurance registrations for week ending Dec 8: Nio 3,700, Tesla 21,900, Xiaomi 5,400, BYD 85,000 - CnEVPost"
  ],
  [
    1733805900000,
    "China's Nov crude oil imports rebound on lower prices, stockpiling - Reuters"
  ],
  [
    1733807100000,
    "China sends largest naval fleet in decades to region, threat level severe, Taiwan says - Reuters"
  ],
  [
    1733807220000,
    "China targets Nvidia with antitrust probe, escalates US chip tensions - Reuters"
  ],
  [
    1733809080000,
    "China has full confidence in achieving this year's growth target, says Xi - Reuters"
  ],
  [
    1733810040000,
    "China Economists Ramp Up Expectations for Rate Cuts, Spending - Bloomberg"
  ],
  [
    1733810589000,
    "Taiwan says China is carrying out some of its biggest-ever maritime military exercises - FRANCE 24 English"
  ],
  [
    1733812020000,
    "China’s exports slow, imports decline in November, falling below forecasts - The Associated Press"
  ],
  [
    1733814180000,
    "China cosmetics firm Mao Geping shares rise 85% in Hong Kong debut - Reuters"
  ],
  [
    1733814600000,
    "Assad's fall in Syria exposes limits of China's Middle East diplomacy - Reuters"
  ],
  [
    1733815200000,
    "China's exports slow sharply, imports shrink ahead of Trump tariffs - Reuters"
  ],
  [
    1733816462000,
    "China curbs sale of drone parts to US, Europe, hindering Ukraine’s war effort, Bloomberg reports - Kyiv Independent"
  ],
  [
    1733818230000,
    "China's exports to Russia drop for first time in four months - Reuters"
  ],
  [
    1733819899000,
    "Ambassador Burns Statement for Human Rights Day 2024 - US Embassy & Consulates in China"
  ],
  [
    1733820014000,
    "China’s Oil Demand May Peak Early on Rapid Transport Shift - Bloomberg"
  ],
  [
    1733820060000,
    "China’s maritime movements around Taiwan are largest in decades, Taipei says - CNN"
  ],
  [
    1733821113000,
    "Xi Jinping says China will remain world’s ‘growth engine’ - Financial Times"
  ],
  [
    1733823000000,
    "Nvidia faces US$1 billion fine if China probe finds violation of antitrust laws, experts say - Yahoo Finance"
  ],
  [
    1733824838000,
    "Trump is threatening to raise tariffs again. Here’s how China plans to fight back - Los Angeles Times"
  ],
  [
    1733827740000,
    "China Stages Largest Show of Force in Decades After U.S. Visit by Taiwan’s Lai - The Wall Street Journal"
  ],
  [
    1733831998000,
    "Breakingviews - China’s wealth pledge will face tough sceptics - Reuters"
  ],
  [
    1733835633000,
    "Idaho Antimony Mine Soon Goes Live Amid Rising U.S.-China Trade War - Forbes"
  ],
  [
    1733841720000,
    "‘No winners’: China’s Xi warns US against a trade war - CNN"
  ],
  [
    1733842151000,
    "Taiwan's Defense Ministry says a large Chinese military force has been detected nearby - NPR"
  ],
  [
    1733842493000,
    "Taiwan Says China Has Deployed Largest Fleet of Ships in Decades - The New York Times"
  ],
  [
    1733843034000,
    "U.S. imposes trade restrictions on two Chinese firms over human rights - Reuters"
  ],
  [
    1733843340000,
    "Chinese gold mining threatens a protected UN heritage site in Congo - The Associated Press"
  ],
  [
    1733845497000,
    "Stellantis, China's CATL to invest $4.33 bln in EV battery factory in Spain - Reuters"
  ],
  [
    1733846175000,
    "Q&A: What could a US-China trade war mean for the energy transition? - Carbon Brief"
  ],
  [
    1733846400000,
    "The Turning Point? U.S.-China Relations, Economic Growth, and the Race for Technology Leadership - Center for Strategic & International Studies"
  ],
  [
    1733848470000,
    "Taiwan says China has launched biggest maritime operation in decades - VOA Asia"
  ],
  [
    1733852017000,
    "Lessons from China’s crackdown on Hong Kong - The Economist"
  ],
  [
    1733854505000,
    "US sanctions Chinese firm over potentially deadly ransomware attack - Reuters"
  ],
  [
    1733854792000,
    "China Needs a New Approach in Syria - Foreign Policy"
  ],
  [
    1733857888000,
    "China reveals its playbook for dealing with impending Trump trade war - The Washington Post"
  ],
  [
    1733861936000,
    "China’s Export Restrictions on Drone Parts Could Reshape Global Supply Chains - DroneLife"
  ],
  [
    1733863120000,
    "Oil prices rise on China stimulus, possible tight supply in Europe - Reuters"
  ],
  [
    1733863392000,
    "Chinese arms flow into the US and other countries despite manufacturers’ alleged role in Xinjiang repression - ICIJ.org"
  ],
  [
    1733865608000,
    "Russian security official Medvedev arrives in China, Russian agencies report - Reuters"
  ],
  [
    1733867341000,
    "Morning Bid: Taking chips off the table, seeking China clarity - Reuters"
  ],
  [
    1733867460000,
    "China reports two more H9N2 avian flu cases - University of Minnesota Twin Cities"
  ],
  [
    1733867460000,
    "China reports two more H9N2 avian flu cases - cidrap.umn.edu"
  ],
  [
    1733868001000,
    "China Begins Annual Economic Meeting to Hash Out Stimulus Plan - Bloomberg"
  ],
  [
    1733868256000,
    "China edges closer to intervention in Myanmar - The Strategist"
  ],
  [
    1733868900000,
    "China’s sci-fi spherical Death Star-like robot cop uses AI, facial recognition to track criminals - Fox News"
  ],
  [
    1733871599000,
    "China ready to go deeper into debt to counter Trump's tariffs - Reuters"
  ],
  [
    1733872298000,
    "China ramps up Wall Street meetings as Trump inauguration looms - CNBC"
  ],
  [
    1733875170000,
    "U.S. and Japan forge stronger space alliance to counter China - SpaceNews"
  ],
  [
    1733877600000,
    "Chinese naval deployments in line with other large drills, US official says - Reuters"
  ],
  [
    1733878560000,
    "Chinese security companies are putting boots on the ground in Myanmar. It could go disastrously wrong - The Conversation"
  ],
  [
    1733880600000,
    "It’s not just TikTok. You probably use lots of Chinese technology. - The Washington Post"
  ],
  [
    1733884200000,
    "How the U.S. plans to fortify Guam against China’s missile threat - Reuters"
  ],
  [
    1733887513000,
    "Taiwan says 'troublemaker' China ramps up military exercises around the island - FRANCE 24 English"
  ],
  [
    1733888760000,
    "Tesla sells 21,900 EVs in China in first week of Dec, the highest in Q4 - Reuters"
  ],
  [
    1733891400000,
    "Asia-Pacific markets close mixed as investors await key policy meeting in China - CNBC"
  ],
  [
    1733897350000,
    "China's monetary shift signals economic worries, but 'bazooka-style' stimulus is unlikely, experts say - CNBC"
  ],
  [
    1733898101000,
    "How ‘Her Story,’ a Feminist Comedy, Came to Rule China’s Box Office - The New York Times"
  ],
  [
    1733898747000,
    "China says it takes 'necessary measures' to defend sovereignty over Taiwan - Reuters"
  ],
  [
    1733902448000,
    "Taiwan blames ‘troublemaker’ China for huge naval drills near shores - Al Jazeera English"
  ],
  [
    1733902800000,
    "Nissan moves CFO Stephen Ma to head China in management reshuffle - Reuters"
  ],
  [
    1733903760000,
    "Canada sanctions 8 Chinese officials, citing human rights violations - Reuters"
  ],
  [
    1733905020000,
    "China's largest maritime deployment in decades 'pressure tests' Taiwan - Nikkei Asia"
  ],
  [
    1733905876000,
    "How a Chinese firm ran a billion-euro carbon credit scam - DW (English)"
  ],
  [
    1733906125000,
    "Archipelago of Resistance: The Philippines Is Rising to Meet the China Threat, But It Has a Crucial Year Ahead - War On The Rocks"
  ],
  [
    1733906612000,
    "China Markets Flag Caution, Reduced Hope for Key Policy Meeting - Yahoo Finance"
  ],
  [
    1733908999000,
    "China mobilizes ‘staggering’ naval presence in Taiwan Strait: Taipei - Radio Free Asia"
  ],
  [
    1733910621000,
    "Al-Assad’s fall in Syria: What’s at stake for China? - Al Jazeera English"
  ],
  [
    1733911247000,
    "Joe Biden to hit Chinese cleantech imports with more tariffs - Financial Times"
  ],
  [
    1733911393000,
    "Biden Administration Looks to Reinforce U.S.-China Ties Ahead of Trump’s Return - The New York Times"
  ],
  [
    1733912375000,
    "Yuan Slides on Report China Considering Weaker Currency in 2025 - Bloomberg"
  ],
  [
    1733912986000,
    "China Watchdog Orders Temu-Owner PDD to Fix Refunds Policy - Bloomberg"
  ],
  [
    1733914999000,
    "Morning Bid: China's yuan plans and a look at inflation - Reuters"
  ],
  [
    1733915276000,
    "Taiwan Demands that China End Its Military Activity in Nearby Waters - Military.com"
  ],
  [
    1733915715000,
    "Likely China-based Attackers Target High-profile Organizations in Southeast Asia - Symantec Enterprise Blogs"
  ],
  [
    1733919846000,
    "Trump’s Return Gives China a Shot at Being the Next Weather Superpower - Bloomberg"
  ],
  [
    1733919876000,
    "Chinese Suspect Arrested for Flying Drone Over US Military Base - Newsweek"
  ],
  [
    1733919921000,
    "Hyundai, BAIC to invest $1.1 billion in China joint venture - Reuters"
  ],
  [
    1733920818000,
    "China’s Biggest ‘Belt and Road’ Still Leads to US and Friends - Bloomberg"
  ],
  [
    1733921580000,
    "Biden approves national security memo on China, Iran, North Korea and Russia ahead of Trump's return - The Associated Press"
  ],
  [
    1733922597000,
    "Powerful blast rocks residential high-rise in southern China, kills one person - Reuters"
  ],
  [
    1733923372000,
    "Satellite Photos Show China's Warships in Naval Standoff - Newsweek"
  ],
  [
    1733925052000,
    "Exclusive: Chinese authorities are considering a weaker yuan as Trump trade risks loom - Reuters"
  ],
  [
    1733929120000,
    "Ahead of Trump’s return, Biden approves national security memo on China, Iran, North Korea and Russia - PBS NewsHour"
  ],
  [
    1733929200000,
    "China’s ‘dreamy’ new ship aims for Earth’s mantle—and assumes ocean-drilling leadership - Science"
  ],
  [
    1733933811000,
    "China's otherworldly mountains that inspired Avatar - BBC.com"
  ],
  [
    1733934846000,
    "US-China Economy Talks Resume as Yellen Urges Maintaining Links - Bloomberg"
  ],
  [
    1733935274000,
    "China Hosts Nuclear Weapons Talks Amid Saber-Rattling in Europe - Newsweek"
  ],
  [
    1733936402000,
    "Biden unveils fresh China tariff hikes - Supply Chain Dive"
  ],
  [
    1733936696000,
    "Biden pushes new Russia, Iran, Korea, China effort before Trump term - Reuters"
  ],
  [
    1733936947000,
    "‘China Beyond Borders’ documentary explores Beijing’s transnational repression - Radio Free Asia"
  ],
  [
    1733939155000,
    "Nvidia is the latest chess piece in the US-China tech war - Yahoo Finance"
  ],
  [
    1733941980000,
    "Nvidia Stock Rises. 3 Reasons to Look Past China's Antitrust Probe. - Barron's"
  ],
  [
    1733942220000,
    "China gorging on silicon before Uncle Sam slams the door - The Register"
  ],
  [
    1733944860000,
    "Chinese Surge 53 Military Aircraft, 19 Ships Near Taiwan, Officials Say - USNI News"
  ],
  [
    1733947980000,
    "Republicans looking for new ways to force through China crackdowns left out of yearly defense bill - Fox News"
  ],
  [
    1733950323000,
    "Dollar higher after CPI; China considers letting yuan weaken - Reuters"
  ],
  [
    1733954319000,
    "Morning Bid: China FX eyed, markets surge on Fed hopes - Reuters"
  ],
  [
    1733954712000,
    "Chinese Citizen Arrested After Allegedly Flying Drone, Taking Photos of Space Force Base - Military.com"
  ],
  [
    1733956223000,
    "US monitoring Taiwan Strait while China mobilizes warships, balloons nearby - DefenseScoop"
  ],
  [
    1733957999000,
    "Weaker Chinese yuan talk raises spectre of FX race to the bottom - Reuters"
  ],
  [
    1733958311000,
    "Trump Extended Xi Longshot Invitation to Inauguration, CBS Says - Bloomberg"
  ],
  [
    1733959791000,
    "Trump invites China’s Xi Jinping to attend his inauguration, US report says - South China Morning Post"
  ],
  [
    1733961171000,
    "China's Nio, behind on growth targets, aims to tighten cost control - Reuters"
  ],
  [
    1733961418000,
    "Donald Trump Invited China's Xi to Presidential Inauguration: Report - Newsweek"
  ],
  [
    1733962620000,
    "Trump invites China's Xi Jinping to inauguration - CBS News"
  ],
  [
    1733968908000,
    "China Is Moving ‘All Over’ Space, and USSF Leaders Want to Maneuver Too - Air & Space Forces Magazine"
  ],
  [
    1733969100000,
    "China is considering softer currency - Reuters.com"
  ],
  [
    1733973673000,
    "China prepared to keep talking to US, Xi assures Washington business group - South China Morning Post"
  ],
  [
    1733974560000,
    "China’s Weak Winter LNG Demand Provides Relief for Rival Buyers - Bloomberg"
  ],
  [
    1733976012000,
    "China urged to anchor yuan to non-US dollar currencies to empower domestic tools - South China Morning Post"
  ],
  [
    1733976360000,
    "Nvidia Steps Up Hiring in China to Focus on AI-Driven Cars - Bloomberg"
  ],
  [
    1733978220000,
    "China's customs chief and trade veteran dies of sudden illness - Reuters"
  ],
  [
    1733979360000,
    "China to expand private pension scheme nationwide from Dec 15 - Reuters"
  ],
  [
    1733979600000,
    "What China Must Do to Stop the Flow of Fentanyl - Foreign Affairs Magazine"
  ],
  [
    1733979609000,
    "Planning a Chinese family’s multigenerational holiday to Hokkaido, Japan - Post Magazine"
  ],
  [
    1733979660000,
    "No Limits? The China-Russia Relationship and U.S. Foreign Policy - Council on Foreign Relations"
  ],
  [
    1733979663000,
    "Philippines considers new UN case against Beijing over South China Sea activity - Financial Times"
  ],
  [
    1733979900000,
    "China Comes Out Swinging as Trump Trade War Looms - The Wall Street Journal"
  ],
  [
    1733982303000,
    "Xi Jinping calls for wider use of Mandarin in China’s border areas - Radio Free Asia"
  ],
  [
    1733983414000,
    "Will Chinese president attend US inauguration at Trump’s invitation? - South China Morning Post"
  ],
  [
    1733988417000,
    "China open to talks with Trump's economic, trade team, commerce ministry says - Reuters.com"
  ],
  [
    1733992359000,
    "Australia-PNG rugby deal signed to curb China influence - BBC.com"
  ],
  [
    1733995800000,
    "China must innovate in semiconductor design or fall behind the global market, expert says - Yahoo Finance"
  ],
  [
    1733997600000,
    "What has China House done? - POLITICO Europe"
  ],
  [
    1733998153000,
    "China’s Instagram-Style Xiaohongshu Crosses $1 Billion in Profit - Yahoo Finance"
  ],
  [
    1733998183000,
    "Police in China take hi-tech rolling robot out on patrol - South China Morning Post"
  ],
  [
    1733999400000,
    "US hikes tariffs on imports of Chinese solar wafers, polysilicon and tungsten products - The Associated Press"
  ],
  [
    1734001200000,
    "China banned exports of a few rare minerals to the US. Things could get messier. - MIT Technology Review"
  ],
  [
    1734001210000,
    "How China Hacked America’s Phone Network - The New York Times"
  ],
  [
    1734001748000,
    "What a censored speech says about China’s economy - The Economist"
  ],
  [
    1734002111000,
    "China makes space for private sector, vows spending to boost demand - South China Morning Post"
  ],
  [
    1734002138000,
    "Nvidia denies rumours it will cut supplies to China - Reuters.com"
  ],
  [
    1734002251000,
    "China Vows Bigger Fiscal Spending to Boost Consumption Next Year - Bloomberg"
  ],
  [
    1734003124000,
    "China stresses plans to boost growth at top agenda-setting meeting - CNBC"
  ],
  [
    1734004854000,
    "Saudi crude oil supply to China to rebound in Jan vs Dec, sources say - Reuters"
  ],
  [
    1734006572000,
    "Cratering Effects: Chinese Missile Threats to US Air Bases in the Indo-Pacific - Stimson Center"
  ],
  [
    1734006780000,
    "China ends planning meeting with vows to stabilize its economy, but gives no details on stimulus - The Associated Press"
  ],
  [
    1734007688000,
    "China Pledges More Stimulus to Shore Up Flagging Economy - The New York Times"
  ],
  [
    1734008945000,
    "Taiwan closes emergency response centre, likely meaning Chinese drills over - Reuters"
  ],
  [
    1734010380000,
    "China holds Central Economic Work Conference to make plans for 2025 - The State Council of the People's Republic of China"
  ],
  [
    1734010761000,
    "Why China is losing interest in English - The Economist"
  ],
  [
    1734010761000,
    "Chinese hackers are deep inside America’s telecoms networks - The Economist"
  ],
  [
    1734010761000,
    "China cracks down on Karate-chopping cleaning ladies - The Economist"
  ],
  [
    1734013286000,
    "Explainer: How China’s renewables rollout boosts its ‘war on sand’ - Carbon Brief"
  ],
  [
    1734016079000,
    "China pledges more debt, rate cuts as Trump tariff threats loom - Reuters"
  ],
  [
    1734016740000,
    "China pledges more borrowing and interest rate cuts to counter Trump’s tariff threats - CNN"
  ],
  [
    1734017101000,
    "China Market Update: Central Economic Work Conference (CEWC) Release Highlights Domestic Consumption Revival: Deep Dive - Forbes"
  ],
  [
    1734019040000,
    "Trump invites China’s Xi to his presidential inauguration, even as he threatens Beijing with tariffs - PBS NewsHour"
  ],
  [
    1734019506000,
    "Trump’s inauguration invites include China’s Xi Jinping - POLITICO"
  ],
  [
    1734020466000,
    "Trump invites China's Xi to inauguration, experts call it political theater - Reuters"
  ],
  [
    1734021063000,
    "Where the China-Russia Partnership Is Headed in Seven Charts and Maps - Council on Foreign Relations"
  ],
  [
    1734021600000,
    "Salt Typhoon attacks prompt talk of hacking back against China - Nextgov/FCW"
  ],
  [
    1734022402000,
    "China-Taiwan Weekly Update, December 12, 2024 - Institute for the Study of War"
  ],
  [
    1734022800000,
    "Prince Andrew invited ‘Chinese spy’ into Buckingham Palace - The Times"
  ],
  [
    1734022809000,
    "How U.S. Firms Battled a Government Crackdown to Keep Tech Sales to China - The New York Times"
  ],
  [
    1734025020000,
    "China denies new report linking CCP to four sites in Cuba allegedly used to spy on the US - Fox News"
  ],
  [
    1734026409000,
    "He thought he had escaped Beijing’s clutches only to vanish back into China - The Washington Post"
  ],
  [
    1734029645000,
    "Trump has invited China's Xi to inauguration, spokesperson says - ABC News"
  ],
  [
    1734031334000,
    "Nvidia Denies Supply Cut Rumors Amid Regulatory Scrutiny in China; Shares Down - Yahoo Finance"
  ],
  [
    1734031854000,
    "Exclusive | Macron plans China visit amid talk of Beijing helping end Ukraine war - South China Morning Post"
  ],
  [
    1734032871000,
    "Semiconductor Stocks Exposed To China With Tariffs Incoming - Forbes"
  ],
  [
    1734037232000,
    "China's Xi not expected at Trump's inauguration - CBS News"
  ],
  [
    1734038760000,
    "China’s Xi is likely to decline Trump’s inauguration invitation, seeing it as too risky to attend - The Associated Press"
  ],
  [
    1734040049000,
    "Unpacking China’s “Four Red Lines” and Its Warning to Trump - Council on Foreign Relations"
  ],
  [
    1734040096000,
    "Morning Bid: China deepens stimulus drive, global signals mixed - Reuters"
  ],
  [
    1734041482000,
    "Chinese-Flagged Ship Suspected of Cutting Cables Remains Halted Weeks Later - The New York Times"
  ],
  [
    1734042242000,
    "Alleged Chinese spy linked to Prince Andrew excluded from the UK - Financial Times"
  ],
  [
    1734046500000,
    "Examining U.S. foreign policy towards Syria, China - CBS News"
  ],
  [
    1734048143000,
    "Tesla launches 'Actually Smart Summon' feature in China - Reuters"
  ],
  [
    1734049500000,
    "Trump extends unprecedented invites to China's Xi and other world leaders for his inauguration - The Associated Press"
  ],
  [
    1734052980000,
    "China says will decide to hold military exercises around Taiwan \"according to the situation of the struggle\" - Reuters.com"
  ],
  [
    1734054061000,
    "Indonesia’s Prabowo steers strategic middle path amid China, US rivalry - Al Jazeera English"
  ],
  [
    1734055810000,
    "Newspaper headlines: Nato considers 3% target and 'Andrew's links to China spy' - BBC.com"
  ],
  [
    1734062524000,
    "China-Russia Arctic cooperation a US national security concern - VOA Asia"
  ],
  [
    1734064883000,
    "China bond yields hit record low after Beijing vows ‘vigorous’ effort to boost consumption - Financial Times"
  ],
  [
    1734065799000,
    "China has cause to be terrified of rebel-run Syria - Asia Times"
  ],
  [
    1734066040000,
    "China’s Trump cards in the coming trade war escalation - Financial Times"
  ],
  [
    1734066300000,
    "China Wants Consumers to Spend, Spend, Spend as Trade War Nears - Bloomberg"
  ],
  [
    1734069235000,
    "China breaks silence on large military drills around Taiwan - DW (English)"
  ],
  [
    1734070200000,
    "China’s military is staying silent on its recent activity around Taiwan - The Associated Press"
  ],
  [
    1734071400000,
    "China's bond market sees more economic pain ahead - Reuters"
  ],
  [
    1734072787000,
    "China signals readiness to mend ties with U.S. ahead of Trump inauguration - CNBC"
  ],
  [
    1734074100000,
    "China's new tactic against Taiwan: drills 'that dare not speak their name' - Reuters"
  ],
  [
    1734074160000,
    "A top Chinese economist just said what many people suspected: China's official GDP numbers may not be accurate - Business Insider"
  ],
  [
    1734075452000,
    "China jails ex-football head coach Li Tie for bribery - BBC.com"
  ],
  [
    1734075540000,
    "Xi’s RSVP is a snub to Trump, but the inauguration invite is still a big deal - CNN"
  ],
  [
    1734077036000,
    "Chinese Coal Prices Slump to Year’s Low as Stimulus Disappoints - Bloomberg"
  ],
  [
    1734078157000,
    "Wargaming Nuclear Deterrence and Its Failures in a U.S.–China Conflict over Taiwan - Center for Strategic & International Studies"
  ],
  [
    1734078241000,
    "China’s ‘Lower for Longer’ Pledge Has Sent Bonds Into Unknown - Bloomberg"
  ],
  [
    1734078979000,
    "China eyes negotiations as Trump threatens new tariffs - Reuters"
  ],
  [
    1734080201000,
    "Xi Jinping prioritises consumers over chips as concerns over growth mount - Financial Times"
  ],
  [
    1734082079000,
    "China sets up AI standards committee as global tech race intensifies - Reuters"
  ],
  [
    1734083847000,
    "China says US politicians need to be more rational after senator's call for garlic probe - Reuters"
  ],
  [
    1734084043000,
    "US nuclear build-up would not help deter China from using atomic weapons in Taiwan, war game finds - Financial Times"
  ],
  [
    1734084799000,
    "China and Egypt agree on need to promote peace in Middle East - Reuters"
  ],
  [
    1734085235000,
    "China sentences ex-Premier League footballer Li Tie to 20 years in prison - Al Jazeera English"
  ],
  [
    1734085800000,
    "China signals it’s prepared to double down on support for the economy as Trump tariffs loom - The Associated Press"
  ],
  [
    1734088167000,
    "Chinese associate of Prince Andrew banned from UK as national security risk - Reuters UK"
  ],
  [
    1734088581000,
    "After days of military activity, China restates its hard line on Taiwan - Reuters"
  ],
  [
    1734089637000,
    "Former China coach Li Tie sentenced to 20 years in prison for bribery - Reuters"
  ],
  [
    1734090044000,
    "Prince Andrew’s Links to Chinese Spy Suspect Are Revealed by U.K. Court - The New York Times"
  ],
  [
    1734090467000,
    "Breakingviews - AstraZeneca lacks good medicine for Chinese limbo - Reuters"
  ],
  [
    1734091301000,
    "Can China climb out of economic stagnation in 2025? - DW (English)"
  ],
  [
    1734094196000,
    "US-China science pact renewed, sparking backlash from some in Trump’s party - South China Morning Post"
  ],
  [
    1734095475000,
    "Goldman Sachs granted licence for China fund sales - Yahoo Finance"
  ],
  [
    1734095597000,
    "US, China sign 5-year amended agreement on science and technology cooperation - VOA Asia"
  ],
  [
    1734096236000,
    "US and China sign new science pact — but with severe restrictions - Nature.com"
  ],
  [
    1734098400000,
    "This B-2 Bomber Engineer Sold America's Stealth Secrets to China - Popular Mechanics"
  ],
  [
    1734099300000,
    "China Launches New Military Drills Around Taiwan Following Lai’s First Overseas Trip - The Diplomat"
  ],
  [
    1734100200000,
    "US would face a 4-way axis in confrontation with China - The Hill"
  ],
  [
    1734100901000,
    "China’s oil consumption peaked in 2023, CNPC says - Reuters"
  ],
  [
    1734102258000,
    "Alleged Chinese spy had 'unusual degree of trust' with Andrew - BBC.com"
  ],
  [
    1734104700000,
    "Perfect Storm: The Rising Risk of China-US Conflict Over Taiwan - The Diplomat"
  ],
  [
    1734106680000,
    "How China could retaliate against the US in a trade war, according to a Yale economist - Business Insider"
  ],
  [
    1734108234000,
    "Outgoing US Envoy to China Says Ties on ‘Right Road,’ Don’t Veer - Bloomberg"
  ],
  [
    1734108900000,
    "US updates a science and technology pact with China to reflect growing rivalry and security threats - The Associated Press"
  ],
  [
    1734109200000,
    "How Trump is already driving Congress’ China legislation - POLITICO"
  ],
  [
    1734110435000,
    "Biden administration inks renewed science cooperation deal with China; Republicans cry foul - Reuters"
  ],
  [
    1734110502000,
    "Trump trade adviser warns against currency manipulation as China mulls weaker yuan - Reuters"
  ],
  [
    1734113700000,
    "United States and China renew science pact despite rising tensions - Science"
  ],
  [
    1734114720000,
    "Landmark US-China science pact renewed in rare bright spot for relations - Semafor"
  ],
  [
    1734116400000,
    "China’s emissions are peaking. Bringing them down will be the hard part. - The Washington Post"
  ],
  [
    1734117393000,
    "Prince Andrew issues statement over suspected Chinese spy barred from entering UK - Sky News"
  ],
  [
    1734118200000,
    "CNPC China Reaches Refined Oil Demand Peak - OilPrice.com"
  ],
  [
    1734118320000,
    "U.S. Prepares New AI Chip Restrictions to Close China’s Backdoor Access - The Wall Street Journal"
  ],
  [
    1734119820000,
    "How Prince Andrew turned to friends in China after Royal family banished him - The Telegraph"
  ],
  [
    1734120040000,
    "China launches “laser diamond constellation test” satellites - SpaceNews"
  ],
  [
    1734121331000,
    "Xi Jinping unlikely to attend Trump inauguration despite invite - BBC.com"
  ],
  [
    1734125407000,
    "Being Chinese | How my Malaysian Chinese education is paying off - South China Morning Post"
  ],
  [
    1734130223000,
    "Exclusive: Yellen won't rule out sanctions on Chinese banks, curbs on 'dark fleet' oil tankers - Reuters"
  ],
  [
    1734130278000,
    "UK, Japan and China ease travel warnings to Israel amid ceasefire with Hezbollah - The Times of Israel"
  ],
  [
    1734132300000,
    "US swaps prisoners with China, releasing 3 convicted spies - Fox News"
  ],
  [
    1734133320000,
    "A suspected Chinese spy with business ties to Prince Andrew is barred from UK - CNN"
  ],
  [
    1734136432000,
    "China quietly razes Uyghur business landmark in Xinjiang - VOA Asia"
  ],
  [
    1734136500000,
    "Democrats and Republicans condemn espionage-driven Chinese hack - The Guardian"
  ],
  [
    1734137265000,
    "Posts Wrongly Conflate U.S.-China Prisoner Swap with Biden’s Recent Pardons - FactCheck.org"
  ],
  [
    1734137692000,
    "U.S. and China renew science agreement as officials brace for new tensions - The Washington Post"
  ],
  [
    1734139080000,
    "China's Xi will visit Macau Dec 18-20 - Reuters"
  ],
  [
    1734141398000,
    "Chinese migrants in US illegally uneasy after fourth removal flight - VOA Asia"
  ],
  [
    1734141615000,
    "China aims to heal wounds of ‘involution’ as officials vow to stem bloodletting - South China Morning Post"
  ],
  [
    1734148809000,
    "China sells ultra-powerful laser cutter to unnamed US buyer in industry first - South China Morning Post"
  ],
  [
    1734151884000,
    "China's GDP growth expected around 5% this year, senior official says - Reuters"
  ],
  [
    1734152400000,
    "Prices Won’t Stop Falling in China, and Beijing Is Grasping for Solutions - The Wall Street Journal"
  ],
  [
    1734153120000,
    "U.S. and China renew science and technology pact amid growing rivalry - NBC News"
  ],
  [
    1734156012000,
    "Competition set to heat up over Australian gemstone used in hypersonic weapons - South China Morning Post"
  ],
  [
    1734157092000,
    "China's CNOOC sells US assets to Britain's INEOS - Yahoo Finance"
  ],
  [
    1734158209000,
    "Here's how China, not Europe, is driving growth in global EV sales - Euronews"
  ],
  [
    1734160493000,
    "China’s Amphibious Warfare: History, Doctrine, and Forces - The Diplomat"
  ],
  [
    1734165501000,
    "China to Cut Rates and RRR Next Year, PBOC Official Says - Bloomberg"
  ],
  [
    1734166354000,
    "China’s growth on track to hit target of around 5%, senior official suggests - South China Morning Post"
  ],
  [
    1734169301000,
    "Scandal-hit Prince Andrew back in the UK headlines over alleged Chinese spy - Reuters.com"
  ],
  [
    1734171355000,
    "China sells world’s fastest 60kW laser cutter to anonymous US buyer - Yahoo! Voices"
  ],
  [
    1734173782000,
    "Limits of Friendship: China — A Partner, Not an Ally - Riddle Russia"
  ],
  [
    1734174649000,
    "Beijing’s “Best Friend” To Host U.S. Navy For 1st Time In Nearly A Decade Amid Concerns Over China-Funded Naval Base - EurAsian Times"
  ],
  [
    1734176716000,
    "Why China’s ‘Autocracy 2.0’ May Soon Start to Wane - Bloomberg"
  ],
  [
    1734185651000,
    "Zambia Paid $82 Million to China Before Debt Revamp Deal - Bloomberg"
  ],
  [
    1734189962000,
    "China says Philippines has 'provoked trouble' in South China Sea with US backing - Reuters"
  ],
  [
    1734192000000,
    "Rutte’s China ‘bully’ warning hailed - 台北時報"
  ],
  [
    1734198971000,
    "Prince Andrew says he 'ceased all contact' with alleged Chinese spy - BBC.com"
  ],
  [
    1734202838000,
    "How to gain entrée into Trump’s White House? Beijing is looking for ways - South China Morning Post"
  ],
  [
    1734206400000,
    "‘China on Steroids’: A Saudi Path to a Peaceful, Modern Middle East - POLITICO"
  ],
  [
    1734222121000,
    "China bank lending rises far less than expected, more policy steps needed - Reuters.com"
  ],
  [
    1734224410000,
    "China: Xi Jinping brings finance to heel with arrests and salary caps - Le Monde"
  ],
  [
    1734226207000,
    "Opinion | What Elon Musk and Vivek Ramaswamy can learn from China’s reformers - South China Morning Post"
  ],
  [
    1734228013000,
    "China’s housing market rout is ending as policy actions revive sales - South China Morning Post"
  ],
  [
    1734228328000,
    "Big Chinese naval exercise leaves Taiwan and US struggling for response - Financial Times"
  ],
  [
    1734235043000,
    "Ex-OpenAI engineer launches robotics start-up amid China’s race to boost industry - South China Morning Post"
  ],
  [
    1734235214000,
    "China stamps out AI misuse to preserve national literature and ideology - South China Morning Post"
  ],
  [
    1734238833000,
    "China’s ecommerce merchants set up shop in Russia’s online marketplaces - Financial Times"
  ],
  [
    1734238833000,
    "China’s ‘loyal wingman’ drones open new front in military competition with US - Financial Times"
  ],
  [
    1734239358000,
    "As 90% Of F-15 Pilots “Suffer”, China Uses Centuries-Old Exercise To Create ‘Super Pilots’ For ‘Next-Gen Warfare’? - EurAsian Times"
  ],
  [
    1734240984000,
    "Can Chinese electric trucks overcome global tariffs to dominate the market? - South China Morning Post"
  ],
  [
    1734242416000,
    "Man sues China firm after failing 26-day isolation challenge for US$120,000 reward - South China Morning Post"
  ],
  [
    1734242419000,
    "How will Hungary’s Orban square the circle of ties with China and Trump? - South China Morning Post"
  ],
  [
    1734244440000,
    "China Housing Regulator Sees Stabilization Signs, Report Says - Bloomberg"
  ],
  [
    1734244450000,
    "China’s Regulators Vow to Stabilize Property, Stock Markets - Yahoo Finance"
  ],
  [
    1734245204000,
    "China Abductee Rejects 3 Flats, Cars From Wealthy Parents To Stay Humble - NDTV"
  ],
  [
    1734249608000,
    "China urges schools to teach AI as tech war and ChatGPT drive demand for talent - South China Morning Post"
  ],
  [
    1734253200000,
    "Trump leaves China guessing what his next move is with unusual inauguration invitation - Fox News"
  ],
  [
    1734253200000,
    "Rep Gimenez warns China is 'greatest threat' to US, Trump admin will 'project strength' to CCP - Fox News"
  ],
  [
    1734253680000,
    "From Brazil to China, Airbnb has its sights set on global dominance - Business Insider"
  ],
  [
    1734254460000,
    "US, China renew stalled scientific cooperation agreement - The Hindu"
  ],
  [
    1734260100000,
    "Yvette Cooper admits ‘complex’ relations with China amid Prince Andrew spy claims - The Guardian"
  ],
  [
    1734260408000,
    "Have money, will travel: Chinese investors join overseas assets in US visa bids - South China Morning Post"
  ],
  [
    1734263311000,
    "China gears up for an uncertain 2025. How investors plan to prepare - CNBC"
  ],
  [
    1734264010000,
    "Palestinian rescuers see China’s Blue Sky amid bomb blasts of Israel-Gaza war - South China Morning Post"
  ],
  [
    1734267601000,
    "How China's satellite megaprojects are challenging Elon Musk's Starlink - CNBC"
  ],
  [
    1734271207000,
    "China-EU trade war a ‘lose-lose’ situation, top diplomat Wang Yi warns - South China Morning Post"
  ],
  [
    1734274920000,
    "US Marines relocate from Okinawa to Guam; US strategy of encircling China using island chains unchanged, says expert - Global Times"
  ],
  [
    1734278414000,
    "What Lucid's Chief Engineer Thinks Of 'China's Apple Car' - InsideEVs"
  ],
  [
    1734280140000,
    "China launches new compact radiation detection chip for semiconductor self-reliance - TechRadar"
  ],
  [
    1734280436000,
    "UK minister defends talks with Beijing despite China spy claims - Financial Times"
  ],
  [
    1734281008000,
    "Incoming FCC chair is big tech critic who worries about China - VOA Asia"
  ],
  [
    1734283380000,
    "Pressure grows on government as MPs demand answers on Prince Andrew ‘Chinese spy’ - The Independent"
  ],
  [
    1734284158000,
    "Yang Tengbo: Who is alleged Chinese spy linked to Prince Andrew? - BBC.com"
  ],
  [
    1734284820000,
    "Beijing urges Chinese schools to prioritize teaching AI amid US tech trade war - Semafor"
  ],
  [
    1734284950000,
    "All eyes on Prince Andrew after alleged Chinese spy controversy - The Guardian"
  ],
  [
    1734286871000,
    "The forgotten faces of Christmas in China - The Guardian"
  ],
  [
    1734288900000,
    "King Charles is ‘furious’ with Prince Andrew over Chinese spy drama that ‘looks bad’ for royal family - New York Post"
  ],
  [
    1734289500000,
    "Who is H6, the Chinese businessman with links to Prince Andrew? - The Guardian"
  ],
  [
    1734290590000,
    "King Charles Is Furious Over Prince Andrew’s ‘Chinese Spy’ Scandal but ‘Can’t Sack’ His Brother: Report - PEOPLE"
  ],
  [
    1734291868000,
    "MPs consider naming Chinese ‘spy’ linked to Prince Andrew - The Guardian"
  ],
  [
    1734292816000,
    "Trump Goes From Capricious to a China Patriot - Bloomberg"
  ],
  [
    1734293880000,
    "MPs fear government too trusting of China in wake of alleged spy scandal - The Guardian"
  ],
  [
    1734296400000,
    "Alleged spy helped top private school with China expansion plans - The Telegraph"
  ],
  [
    1734299426000,
    "Morning Bid: 2024 bull run in home stretch, China 'data dump' eyed - Reuters"
  ],
  [
    1734300021000,
    "Open Questions | How China can survive Trump threats, avoid Japan’s mistakes: Zhang Yansheng - South China Morning Post"
  ],
  [
    1734302695000,
    "Asia Stocks in Tight Range With Eyes on China Data: Markets Wrap - Bloomberg"
  ],
  [
    1734302695000,
    "Chinese Shares Weigh on Asia Peers After Data Dump: Markets Wrap - Bloomberg"
  ],
  [
    1734303612000,
    "Chinese venture capital firm finds growth in niche spending amid overall slump - South China Morning Post"
  ],
  [
    1734306332000,
    "Asia markets reverse earlier gains as traders assess key China data and look ahead to central bank decisions due this week - CNBC"
  ],
  [
    1734307260000,
    "Top China wealth manager expands to Japan as home market stalls - Nikkei Asia"
  ],
  [
    1734307920000,
    "Xi brought down powerful rivals in the military. Now he’s going after his own men - CNN"
  ],
  [
    1734309028000,
    "China’s Fan Zhendong pleads for privacy after supporters mob him at hotel - South China Morning Post"
  ],
  [
    1734312960000,
    "China Home Prices Fall at Slower Pace in ‘Fragile’ Recovery - Bloomberg"
  ],
  [
    1734314400000,
    "China Consumer Slowdown Shows Urgent Need to Encourage Spending - Bloomberg"
  ],
  [
    1734314601000,
    "China’s November consumption misses estimate, adds urgency to stimulus - South China Morning Post"
  ],
  [
    1734314700000,
    "China's property investment falls 10.4% y/y in Jan-Nov - Reuters"
  ],
  [
    1734314823000,
    "China November industrial output rises 5.4%, above expectations - Reuters"
  ],
  [
    1734314880000,
    "China's November retail sales miss expectations as real estate slump deepens - CNBC"
  ],
  [
    1734316380000,
    "China's key economic gauges slowed in November despite stimulus - Nikkei Asia"
  ],
  [
    1734316860000,
    "China's consumption recovery continues despite growth slows, stats bureau says - Reuters"
  ],
  [
    1734316962000,
    "China sees slowest home price decline in 17 months amid signs of stabilisation - Reuters"
  ],
  [
    1734319680000,
    "China's homebrew Bluetooth alternative is on the march as Beijing pushes universal remotes - The Register"
  ],
  [
    1734320319000,
    "China’s November data showed mixed signals as 2024 winds down - ING Think"
  ],
  [
    1734320700000,
    "China’s Economy Loses Momentum - The Wall Street Journal"
  ],
  [
    1734321488000,
    "Markets wary of Fed rate plans, China retail disappoints - Reuters"
  ],
  [
    1734321609000,
    "PLA releases electronic warfare ‘kill list’ for US carrier groups - South China Morning Post"
  ],
  [
    1734322560000,
    "China’s Key Bond Yield Hits Fresh Record Low as Data Disappoints - Bloomberg"
  ],
  [
    1734323220000,
    "US Sanctions Disrupt Iranian Crude Flows to China, Vortexa Says - Bloomberg"
  ],
  [
    1734323663000,
    "China's Xi calls on party to 'turn knife inward' to end corruption - Reuters"
  ],
  [
    1734325238000,
    "EU presses for new powers to combat threat of Chinese import surge - Financial Times"
  ],
  [
    1734325291000,
    "How China is setting up shop in Mexico - Financial Times"
  ],
  [
    1734325543000,
    "China retail growth slows, agency calls for 2025 support - DW (English)"
  ],
  [
    1734326640000,
    "Starbucks Hires First China Growth Officer to Boost Sales - Bloomberg"
  ],
  [
    1734327000000,
    "Inside China's data-driven hunt for taxes on overseas gains - Nikkei Asia"
  ],
  [
    1734327166000,
    "Moody's Ratings raises China 2025 GDP forecast to 4.2% from 4.0% - Reuters"
  ],
  [
    1734327180000,
    "China's 'erotic clothing' capital braces for e-commerce crackdown - The Japan Times"
  ],
  [
    1734328260000,
    "China Races to Squelch Unrest as Signs of Economic Malaise Spread - The Wall Street Journal"
  ],
  [
    1734329340000,
    "Tanker Rates Tumble on Key Route as China Cuts Crude Purchases - Bloomberg"
  ],
  [
    1734331748000,
    "Weak China retail sales add to pressure on Beijing to lift economy - Financial Times"
  ],
  [
    1734333240000,
    "‘Kraven the Hunter’ Makes Modest Debut as ‘Her Story’ Maintains Lead at Sluggish China Box Office - Variety"
  ],
  [
    1734333480000,
    "China's Instagram-like Xiaohongshu making inroads with e-commerce sales - Reuters"
  ],
  [
    1734333797000,
    "China’s MD-19 hypersonic UAS with horizontal landing revealed - Bulgarian Military"
  ],
  [
    1734334920000,
    "For the first time in 8 years, a US Navy ship makes a port call in Cambodia, a top Chinese ally - The Associated Press"
  ],
  [
    1734335214000,
    "China's Gree can now make its own chips, local media reports - Reuters"
  ],
  [
    1734336191000,
    "Mercedes-Benz labour chief: we must win back market share, rethink China strategy - Reuters"
  ],
  [
    1734336374000,
    "China retail sales slow as consumers hold back, while home prices fall - Yahoo Finance"
  ],
  [
    1734338400000,
    "China’s weak consumption drags on economy as Trump tariff threat looms - CNN"
  ],
  [
    1734339105000,
    "China's Jan-Nov government land sales revenue falls 22.4% y/y - Reuters.com"
  ],
  [
    1734339362000,
    "China to boost direct fiscal support to consumers - Reuters.com"
  ],
  [
    1734339758000,
    "South China Sea: why Philippines’ new legal case against Beijing may fall flat - This Week In Asia"
  ],
  [
    1734340640000,
    "China’s Coal Output Hits a Record and Fuels Oversupply Concerns - Bloomberg"
  ],
  [
    1734344075000,
    "Starbucks hires its first-ever China chief growth officer as it battles fierce local competition - Yahoo Finance"
  ],
  [
    1734344640000,
    "Chinese ‘spy’ linked to Prince Andrew is ‘tip of the iceberg’ - POLITICO Europe"
  ],
  [
    1734345000000,
    "China Will Keep Trying to Spur Consumption Without Big Stimulus - Bloomberg"
  ],
  [
    1734346018000,
    "China’s Central Economic Work Conference (CEWC): Key Takeaways and Priorities for 2025 - China Briefing"
  ],
  [
    1734346858000,
    "What China Got Right in Latin America - Foreign Policy"
  ],
  [
    1734349500000,
    "How China could try to strangle Taiwan without firing a shot - Vox.com"
  ],
  [
    1734349541000,
    "Chinese officials arrive in Taipei for rare visit - Reuters"
  ],
  [
    1734352154000,
    "Exclusive: Britain pares back secretive China strategy review, seeking closer ties - Reuters UK"
  ],
  [
    1734352200000,
    "China Boosts Oil Inventories With Jump in Crude Imports - OilPrice.com"
  ],
  [
    1734352200000,
    "Breakingviews - US-China tech war will hold Asian allies hostage - Reuters"
  ],
  [
    1734352795000,
    "China kicks off Guowang megaconstellation with Long March 5B launch - SpaceNews"
  ],
  [
    1734353452000,
    "China launches first satellites for GuoWang project to rival SpaceX’s Starlink - South China Morning Post"
  ],
  [
    1734354480000,
    "Oil prices finish lower as downbeat China data ease demand prospects - MarketWatch"
  ],
  [
    1734354638000,
    "How backchannel diplomacy helped US and China emerge from balloon incident - South China Morning Post"
  ],
  [
    1734356760000,
    "Alleged Chinese spy 'tip of iceberg', says Iain Duncan Smith - BBC.com"
  ],
  [
    1734356837000,
    "China's remote sensing buildup risks US national security: Congressional commission report - Breaking Defense"
  ],
  [
    1734357609000,
    "Chinese ‘behaviour’ remarks by MIT professor unnerve top AI conference - South China Morning Post"
  ],
  [
    1734358380000,
    "Alleged Chinese spy linked to Prince Andrew named amid row over foreign interests register - The Guardian"
  ],
  [
    1734362550000,
    "Prince Andrew will not join Royal Family for Christmas at Sandringham as alleged Chinese spy named - BBC.com"
  ],
  [
    1734364290000,
    "Here’s Why US Manufacturers Can’t Quit China - Forbes"
  ],
  [
    1734365680000,
    "EU adopts new Russia sanctions targeting China, shadow fleet - Reuters"
  ],
  [
    1734368155000,
    "Biden Prepares to Target Chinese Legacy Chips With Trade Investigation - The New York Times"
  ],
  [
    1734368235000,
    "U.S. warship docks in Cambodia, a top Chinese ally, for first time in 8 years - CBS News"
  ],
  [
    1734368700000,
    "Prince Andrew's Chinese spy drama again pushes King Charles III to rein in scandal-prone brother - The Associated Press"
  ],
  [
    1734373948000,
    "Is the U.S. Answer to China’s Belt and Road Working? - Foreign Policy"
  ],
  [
    1734374387000,
    "Reverse Gear To Overdrive: Ajit Doval's Top China Meet To Boost Border Talks - NDTV"
  ],
  [
    1734374751000,
    "Top Chinese and Indian officials to discuss Himalayan border dispute this week - South China Morning Post"
  ],
  [
    1734375540000,
    "China is feeding a tech-based trade war with its monopoly on rare metals - MarketWatch"
  ],
  [
    1734376080000,
    "US investigating whether Chinese citizen charged with flying drone over base committed 'more serious offenses' - Fox News"
  ],
  [
    1734376207000,
    "Trump meets TikTok CEO after saying China, US can ‘solve all world’s problems’ together - South China Morning Post"
  ],
  [
    1734376688000,
    "PHP backdoor looks to be work of Chinese-linked APT group - CyberScoop"
  ],
  [
    1734377400000,
    "Trump administration wants to go on cyber offensive against China - The Register"
  ],
  [
    1734377400000,
    "Possible ban on Chinese-made drones dismays U.S. scientists - Science"
  ],
  [
    1734378960000,
    "Once again, China pushes for economic stimulus, hoping for a different result - Atlantic Council"
  ],
  [
    1734379038000,
    "The China-Russia relationship and threats to vital US interests - Brookings Institution"
  ],
  [
    1734379614000,
    "Oil sags on soft Chinese spending, investor pause before US Fed rate move - Reuters"
  ],
  [
    1734382389000,
    "Electric vehicle transition could create unwanted air pollution hotspots in China and India - Phys.org"
  ],
  [
    1734382800000,
    "China’s Factories Seek to Trump-Proof Business by Going Global - Bloomberg"
  ],
  [
    1734383603000,
    "How China is adopting battlefield lessons from Ukraine - Defense One"
  ],
  [
    1734385940000,
    "Why China’s UAV Supply Chain Restrictions Weaken Ukraine’s Negotiating Power - Center for Strategic & International Studies"
  ],
  [
    1734386059000,
    "EU sanctions Chinese firms, North Korean minister over Ukraine war - VOA Asia"
  ],
  [
    1734386280000,
    "British court names alleged Chinese spy who forged close ties to Prince Andrew - CNN"
  ],
  [
    1734390025000,
    "China wants to dominate in AI — and some of its models are already beating their U.S. rivals - CNBC"
  ],
  [
    1734390720000,
    "Prince Andrew spy scandal may have further exposed threat posed by China - The Guardian"
  ],
  [
    1734391546000,
    "China resident who stole Tesla trade secrets gets 2-year US sentence - Reuters"
  ],
  [
    1734391800000,
    "China’s Investment Bankers Struggle With Low Pay, Few Deals and Fear of Arrests - Bloomberg"
  ],
  [
    1734392049000,
    "FBI warns some lawmakers that China aims to create fake stories about them to erode support for Taiwan - NBC News"
  ],
  [
    1734392144000,
    "Biden Administration Takes First Step to Retaliate Against China Over Hack - The New York Times"
  ],
  [
    1734393938000,
    "China’s military rise: Comparative military spending in China and the US - CEPR"
  ],
  [
    1734397209000,
    "China dad nearly dies of heart attack while tutoring son over homework dispute - South China Morning Post"
  ],
  [
    1734399840000,
    "Washington moves to boost crackdown on China Telecom's US unit, source says - Reuters"
  ],
  [
    1734401322000,
    "China offers 10-day visa-free transit for international travellers - South China Morning Post"
  ],
  [
    1734403800000,
    "China’s Premier Calls for Urgency in Implementing Economic Work - Bloomberg"
  ],
  [
    1734404593000,
    "China extends visa-free transit stays to 10 days - Reuters"
  ],
  [
    1734406092000,
    "US backs graphite factory to loosen China’s EV supply chain grip - Financial Times"
  ],
  [
    1734406240000,
    "China Upgrades 144-Hour Visa-Free Transit to 10-Day Stay, Adds 21 Ports - China Briefing"
  ],
  [
    1734407040000,
    "Confidence of Foreign CEOs in China Slides Despite Stimulus - Bloomberg"
  ],
  [
    1734408960000,
    "China’s Crop Import Curbs Are Causing a Shortage of Soybeans - Bloomberg"
  ],
  [
    1734409380000,
    "China capital markets outflow hits record high in Nov after Trump election win - Reuters"
  ],
  [
    1734411600000,
    "China’s Slowdown Has Changed the Trade War - Foreign Affairs Magazine"
  ],
  [
    1734411629000,
    "China would balk at a sweeping Mar-a-Lago accord - Financial Times"
  ],
  [
    1734414720000,
    "China Capital Exodus Reaches Record Speed on Tariff Threat - Bloomberg"
  ],
  [
    1734417029000,
    "Where the US-China trade war meets AI hype - Financial Times"
  ],
  [
    1734420180000,
    "China may be poised for a decade-long bull run: Hedge fund - CNBC"
  ],
  [
    1734420480000,
    "China Plans Around 5% Growth Goal, Higher Deficit, Reuters Says - Bloomberg"
  ],
  [
    1734421800000,
    "China, India Officials to Meet in Beijing for Border Talks - Bloomberg"
  ],
  [
    1734422520000,
    "Taipei mayor calls for less confrontation as China continues sending ships, planes near island - The Associated Press"
  ],
  [
    1734422661000,
    "Asian Currency Index Drops to Two-Year Low as China, Trump Weigh - Bloomberg"
  ],
  [
    1734422700000,
    "Eastern Europe and East Asia forge closer ties as Russia, China threaten - Nikkei Asia"
  ],
  [
    1734422866000,
    "China Executes Former Official in $412 Million Corruption Case - Bloomberg"
  ],
  [
    1734423831000,
    "A Mysterious Poisoning, Contaminated Tanker Trucks, and a Death in Custody: 2024’s Best Investigative Stories About China - Global Investigative Journalism Network"
  ],
  [
    1734424329000,
    "Walmart teams up with delivery firm Meituan in bid to boost China e-commerce sales - Yahoo Finance"
  ],
  [
    1734424495000,
    "China, Trump talk up prospects for US-China collaboration - Reuters"
  ],
  [
    1734425766000,
    "China ready to enhance mutual trust with India at border talks, foreign ministry says - Reuters"
  ],
  [
    1734426151000,
    "Alibaba to sell China department store chain Intime for $1.3 bln loss - Reuters"
  ],
  [
    1734427201000,
    "China Warns UK Not to Make ‘Trouble’ After Royal Row - Bloomberg"
  ],
  [
    1734427500000,
    "China urges 'right choice' after Trump says he and Xi can fix world - Nikkei Asia"
  ],
  [
    1734429620000,
    "China’s ban on critical minerals to be felt across ‘all branches’ of US military - South China Morning Post"
  ],
  [
    1734430053000,
    "Americans can now visit China for up to 10 days without visas - NBC News"
  ],
  [
    1734431760000,
    "China extends visa-free transit policy to 10 days as part of efforts to lure more foreign tourists - CNN"
  ],
  [
    1734433366000,
    "China’s AI elite rethink their Silicon Valley dream jobs - Rest of World"
  ],
  [
    1734436807000,
    "China’s hypersonic drone launches revealed on video for first time - South China Morning Post"
  ],
  [
    1734438418000,
    "China tells UK to ‘stop creating trouble’ over alleged spy - Financial Times"
  ],
  [
    1734438600000,
    "China Poised to Investigate More U.S. Tech Deals After Nvidia Probe - The Information"
  ],
  [
    1734439419000,
    "Uyghur separatist threat could reach beyond China’s Xinjiang - Asia Times"
  ],
  [
    1734439442000,
    "China Embraces Coal in Energy Security Push Despite Green Goals - Bloomberg"
  ],
  [
    1734439782000,
    "Taiwan in talks with Amazon’s Kuiper on satellite communications amid China fears - Financial Times"
  ],
  [
    1734440400000,
    "Lichen China's AI Model with JD Technology to Launch December 2024, Targets 1M+ Enterprise Users - StockTitan"
  ],
  [
    1734440410000,
    "What is neijuan, and why is it worrying China’s economic policymakers? - South China Morning Post"
  ],
  [
    1734440922000,
    "Spy allegations pose dilemma for UK's China policy - BBC.com"
  ],
  [
    1734442085000,
    "Exclusive: China plans record budget deficit of 4% of GDP in 2025, say sources - Reuters"
  ],
  [
    1734442355000,
    "As China’s economy advances, investments into public education expand - Brookings Institution"
  ],
  [
    1734442740000,
    "Chinese embassy criticises ‘anti-China clamours’ after Yang Tengbo spy claim - The Guardian"
  ],
  [
    1734442912000,
    "Russia sells stakes in some Kazakh uranium deposits to China - Reuters"
  ],
  [
    1734443085000,
    "M15 alert on alleged Chinese agent upheld by judges - BBC.com"
  ],
  [
    1734445903000,
    "Canada to impose more tariffs on Chinese imports in new year - Reuters"
  ],
  [
    1734447710000,
    "The Near Enemy: China’s Subnational Reach Into the United States - Foundation for Defense of Democracies"
  ],
  [
    1734451406000,
    "A Look Inside Huawei’s Phone Shows How China’s Chip Advance Has Stalled - The New York Times"
  ],
  [
    1734453041000,
    "Prince Andrew mired in controversy once again after being linked to Chinese spy suspect - NBC News"
  ],
  [
    1734455222000,
    "China’s economy is in for another rough year - The Economist"
  ],
  [
    1734458032000,
    "US Republican committee chair expects revival of DOJ counter-China program - Reuters"
  ],
  [
    1734462140000,
    "China Launches Antitrust Investigation Into Nvidia Amid Rising U.S.-China Tensions - Yahoo Finance"
  ],
  [
    1734463451000,
    "China’s Stunning 2024 Export Growth - Council on Foreign Relations"
  ],
  [
    1734468120000,
    "Energy Stocks Are Dropping Because China’s Slowdown Is Real - Barron's"
  ],
  [
    1734471080000,
    "Biden to Announce Chinese Semiconductor Probe in Coming Days - Transport Topics"
  ],
  [
    1734471316000,
    "US lawmaker says China or its citizens could be tied to recent drone sightings - South China Morning Post"
  ],
  [
    1734472211000,
    "What Trump’s Personalized Presidency Means for China - Foreign Policy"
  ],
  [
    1734474060000,
    "'Spy drones' from China are likely cause of unexplained aircraft wreaking havoc over US, House foreign affairs chair says in bombshell claim - New York Post"
  ],
  [
    1734474386000,
    "Space Force must grow to counter China and Russia, lawmaker says - Defense News"
  ],
  [
    1734475114000,
    "Why Half a Trillion Dollars May Not Be Enough to Solve China's Housing Crisis - Bloomberg"
  ],
  [
    1734475620000,
    "Jets sign He, 1st China-born player with NHL deal - ESPN"
  ],
  [
    1734476927000,
    "China Lengthens Visa-Free Stays for Tourists - The New York Times"
  ],
  [
    1734480000000,
    "Critical metals will be a key battleground in US-China trade war - Reuters"
  ],
  [
    1734480005000,
    "Opinion | How Elon Musk and Taylor Swift Can Resolve U.S.-China Relations - The New York Times"
  ],
  [
    1734480660000,
    "China’s Billionaires Are Making Money for First Time Since 2020 - Bloomberg"
  ],
  [
    1734486127000,
    "Chinese astronauts complete world record-breaking spacewalk at 9 hours - South China Morning Post"
  ],
  [
    1734487219000,
    "Video | Trump tariff threat shakes China’s ‘lingerie capital’ - South China Morning Post"
  ],
  [
    1734488640000,
    "Eli Lilly's Alzheimer's treatment approved in China - Reuters"
  ],
  [
    1734493500000,
    "Congress to vote on new restrictions on U.S. investment in China - CNBC"
  ],
  [
    1734497940000,
    "China says astronauts completed nine-hour spacewalk, breaking US record - CNN"
  ],
  [
    1734498004000,
    "Flights, Border, Trade: India, China Resume Talks To Ease Tensions - NDTV"
  ],
  [
    1734498049000,
    "AstraZeneca insiders expect sales dip in China after arrest of local boss - Financial Times"
  ],
  [
    1734498430000,
    "China Becomes the Largest Wrist-Worn Device Market, Leading Global Growth - IDC"
  ],
  [
    1734499440000,
    "Tesla’s China Factory Head Song Gang Set to Depart This Week - Bloomberg"
  ],
  [
    1734499788000,
    "China’s ‘magic weapon’ helping Beijing wield influence in the UK - Financial Times"
  ],
  [
    1734501060000,
    "Asia Hedge funds eye Chinese tech leading AI charge in 2025 - Reuters"
  ],
  [
    1734501600000,
    "What does the China ‘spy’ row show? That Starmer can’t just muddle through on foreign policy - The Guardian"
  ],
  [
    1734505140000,
    "Watch Chinese astronauts perform historic spacewalk - CNN"
  ],
  [
    1734506100000,
    "Tesla's China factory head Song Gang leaves company, letter to staff shows - Reuters"
  ],
  [
    1734506640000,
    "China youth jobless rate falls for third straight month - Reuters"
  ],
  [
    1734506820000,
    "Shares of AMEC jump after removal from US's 'China military company' list - Reuters.com"
  ],
  [
    1734507120000,
    "Chinese Regulator Asks Insurers to Report Vanke Debt Holdings - Bloomberg"
  ],
  [
    1734508738000,
    "Outrage as scholar asks how can China make women ‘submissively have children’ - South China Morning Post"
  ],
  [
    1734508922000,
    "US lawmakers propose set of bills to hit China over fentanyl trade - Reuters"
  ],
  [
    1734516000000,
    "Exclusive | U.S. Weighs Ban on Chinese-Made Router in Millions of American Homes - The Wall Street Journal"
  ],
  [
    1734516000000,
    "US Graphite Firms Seek 920% Duty to Thwart China on EV Material - Bloomberg"
  ],
  [
    1734516313000,
    "After Mexico, Canada, and China, Trump trains tariff gun on India - The Indian Express"
  ],
  [
    1734517970000,
    "China Responds to EU Sanctions Over Ukraine War Support to Russia - Newsweek"
  ],
  [
    1734518390000,
    "Xi Jinping visits Macau to mark 25 years of Chinese rule - Reuters"
  ],
  [
    1734518626000,
    "China and India should maintain momentum of high-level talks, Chinese vice president says - Reuters.com"
  ],
  [
    1734519110000,
    "Biden ratchets up AI chip war with China - Axios"
  ],
  [
    1734521407000,
    "China’s record-low government bond yields spark fresh warning from central bank - South China Morning Post"
  ],
  [
    1734523474000,
    "Lightspeed Backs Croatian Startup Building China-Free Drones - Bloomberg"
  ],
  [
    1734523500000,
    "The China Shock Behind the Honda-Nissan Merger Talks - The Wall Street Journal"
  ],
  [
    1734527931000,
    "Chinese astronauts conduct record-breaking 9-hour spacewalk outside Tiangong space station (video) - Space.com"
  ],
  [
    1734528000000,
    "A new neutrino detector in China aims to spot mysterious ghost particles lurking around us - The Associated Press"
  ],
  [
    1734530400000,
    "China launches 1st set of spacecraft for planned 13,000-satellite broadband constellation (photo) - Space.com"
  ],
  [
    1734533898000,
    "‘Hard-won’ high-level China-India talks see agreement on six-point consensus - South China Morning Post"
  ],
  [
    1734534006000,
    "China’s Nuclear Buildup Is on Track Despite Graft Scandals, Pentagon Says - The New York Times"
  ],
  [
    1734534016000,
    "China is rapidly expanding nuclear forces, says Pentagon - Financial Times"
  ],
  [
    1734534060000,
    "China’s anticorruption crackdown is impeding its military buildup plans, Pentagon says - CNN"
  ],
  [
    1734534142000,
    "Corruption may slow China’s ability to one day invade Taiwan, DOD says - Defense News"
  ],
  [
    1734534399000,
    "China’s drone modernization efforts close to ‘matching US standards,’ Pentagon report says - DefenseScoop"
  ],
  [
    1734535067000,
    "China nearly triples nuclear arsenal since 2020, Pentagon report says - ABC News"
  ],
  [
    1734535376000,
    "China continues nuclear buildup, has strengthened ties to Russia, Defense Dept report says - CBS News"
  ],
  [
    1734535740000,
    "Pentagon Annual Report on Chinese Military and Security Developments - USNI News"
  ],
  [
    1734537418000,
    "New Pentagon Report: China Expanding Military Reach to Project Power Around the Globe - Air & Space Forces Magazine"
  ],
  [
    1734537480000,
    "China’s CATL is planning a major expansion of battery swapping for electric vehicles - The Associated Press"
  ],
  [
    1734537502000,
    "Chinese national cyber centre says U.S. hacks stole trade secrets from tech firms - Reuters"
  ],
  [
    1734538073000,
    "Pentagon: Chinese military saw ‘new wave’ of corruption with senior leaders - VOA Asia"
  ],
  [
    1734538821000,
    "Popular Internet Routers Made By China’s TP-Link Could Be Banned In The U.S., Report Says—Here’s What To Know - Forbes"
  ],
  [
    1734539820000,
    "Renewal of counter-drone authority, China crackdowns in last-minute government funding extension - Fox News"
  ],
  [
    1734540144000,
    "Pentagon report: China to build 1,000 nukes by 2030 - POLITICO"
  ],
  [
    1734541564000,
    "Nissan, Honda Merger Talks Reflect Reaction To China Competition - Forbes"
  ],
  [
    1734543279000,
    "Trump must maintain vital fentanyl progress with China, White House says - Reuters"
  ],
  [
    1734543720000,
    "India and China hold Himalayan border meeting after 5-year gap - Nikkei Asia"
  ],
  [
    1734544800000,
    "Man pleads guilty to operating secret Chinese police station in NYC - ABC News"
  ],
  [
    1734547158000,
    "The 2024 DOD China Military Power Report - Federation of American Scientists"
  ],
  [
    1734550554000,
    "U.S. begins to retaliate against China over hack of telecom networks - CBS News"
  ],
  [
    1734551645000,
    "Pentagon report highlights China’s space advancements and AI-driven ‘precision warfare’ - SpaceNews"
  ],
  [
    1734552000000,
    "New York man pleads guilty to running Chinese police station in Manhattan - The Guardian US"
  ],
  [
    1734555394000,
    "Man Who Ran Secret Police Office in New York Admits He Was Chinese Agent - The New York Times"
  ],
  [
    1734556038000,
    "U.S. mulls ban on Chinese-made TP-Link routers over security concerns - CBS News"
  ],
  [
    1734556500000,
    "India, China agree on peace roadmap, six-point consensus to boost ties - The Times of India"
  ],
  [
    1734557279000,
    "US graphite miners ask Washington to impose 920% tariff on Chinese rivals - Reuters"
  ],
  [
    1734559020000,
    "What the fall of the Assad regime really means for China - Atlantic Council"
  ],
  [
    1734560820000,
    "China's getting a big electric car battery swapping boost in 2025. Would that work across the globe? - The Associated Press"
  ],
  [
    1734561119000,
    "United Front Work: What does China's 'magic weapon' of influence do? - BBC.com"
  ],
  [
    1734561600000,
    "China has expanded its nuclear force and strengthened ties to Russia, the Pentagon says - The Associated Press"
  ],
  [
    1734563651000,
    "China’s nuclear warheads total 600 and raise ‘concerns’: Pentagon - South China Morning Post"
  ],
  [
    1734566029000,
    "Report: Despite Corruption Problems, China Progresses Toward Modernization - Department of Defense"
  ],
  [
    1734566417000,
    "Donald Trump’s tariff threat adds to fears over China growth - Financial Times"
  ],
  [
    1734567660000,
    "Sweeping Chinese hack of U.S. telecoms firms is 'still going on,' homeland security secretary says - NBC News"
  ],
  [
    1734571132000,
    "Pentagon Says Chinese Air Force Nipping at USAF’s Heels, but Not Yet a Match - Air & Space Forces Magazine"
  ],
  [
    1734571800000,
    "US Probes China-Founded Router Maker on National Security Fears - Bloomberg"
  ],
  [
    1734574260000,
    "US effort to curb China's and Russia's access to advanced computer chips 'inadequate,' report finds - The Associated Press"
  ],
  [
    1734576900000,
    "Fleeing Xi’s China: following the trail of migrants trying to reach Australia through Indonesia - The Guardian"
  ],
  [
    1734577680000,
    "A Glut of Coal in China Is Set to Push Falling Prices Even Lower - Bloomberg"
  ],
  [
    1734583200000,
    "China and India resume high-level talks to ease dispute over Himalayan border - CNN"
  ],
  [
    1734584407000,
    "Starbucks’ China Problem: Coffee Drinkers Want More for Less - The New York Times"
  ],
  [
    1734584413000,
    "G.M. Led in China for Years. Here’s How It Ended Up 16th in Sales. - The New York Times"
  ],
  [
    1734587520000,
    "Macao’s casino boom brings wealth but at a cost, 25 years since China’s takeover - The Associated Press"
  ],
  [
    1734588140000,
    "‘Straight Talk’ on China’s Offensives in the American Homeland - The Cipher Brief"
  ],
  [
    1734590822000,
    "China Says Astronauts Break Record with 9 Hour Spacewalk - The New York Times"
  ],
  [
    1734590913000,
    "Pentagon warns of China’s rapid military buildup despite corruption - The Washington Post"
  ],
  [
    1734593236000,
    "Want to visit China? New policy expands visa-free travel to 10 days. - The Washington Post"
  ],
  [
    1734595249000,
    "China stands behind Somalia amid US push for Somaliland recognition - South China Morning Post"
  ],
  [
    1734595277000,
    "Corruption may have disrupted Chinese military modernization goals, Pentagon report says - Reuters"
  ],
  [
    1734596172000,
    "New York man pleads guilty in Chinese 'secret police station' case - Reuters"
  ],
  [
    1734597070000,
    "What the Pentagon’s New Report on Chinese Military Power Reveals About Capabilities, Context, and Consequences - War On The Rocks"
  ],
  [
    1734597885000,
    "US military needs to talk to China on space, cyber issues, officials say - Defense One"
  ],
  [
    1734598800000,
    "China skirts US efforts to stiff-arm CCP interference by bolstering state, local relations - Fox News"
  ],
  [
    1734599857000,
    "Apple in talks with Tencent, ByteDance to roll out AI features in China, sources say - Reuters"
  ],
  [
    1734600360000,
    "Corruption in China’s Military Threatens Its Readiness, U.S. Says - The Wall Street Journal"
  ],
  [
    1734602527000,
    "Here Are 4 Reasons China Meddles in Local U.S. Politics - The New York Times"
  ],
  [
    1734603982000,
    "China's oil consumption to peak by 2027, says top refiner Sinopec - Reuters.com"
  ],
  [
    1734605093000,
    "Cohort trends in intrinsic capacity in England and China - Nature.com"
  ],
  [
    1734605379000,
    "How to get a free meal in China - The Economist"
  ],
  [
    1734607788000,
    "India gears up for a potential trade deal as Trump targets China, say government sources - Reuters India"
  ],
  [
    1734611040000,
    "Swedish police to go aboard Chinese ship that was seen near Baltic cable ruptures - The Associated Press"
  ],
  [
    1734611355000,
    "The Macro Consequences as Religious Trends in China Unfold - Word on Fire"
  ],
  [
    1734613200000,
    "Where will Trump and China drive commodities in 2025? - Reuters"
  ],
  [
    1734613235000,
    "India to surpass China as the top source of global oil consumption growth in 2024 and 2025 - EIA"
  ],
  [
    1734616800000,
    "U.S. Prompts Nvidia, Supermicro Probe Into How Chips Ended Up in China - The Information"
  ],
  [
    1734617644000,
    "Undocumented Chinese men say they're baffled by Trump's reported plans to deport them first - NBC News"
  ],
  [
    1734619425000,
    "How China’s Antitrust Tactics Undermine U.S. Tech Leadership - Foreign Policy"
  ],
  [
    1734621600000,
    "Playing catch-up with Pfizer and Roche, China-made ALK drug clears FDA in lung cancer - FiercePharma"
  ],
  [
    1734623623000,
    "New US Space Force jammers aim to disrupt China’s SATCOM signals - Defense News"
  ],
  [
    1734624000000,
    "China preparing for invasion: report - 台北時報"
  ],
  [
    1734625518000,
    "Nvidia’s Global Chips Sales Could Collide With US-China Tensions - The New York Times"
  ],
  [
    1734627261000,
    "Chinese cyber center points finger at U.S. over alleged cyberattacks to steal trade secrets - CyberScoop"
  ],
  [
    1734628391000,
    "China nears record launch year with Ceres-1 and SAR satellite missions - SpaceNews"
  ],
  [
    1734630156000,
    "Taiwan's China Airlines splits $12-billion jet deal between Boeing and Airbus - Reuters.com"
  ],
  [
    1734633766000,
    "Breakingviews - India starts resembling China in unflattering ways - Reuters"
  ],
  [
    1734634305000,
    "A whole floor of a NYC building was a secret, 'illegal police station' for China: DOJ - USA TODAY"
  ],
  [
    1734635425000,
    "China Makes Progress on Its Fifth Antarctic Research Station - Center for Strategic & International Studies"
  ],
  [
    1734638757000,
    "Congress funds removal of Chinese telecom gear as feds probe home router risks - The Washington Post"
  ],
  [
    1734642738000,
    "US restrictions on outbound investments to China scrapped from spending bill - South China Morning Post"
  ],
  [
    1734643920000,
    "Tokyo Electron counts on AI chip tools to offset China slowdown - Nikkei Asia"
  ],
  [
    1734645420000,
    "Exclusive | China Lets European Investigators Board Ship Suspected of Sabotage After Weeks of Secret Talks - The Wall Street Journal"
  ],
  [
    1734645602000,
    "China’s Struggling Rich Cities Are Threatening the Entire Economy - Bloomberg"
  ],
  [
    1734650059000,
    "Chinese government planted agent in SoCal with mission to influence local government, feds allege - Los Angeles Times"
  ],
  [
    1734651060000,
    "China Expanding Pacific Operations, Taiwan Invasion 'Not Possible' by 2027, Say DoD Officials - USNI News"
  ],
  [
    1734651954000,
    "US prompts Nvidia probe into how chips ended up in China, The Information reports - Yahoo Finance"
  ],
  [
    1734652799000,
    "Exclusive: China's state importer books US soy purchases as tariff threat looms - Reuters"
  ],
  [
    1734653760000,
    "California political operative allegedly acted as illegal agent of China: DOJ - Fox News"
  ],
  [
    1734655275000,
    "Rural Montana’s China tech challenge - Montana Free Press"
  ],
  [
    1734656640000,
    "China keeps benchmark lending rates steady as Fed signals fewer cuts ahead - CNBC"
  ],
  [
    1734657393000,
    "Macau Is the Casino Capital of the World. For China, That’s Not Enough. - The New York Times"
  ],
  [
    1734658061000,
    "Chinese National Charged in California After Aiding Local Candidate, Prosecutors Say - The New York Times"
  ],
  [
    1734664251000,
    "China counting on cyber-psychological cocktail to expand dominance - VOA Asia"
  ],
  [
    1734667080000,
    "California campaign manager arrested and charged as Chinese agent - The Washington Post"
  ],
  [
    1734667140000,
    "Chinese scientists publish findings from lunar soil samples - China Daily"
  ],
  [
    1734668400000,
    "China's Xi urges bigger international role for gambling hub Macau - Reuters.com"
  ],
  [
    1734670800000,
    "Why China Isn’t Scared of Trump: U.S.-Chinese Tensions May Rise, but His Isolationism Will Help Beijing - Foreign Affairs Magazine"
  ],
  [
    1734671715000,
    "Man charged with acting as Chinese agent in California election - USA TODAY"
  ],
  [
    1734674400000,
    "HSBC Chairman to lead pivotal UK business delegation to China - Reuters"
  ],
  [
    1734683408000,
    "Opinion | Why China will struggle to boost consumption - South China Morning Post"
  ],
  [
    1734684888000,
    "China Shorter Yields Sink to Two-Decade Low as Bond Fever Builds - Yahoo Finance"
  ],
  [
    1734685491000,
    "China’s short-term bond yields fall below 1% for first time since 2009 - Financial Times"
  ],
  [
    1734690042000,
    "Australia Targets China’s Influence With Deals in Pacific Islands - The New York Times"
  ]
]