[
  [
    1738012818000,
    "Tech stocks fall as China's DeepSeek sparks U.S. worries about the AI race - NBC News"
  ],
  [
    1738027320000,
    "Trump says China's DeepSeek AI ‘should be a wake-up call’ - NBC News"
  ],
  [
    1738062673000,
    "China’s DeepSeek and its Open-Source AI Models - China Briefing"
  ],
  [
    1738065963000,
    "Exclusive: Images show China building huge fusion research facility, analysts say - Reuters"
  ],
  [
    1738067870000,
    "DeepSeek: How China's 'AI heroes' overcame US curbs to stun Silicon Valley - BBC.com"
  ],
  [
    1738082046000,
    "Inside China, DeepSeek Provides a National Mic Drop Moment - The New York Times"
  ],
  [
    1738088051000,
    "UK will not be able to resist China's tech dominance - BBC.com"
  ],
  [
    1738094640000,
    "China built out record amount of wind and solar power in 2024 - The Associated Press"
  ],
  [
    1738101633000,
    "A big, beautiful Trump deal with China? - The Economist"
  ],
  [
    1738127580000,
    "After talking tough during campaign, Trump appears to ease up on China at start of presidency - The Associated Press"
  ],
  [
    1738137112000,
    "China’s DeepSeek faces questions over claims after shaking up global tech - Al Jazeera English"
  ],
  [
    1738158177000,
    "Commerce Nominee Defends Trump Tariffs and Promises Strong Stance on China - The New York Times"
  ],
  [
    1738159200000,
    "The Case for “Avalanche Decoupling” From China - Foreign Affairs Magazine"
  ],
  [
    1738166791000,
    "The world should take the prospect of Chinese tech dominance seriously, and start preparing now - Chatham House"
  ],
  [
    1738171909000,
    "As Trump's tariffs loom, analysts say China is better prepared than ever for a trade war with the U.S. - CBS News"
  ],
  [
    1738175537000,
    "OpenAI says Chinese rivals using its work for their AI apps - BBC.com"
  ],
  [
    1738182247000,
    "Why blocking China's DeepSeek from using US AI may be difficult - Reuters"
  ],
  [
    1738224000000,
    "China’s cheap, open AI model DeepSeek thrills scientists - Nature.com"
  ],
  [
    1738231225000,
    "DeepSeek, TikTok, RedNote: How Did China’s Internet Become So Cool? - Bloomberg"
  ],
  [
    1738233419000,
    "How China created AI model DeepSeek and shocked the world - Nature.com"
  ],
  [
    1738236540000,
    "Philippine president offers a deal to China: Stop sea aggression and I’ll return missiles to US - The Associated Press"
  ],
  [
    1738250233000,
    "Coming Together or Falling Apart Over China? - Center for European Policy Analysis"
  ],
  [
    1738251752000,
    "Is Cambodia slipping out of China’s orbit? - The Economist"
  ],
  [
    1738257553000,
    "Managing the Risks of China’s Access to U.S. Data and Control of Software and Connected Technology - Carnegie Endowment for International Peace"
  ],
  [
    1738263084000,
    "Moolenaar, Krishnamoorthi Call For Tightening Export Controls on Chips Critical to China's AI Platform DeepSeek and Other Measures to Address its Risks to Americans’ Data and Security - Select Committee on the CCP |"
  ],
  [
    1738278008000,
    "Why The China Bubble Still Hasn’t Popped - Bloomberg"
  ],
  [
    1738280520000,
    "Nvidia Chip Flow to China Should be Throttled Post-DeepSeek, U.S. Lawmakers Say - The Wall Street Journal"
  ],
  [
    1738282920000,
    "Rubio warns of risk of China shutting down Panama Canal in any conflict - Reuters Canada"
  ],
  [
    1738283580000,
    "Cook points to 'fiscal stimulus' after Apple suffers steepest China sales decline in a year - CNBC"
  ],
  [
    1738294781000,
    "Tell Us How Tariffs on Goods From China Will Affect Your Business - The New York Times"
  ],
  [
    1738302796000,
    "Trump announces steep tariffs on Canada, Mexico and China starting Saturday - FRANCE 24 English"
  ],
  [
    1738307185000,
    "Trump support for denuclearization talks with Russia, China raises hopes - VOA Asia"
  ],
  [
    1738321652000,
    "China says Japan's plans for chip export controls could damage business relations - Reuters"
  ],
  [
    1738324359000,
    "China builds nuke-resistant bunker - Axios"
  ],
  [
    1738326594000,
    "China passes on US soybeans despite Brazilian delays - Reuters"
  ],
  [
    1738331700000,
    "DeepSeek’s Breakthrough Sparks National Pride in China - The Wall Street Journal"
  ],
  [
    1738334775000,
    "Rubio heads to Central America, pursuing ‘America First’ diplomacy, countering China - VOA Asia"
  ],
  [
    1738335600000,
    "What questions will China's DeepSeek not answer? - DW (English)"
  ],
  [
    1738335879000,
    "Trump Will Hit Mexico, Canada and China With Tariffs - The New York Times"
  ],
  [
    1738336932000,
    "Here's what Trump’s tariff threats look like on the ground in China - CNBC"
  ],
  [
    1738339844000,
    "Trump says he will impose tariffs on Mexico, Canada, China beginning Saturday - Scripps News"
  ],
  [
    1738340013000,
    "DeepSeek’s Answers Include Chinese Propaganda, Researchers Say - The New York Times"
  ],
  [
    1738348274000,
    "Trump tariffs on Canada, Mexico and China begin Saturday, White House says - CNBC"
  ],
  [
    1738348807000,
    "White House Says China, Mexico, Canada Tariffs to Hit Feb. 1 - Bloomberg"
  ],
  [
    1738348870000,
    "Exclusive: Chinese workers in BYD Brazil factory signed contracts with abusive clauses, investigators say - Reuters"
  ],
  [
    1738349220000,
    "Trump to impose tariffs on imports from Canada, Mexico and China - The Guardian US"
  ],
  [
    1738349392000,
    "Reacting to DeepSeek, US Senate bill would separate US and China AI efforts - South China Morning Post"
  ],
  [
    1738350812000,
    "Trump to enact tariffs against Canada, China and Mexico on Feb. 1. Here's what to know. - CBS News"
  ],
  [
    1738350873000,
    "The global AI race: Is China catching up to the US? - Financial Times"
  ],
  [
    1738351137000,
    "Why the US is claiming China’s presence violates the Panama neutrality treaty - Reuters Canada"
  ],
  [
    1738352340000,
    "Trump to enact tariffs on Canada, Mexico, China - VOA Asia"
  ],
  [
    1738353275000,
    "White House Says Trump Tariffs on Canada, Mexico and China Will Come Saturday - TIME"
  ],
  [
    1738353676000,
    "US envoy calls China's presence around Panama Canal a security concern - Reuters"
  ],
  [
    1738357077000,
    "Here's how tariffs on Canada, China and Mexico may impact U.S. consumers - CNBC"
  ],
  [
    1738360234000,
    "Former Federal Reserve adviser arrested for passing trade secrets to China, Justice Department says - Reuters"
  ],
  [
    1738361193000,
    "US deportations to China continue amid shifts in immigration crackdown - VOA Asia"
  ],
  [
    1738361491000,
    "US charges former Fed official with spying for China - South China Morning Post"
  ],
  [
    1738364625000,
    "Consumers brace for impact of China tariffs - VOA Asia"
  ],
  [
    1738365875000,
    "Not 10 Feet Tall: Experts Say China’s Military Faces Major Issues - Air & Space Forces Magazine"
  ],
  [
    1738367430000,
    "What we know about Trump's plan to slap tariffs on Mexico, Canada and China - PBS NewsHour"
  ],
  [
    1738367575000,
    "Trump tariffs: President to hit Canada, Mexico and China with tariffs - BBC.com"
  ],
  [
    1738386016000,
    "Donald Trump’s China claims roil Panama as Marco Rubio visits - Financial Times"
  ],
  [
    1738386120000,
    "Trump: Nothing Canada, Mexico or China can do to delay Feb 1 tariffs - Reuters Canada"
  ],
  [
    1738393200000,
    "Can China’s Economy Wriggle Out of Danger? It’s Up to Xi and Trump. - Barron's"
  ],
  [
    1738404691000,
    "Trump's tariffs on Mexico, Canada, China would sock economy, lift inflation - USA TODAY"
  ],
  [
    1738405039000,
    "Rubio to focus on curbing immigration, countering China in Latin America - ABC News"
  ],
  [
    1738413900000,
    "Trump’s tariffs on Canada, Mexico and China: will they spark a trade war? - The Guardian US"
  ],
  [
    1738414807000,
    "China is surely ready to respond to Trump’s fresh tariffs, analysts say - South China Morning Post"
  ],
  [
    1738418018000,
    "Trump Signs Orders Imposing Tariffs on Canada, Mexico and China - The New York Times"
  ],
  [
    1738424319000,
    "Trump’s Tariffs on Canada, Mexico, and China Could Mean Higher Inflation and Economic Disruption - TIME"
  ],
  [
    1738425604000,
    "What could Trump's tariffs on Mexico, Canada and China mean for consumers? Here's what to know - NBC Chicago"
  ],
  [
    1738426377000,
    "I Followed My Stolen iPhone Across The World, Became A Celebrity In China, And Found A Friend For Life - BuzzFeed"
  ],
  [
    1738426944000,
    "Trump tariffs: US hits Mexico, Canada and China with import taxes - live updates - BBC.com"
  ],
  [
    1738427520000,
    "Trump’s tariffs on Mexico, Canada and China take effect Saturday - WBAL TV Baltimore"
  ],
  [
    1738443600000,
    "How American tech companies built China into an AI powerhouse - The Hill"
  ],
  [
    1738445408000,
    "Opinion | Why Beijing must move on from ‘Made in China 2025’ success - South China Morning Post"
  ],
  [
    1738447576000,
    "Trump Hits China, Canada, Mexico With Tariffs in Trade War - Bloomberg"
  ],
  [
    1738447633000,
    "Trump slaps tariffs on Mexico, Canada and China - CNBC"
  ],
  [
    1738448220000,
    "Trump slaps tariffs on Canada, Mexico, China, risking higher prices for U.S. consumers - NBC News"
  ],
  [
    1738448760000,
    "Former Federal Reserve adviser indicted and arrested for alleged espionage in dealings with China - The Associated Press"
  ],
  [
    1738448892000,
    "Former Federal Reserve official accused of passing secrets to China - Financial Times"
  ],
  [
    1738448940000,
    "Canada and Mexico hit back after Trump signs order for punishing tariffs - The Guardian US"
  ],
  [
    1738449180000,
    "Trump Signs New Tariffs On Canada, Mexico And China—Here’s What To Know - Forbes"
  ],
  [
    1738449579000,
    "See How Much the U.S. Trades With China, Canada and Mexico - The New York Times"
  ],
  [
    1738450385000,
    "Trump imposes tariffs on Canada, Mexico and China, raising prospect of higher costs for US - KEPR 19"
  ],
  [
    1738450759000,
    "Trump announces significant new tariffs on Mexico, Canada and China, sparking retaliatory actions - CNN"
  ],
  [
    1738450797000,
    "Trump signs executive orders imposing steep tariffs on China, Canada and Mexico - South China Morning Post"
  ],
  [
    1738450811000,
    "Trump imposes tariffs on Mexico, Canada, China linked to fentanyl crisis - UPI News"
  ],
  [
    1738450860000,
    "Bill Maher declares China ‘the new Islam,’ says left can’t be honest about the country’s threat - New York Post"
  ],
  [
    1738451178000,
    "Trump imposes steep tariffs on Canada, Mexico, and China. Will it sabotage economic growth? - The Christian Science Monitor"
  ],
  [
    1738454533000,
    "'The coming weeks will be difficult': Mexico, Canada respond to Trump's tariffs - ABC News"
  ],
  [
    1738457160000,
    "'Tariffs are not the answer': Industry and corporate leaders react to Trump duties on Mexico, Canada and China - CNBC"
  ],
  [
    1738459800000,
    "Trump enacts tariffs on America's largest trading partners, China, Mexico and Canada - CBS News"
  ],
  [
    1738460640000,
    "Here’s what will get more expensive from Trump’s tariffs on Mexico, Canada and China - CNN"
  ],
  [
    1738461477000,
    "Trump finalizes tariffs on Canada, Mexico, China, triggering likely trade war - POLITICO"
  ],
  [
    1738462500000,
    "Trump imposes 25% tariffs on Canada and Mexico; China is hit with 10% - USA TODAY"
  ],
  [
    1738464113000,
    "Donald Trump hits Canada, Mexico and China with steep tariffs - Financial Times"
  ],
  [
    1738464360000,
    "Canada, Mexico and China slam Trump's tariffs - NBC News"
  ],
  [
    1738464480000,
    "Reaction to Trump's imposition of tariffs on Mexico, Canada, China - Reuters"
  ],
  [
    1738464960000,
    "Mexico and Canada order retaliatory tariffs after Trump starts trade war - Los Angeles Times"
  ],
  [
    1738465253000,
    "Executive Order—Imposing Duties to Address the Synthetic Opioid Supply Chain in the People's Republic of China - The American Presidency Project"
  ],
  [
    1738465380000,
    "China firmly deplores and opposes US tariff move: China's FM, MOFCOM, CCPIT - Global Times"
  ],
  [
    1738465868000,
    "China vows retaliation on Trump tariffs, says 'no winners in trade war' - Hindustan Times"
  ],
  [
    1738466893000,
    "China hits back at US tariffs with vow to take case to the WTO - South China Morning Post"
  ],
  [
    1738469700000,
    "Trump Tariffs Target Loophole Used by Chinese Online Retailers - Bloomberg"
  ],
  [
    1738469925000,
    "Canada and Mexico Move to Retaliate on Trump Tariff Orders - The New York Times"
  ],
  [
    1738470122000,
    "China Assails Trump Tariffs and Threatens Legal Case With the W.T.O. - The New York Times"
  ],
  [
    1738470840000,
    "Trudeau answers after Trump imposes tariffs on goods from Canada, China and Mexico - NBC News"
  ],
  [
    1738470918000,
    "Trump says Canada, Mexico, China tariffs may bring 'pain' - DW (English)"
  ],
  [
    1738472100000,
    "China Vows Measures Against US Tariffs, Threatens WTO Action - Bloomberg"
  ],
  [
    1738472438000,
    "DeepSeek’s success will undermine the US-China tech war - Financial Times"
  ],
  [
    1738472465000,
    "DeepSeek A.I. Is a Win for China, but a Danger to Party Control - The New York Times"
  ],
  [
    1738472472000,
    "How US Tariffs Challenge China - The New York Times"
  ],
  [
    1738472472000,
    "Trump’s Tariffs Put China in a Difficult Spot - The New York Times"
  ],
  [
    1738472473000,
    "The ‘David and Goliath’ fight over China’s London mega-embassy - Financial Times"
  ],
  [
    1738473541000,
    "Mexico, Canada respond to Trump's tariffs: 'Difficult times' are ahead - ABC News"
  ],
  [
    1738474032000,
    "China 'firmly' opposes US tariff move, vows countermeasures to protect interests - Anadolu Agency | English"
  ],
  [
    1738474380000,
    "China vows to sue U.S. over Trump's tariff policy - Nikkei Asia"
  ],
  [
    1738476015000,
    "China’s Type 055 destroyer can stop US fleet with unmanned ‘kill web’: study - South China Morning Post"
  ],
  [
    1738477814000,
    "Donald Trump Hits China With Tariffs: Here's How Much Trade Is At Stake - NDTV"
  ],
  [
    1738478700000,
    "Experts react: Trump just slapped tariffs on Mexico, Canada, and China. What’s next? - Atlantic Council"
  ],
  [
    1738479993000,
    "China threatens countermeasures to combat Trump tariffs - Financial Times"
  ],
  [
    1738481220000,
    "US businesses brace for Trump’s tariffs on Canada, Mexico and China to drive up costs - The Associated Press"
  ],
  [
    1738484521000,
    "China denounces Trump tariff: 'Fentanyl is America's problem' - Reuters.com"
  ],
  [
    1738488059000,
    "China box office sets revenue record as sequels help overcome economic malaise - Reuters.com"
  ],
  [
    1738490340000,
    "China to retaliate after Trump fires first salvo in trade war - POLITICO Europe"
  ],
  [
    1738493891000,
    "'It doesn't have to be this way': Canada, Mexico, China and the EU respond to Trump's tariffs - CNBC"
  ],
  [
    1738495251000,
    "Canada, Mexico Hit Back at Trump Tariffs, China Vows Action - Yahoo Finance"
  ],
  [
    1738495380000,
    "Trump puts tariffs on Canada, Mexico and China, spurring trade war as North American allies respond - The Associated Press"
  ],
  [
    1738497600000,
    "President Trump Imposes 25% Tariffs on Canada and Mexico, and 10% Tariffs on China - White & Case LLP"
  ],
  [
    1738499346000,
    "US taxes imports from Canada, Mexico and China as Trump's tariffs begin - BBC.com"
  ],
  [
    1738500480000,
    "China to file lawsuit with WTO, vows ‘countermeasures’ in response to Trump tariffs - The Hill"
  ],
  [
    1738503631000,
    "Xi Weighs Retaliation After Trump Hits China With 10% Tariff - Bloomberg"
  ],
  [
    1738503718000,
    "China Hits Back at Donald Trump Tariffs: 'Serious Violation' - Newsweek"
  ],
  [
    1738505438000,
    "Donald Trump’s new trade war on China is also an opioid war - The Economist"
  ],
  [
    1738506769000,
    "DHS Sec. Kristi Noem says Canada, Mexico and China ‘will feel pain’ of tariffs: Full interview - NBC News"
  ],
  [
    1738507041000,
    "Canada and Mexico Under Attack: The China Solution - Center for Economic and Policy Research -"
  ],
  [
    1738508619000,
    "Trump tariff met with mixed reactions from China - VOA Asia"
  ],
  [
    1738509075000,
    "Global alarm, condemnation as Trump tariffs hit Mexico, Canada and China - Al Jazeera English"
  ],
  [
    1738509588000,
    "How have Canada, China and Mexico responded to Trump’s tariffs? - Al Jazeera English"
  ],
  [
    1738513920000,
    "Here are some goods in the crosshairs of Trump’s tariffs on Mexico, Canada and China - The Associated Press"
  ],
  [
    1738516852000,
    "Trump stretches trade law boundaries with Canada, Mexico, China tariffs - Reuters"
  ],
  [
    1738517200000,
    "On GPS: China is ready for a bigger trade war - CNN"
  ],
  [
    1738517237000,
    "On GPS: What explains China’s economic troubles? - CNN"
  ],
  [
    1738521390000,
    "Trump's Canada, Mexico, China tariffs suspend loophole behind fentanyl shipments - Yahoo! Voices"
  ],
  [
    1738523772000,
    "Trump says Americans could feel 'some pain' as he calls for tariffs on Canada, China, Mexico - USA TODAY"
  ],
  [
    1738524060000,
    "Live updates: Lawmakers talk Trump tariffs on Mexico, Canada, China - The Hill"
  ],
  [
    1738525980000,
    "China has a 'trick up its sleeve' to fight Trump's tariff as Beijing keeps response muted for now, former IMF adviser says - Fortune"
  ],
  [
    1738530714000,
    "Panama president defends sovereignty as US warns of action over China’s influence on canal - Anadolu Agency | English"
  ],
  [
    1738531130000,
    "US top diplomat warns Panama to reduce Chinese business interests in Canal - FRANCE 24 English"
  ],
  [
    1738531577000,
    "Rubio presses Panama to reduce Chinese influence over its canal or face U.S. ‘measures’ - PBS NewsHour"
  ],
  [
    1738531719000,
    "Canada, China, Mexico and the art of retaliation - The Economist"
  ],
  [
    1738532700000,
    "Secretary of State Marco Rubio warns Panama's president about Chinese influence over the Panama Canal - NBC News"
  ],
  [
    1738532810000,
    "Trump hits Canada, Mexico and China with steep new tariffs, says Americans could feel \"some pain\" - CBS News"
  ],
  [
    1738533600000,
    "Trump's antagonism risks pushing U.S. allies closer to China - NBC News"
  ],
  [
    1738537492000,
    "Rubio warns Panama of U.S. retaliation if China's canal influence remains - Axios"
  ],
  [
    1738538013000,
    "Rubio demands Panama 'reduce China influence' over canal - BBC.com"
  ],
  [
    1738540200000,
    "More China tariffs needed, says Trump's former trade chief, who calls the country an \"existential threat\" - CBS News"
  ],
  [
    1738540200000,
    "Trump's former trade chief says China is a threat, tariffs are necessary - CBS News"
  ],
  [
    1738540211000,
    "Rubio tells Panama to end China's influence of canal or face US action - Reuters Canada"
  ],
  [
    1738541760000,
    "Trump says EU tariffs will ‘definitely happen’ as Mexico, Canada and China retaliate - The Guardian US"
  ],
  [
    1738544749000,
    "Rubio warns of U.S. action if Panama does not curb Chinese influence around the canal - NPR"
  ],
  [
    1738548000000,
    "Trump says Americans could feel 'pain' in trade war with Mexico, Canada, China - Reuters"
  ],
  [
    1738548060000,
    "China factory activity growth slows in January, Caixin PMI shows - Reuters.com"
  ],
  [
    1738548180000,
    "China's January factory growth misses expectations as exports decline ahead of U.S. tariffs, Caixin PMI shows - CNBC"
  ],
  [
    1738548830000,
    "Won't renew Belt and Road deal with China, says Panama president amid US pressure - The Economic Times"
  ],
  [
    1738551000000,
    "Panama pledges to end key canal deal with China, work with US after Rubio visit - Fox News"
  ],
  [
    1738556511000,
    "China building world’s biggest military base in prep for US war - Asia Times"
  ],
  [
    1738557000000,
    "Taiwan and China need peace given 'multifold changes' internationally, president says - Reuters.com"
  ],
  [
    1738562190000,
    "China to propose restoring 2020 'Phase 1' trade deal with US, WSJ reports - Reuters"
  ],
  [
    1738564781000,
    "China tariffs deadline looms after Trump agrees reprieves with Canada and Mexico - BBC.com"
  ],
  [
    1738564793000,
    "Shein: Chinese fashion giant re-enters India five years after ban - BBC.com"
  ],
  [
    1738568770000,
    "China renews threat to retaliate against US tariffs - ABC News"
  ],
  [
    1738570989000,
    "China Stocks in Hong Kong Drop Post-Holiday on Trump 10% Tariff - Bloomberg"
  ],
  [
    1738570989000,
    "Chinese stocks in Hong Kong outperform peers as tech shares gain - Yahoo Finance"
  ],
  [
    1738573200000,
    "Trump's 'denuclearization' suggestion with Russia and China: How would it work? - Fox News"
  ],
  [
    1738574241000,
    "Trump Says Anybody Against His Tariffs 'Controlled by China' - Newsweek"
  ],
  [
    1738575142000,
    "New Unreported Submarine In China Leaves West Guessing - Naval News"
  ],
  [
    1738575288000,
    "For China, Trump’s Moves Bring Pain, but Also Potential Gains - The New York Times"
  ],
  [
    1738575319000,
    "DeepSeek signals China’s rising influence in AI — and AI drug development - STAT"
  ],
  [
    1738575660000,
    "China Box Office: ‘Ne Zha 2’ Leads Massive Lunar New Year Surge to $1.2 Billion as Imax Breaks Records - Variety"
  ],
  [
    1738578139000,
    "How should China respond to Trump? Ask DeepSeek - Reuters"
  ],
  [
    1738578600000,
    "Manufacturing Towns Hit by the ‘China Shock’ Bounced Back. The Workers Didn’t. - The Wall Street Journal"
  ],
  [
    1738578600000,
    "Estée Lauder’s $100 billion meltdown: How a big bet on China helped drag down shares in the luxury beauty titan - Fortune"
  ],
  [
    1738580400000,
    "Is DeepSeek China’s Sputnik Moment? - The New Yorker"
  ],
  [
    1738583428000,
    "Trump and Musk’s USAID ‘Shut Down’ Threat Opens Door for China - Bloomberg"
  ],
  [
    1738583807000,
    "Trump defends tariffs as Mexico, Canada and China plan retaliation - NewsNation Now"
  ],
  [
    1738585740000,
    "Trump fired the latest tariff shot at China. Is Beijing prepared to make it a trade war? - CNN"
  ],
  [
    1738588531000,
    "China announces retaliatory action as Trump tariffs take effect - BBC.com"
  ],
  [
    1738588531000,
    "Trump's 10% tariff on China begins as Beijing plans retaliation on US energy and some cars - BBC.com"
  ],
  [
    1738590600000,
    "China to pitch return to 'Phase One' Trump trade deal after warning US to 'correct its wrongdoings' - New York Post"
  ],
  [
    1738591200000,
    "A red moon: Will the next 'Sputnik Moment' be made in China? - Space.com"
  ],
  [
    1738591200000,
    "The Chinese AI companies that could match DeepSeek’s impact - The Guardian"
  ],
  [
    1738592883000,
    "Chinese officials vow countermeasures to Trump’s tariffs - NBC News"
  ],
  [
    1738595580000,
    "China Has Gotten Off Lightly on Tariffs—for Now - The Wall Street Journal"
  ],
  [
    1738596600000,
    "I bought a container full of Chinese electric excavators. Here’s what showed up - Electrek.co"
  ],
  [
    1738596960000,
    "JD Vance says Trump administration eyeing China crackdowns, with stocks in crosshairs - Fox Business"
  ],
  [
    1738597860000,
    "World reacts to Trump's order for tariffs on Canada, Mexico and China, as he warns Europe will be next - CBS News"
  ],
  [
    1738600860000,
    "Beijing residents speak about Trump’s trade tariffs on China - CNN"
  ],
  [
    1738600958000,
    "Trump's tariffs on Canada, Mexico, and China would cost the typical US household over $1,200 a year - Peterson Institute for International Economics"
  ],
  [
    1738600974000,
    "Chinese Embassy in Panama Reacts to Rubio's China Threat - Newsweek"
  ],
  [
    1738601985000,
    "What to know about China’s role in the fentanyl crisis - The Washington Post"
  ],
  [
    1738603740000,
    "Panama to end relationship with China’s premier foreign investment program after US pressure - New York Post"
  ],
  [
    1738605640000,
    "Global markets brace for chaos ahead of Trump's tariffs on Canada and China - NBC News"
  ],
  [
    1738607941000,
    "Trump tariffs may impact these items from Canada, Mexico and China. Who ends up paying? - Austin American-Statesman"
  ],
  [
    1738609963000,
    "Apple shares fall on concern Trump tariffs on China will hit profit - CNBC"
  ],
  [
    1738610357000,
    "Exclusive: US 'aware' of reports Iran trying to ship missile propellant chemical from China - VOA Asia"
  ],
  [
    1738611477000,
    "US hits Canada, Mexico, and China with significant new tariffs – implementation delayed by 30 days for Canada and Mexico - Dentons"
  ],
  [
    1738612569000,
    "Rubio hails Panama's move to exit Chinese infrastructure plan - Reuters"
  ],
  [
    1738612876000,
    "What DeepSeek Revealed About the Future of U.S.-China Competition - Foreign Policy"
  ],
  [
    1738614910000,
    "Trump's China tariffs are likely to drive up drug prices and spur shortages - NBC News"
  ],
  [
    1738616696000,
    "'Good opportunity' for Rubio, Wang to meet at UN on Feb. 18, says China's UN envoy - Reuters"
  ],
  [
    1738624028000,
    "Trump to speak with China's Xi after hiking tariffs, White House says - Reuters"
  ],
  [
    1738626071000,
    "Stocks, dollar stumble as China quickly hits back at US tariffs - Reuters"
  ],
  [
    1738630380000,
    "China Tightens Critical-Mineral Export Controls - The Wall Street Journal"
  ],
  [
    1738630380000,
    "Why China's Retaliatory Moves Aren't Very Painful for the U.S. So Far - The Wall Street Journal"
  ],
  [
    1738630920000,
    "US says packages from China to face formal customs entry under new tariffs - Reuters"
  ],
  [
    1738631414000,
    "Trump's tariffs: China strikes back with levies of up to 15% - DW (English)"
  ],
  [
    1738638060000,
    "Trump's tariff reprieve to bring relief to rupee; focus on China - Reuters"
  ],
  [
    1738638480000,
    "Rubio welcomes Panama’s move to exit Chinese infrastructure plan as ‘great step forward’ - The Guardian"
  ],
  [
    1738638840000,
    "Trump agrees to pause tariffs on Canada and Mexico after they pledge to boost border enforcement - The Associated Press"
  ],
  [
    1738639980000,
    "Trump Plans to Speak With Xi as Deadline for China Tariffs Looms - Bloomberg"
  ],
  [
    1738645260000,
    "Trump 10% Tariffs on China Set to Take Effect as Deadline Passes - Bloomberg"
  ],
  [
    1738645320000,
    "Trump’s new 10% tariffs on China take effect — Beijing responds with retaliatory taxes on US imports - New York Post"
  ],
  [
    1738645752000,
    "China Strikes Back After Trump Imposes 10% Tariff on Goods - The New York Times"
  ],
  [
    1738645752000,
    "China Counters Trump’s Tariffs As Talks Remain in Limbo - The New York Times"
  ],
  [
    1738645851000,
    "China to impose tariffs on US products, launches anti-monopoly probe into Google - South China Morning Post"
  ],
  [
    1738646040000,
    "China unveils US tariffs and Google investigation in response to Trump levies - The Guardian US"
  ],
  [
    1738646056000,
    "China retaliates with additional tariffs of up to 15% on select U.S. imports starting Feb. 10 - CNBC"
  ],
  [
    1738646880000,
    "China's finance ministry announces tariffs to counter Trump trade moves - Reuters"
  ],
  [
    1738647660000,
    "China hits back at Trump with new tariff on U.S. products - NBC News"
  ],
  [
    1738648413000,
    "China to launch probe into Google over alleged antitrust violations - CNBC"
  ],
  [
    1738648620000,
    "China puts PVH Corp, Illumina on its unreliable entity list - Reuters"
  ],
  [
    1738648680000,
    "China retaliates with tariffs on some US goods and a probe into Google - Business Insider"
  ],
  [
    1738649580000,
    "Reactions to China's tit-for-tat tariffs - Reuters"
  ],
  [
    1738649749000,
    "Trump agrees to pause tariffs on Canada and Mexico but not on China - BBC.com"
  ],
  [
    1738650600000,
    "China Announces Counter Measures Against U.S. - TIME"
  ],
  [
    1738651440000,
    "These Are All the US Goods China Is Targeting With Tariffs - Bloomberg"
  ],
  [
    1738651594000,
    "China retaliates against US tariffs with tariffs, probes, WTO complaint - Le Monde"
  ],
  [
    1738653080000,
    "China hits back against Trump tariffs with retaliatory measures, renewing trade war - FRANCE 24 English"
  ],
  [
    1738653317000,
    "China hits US with retaliatory tariffs - WJTV"
  ],
  [
    1738653360000,
    "China plans to send a flying robot to search for water on the moon’s far side - CNN"
  ],
  [
    1738653551000,
    "China Counters Trump, Imposes 15% Tariff On Coal, Gas Imports From US - NDTV"
  ],
  [
    1738654090000,
    "Trump sows uncertainty - and Xi Jinping sees an opportunity - BBC.com"
  ],
  [
    1738655550000,
    "China retaliates with tariffs on US goods after Trump’s move - Al Jazeera English"
  ],
  [
    1738657346000,
    "China targets U.S. coal, gas, Google as Trump tariffs take effect - NPR"
  ],
  [
    1738658040000,
    "China hits back at Trump’s tariffs with an antitrust investigation into Google and a new 15% tax on U.S. coal and gas - Fortune"
  ],
  [
    1738659314000,
    "VOA Mandarin: China reacts to Panama quitting BRI - VOA Asia"
  ],
  [
    1738661216000,
    "How China is playing to win Trump’s trade war - Asia Times"
  ],
  [
    1738661280000,
    "US and Philippine fighter aircraft jointly patrol disputed shoal region guarded by China - The Associated Press"
  ],
  [
    1738662600000,
    "China responds with tariffs on US goods after Trump's tariffs on Chinese imports take effect - Fox Business"
  ],
  [
    1738664760000,
    "Trump Tariffs Live Updates: China Responds With Retaliatory Tariffs, Export Controls And Google Probe - Forbes"
  ],
  [
    1738670004000,
    "What are the five critical metal exports restricted by China? - Reuters"
  ],
  [
    1738670013000,
    "China Immediately Hits Back at Trump Tariffs With Levies, Google Probe - Investopedia"
  ],
  [
    1738670429000,
    "Breakingviews - Tariff whiplash fires up China stimulus games - Reuters"
  ],
  [
    1738670514000,
    "Xi’s Careful Reply to Trump Tariffs Shows China Has More to Lose - Bloomberg"
  ],
  [
    1738670663000,
    "China Swiftly Responds to Trump’s Tariffs With a Range of Measures - The New York Times"
  ],
  [
    1738670856000,
    "China expands key mineral export controls after US imposes tariffs - Reuters"
  ],
  [
    1738670895000,
    "China hits U.S. with tariffs and Elon Musk's influence and access questioned: Morning Rundown - NBC News"
  ],
  [
    1738673708000,
    "Trump tariffs: Beijing hits back – can China and US avoid trade war escalation? - BBC.com"
  ],
  [
    1738673887000,
    "China's curbs on exports of strategic minerals - Reuters"
  ],
  [
    1738673996000,
    "China kills energy trade with the US, but initial impact is limited - Reuters"
  ],
  [
    1738675105000,
    "China strikes back at Trump, retaliating with new tariffs as it 'firmly opposes' US plan - ABC News"
  ],
  [
    1738675543000,
    "Coal and gas among US targets of China's retaliatory tariffs - BBC.com"
  ],
  [
    1738676573000,
    "China hits back with levies on US products after Trump's tariffs take effect - USA TODAY"
  ],
  [
    1738677150000,
    "China hits back as Trump’s tariffs go into effect - CNN"
  ],
  [
    1738679794000,
    "What tariffs is China imposing on the US – and why are they significant? - Al Jazeera English"
  ],
  [
    1738680033000,
    "Five ways China is hitting back against US tariffs - BBC.com"
  ],
  [
    1738682482000,
    "Merck stops Gardasil shipments to China, hitting 2025 outlook; shares tumble - Yahoo Finance"
  ],
  [
    1738682570000,
    "Air cargo industry jolted by Trump tariffs on Chinese e-commerce - FreightWaves"
  ],
  [
    1738683060000,
    "China launches an antitrust probe into Google. Here’s what it means - The Associated Press"
  ],
  [
    1738683287000,
    "Trump tariffs updates: China retaliates with levies against US - Al Jazeera English"
  ],
  [
    1738683655000,
    "China and the Future of Global Supply Chains - Rhodium Group"
  ],
  [
    1738684706000,
    "China announces measures against Google, other US firms, as trade tensions escalate - Reuters"
  ],
  [
    1738686300000,
    "China has reacted in kind to Trump’s tariffs, but a deal may still emerge - The Guardian"
  ],
  [
    1738687980000,
    "Big tech to tungsten: what industries are the focus of China’s new US tariffs? - The Guardian"
  ],
  [
    1738688385000,
    "‘Treat others the same way they treat us’: China reacts to US trade tariffs - CNN"
  ],
  [
    1738688782000,
    "China tariff retaliation targets its modest US energy imports - Reuters"
  ],
  [
    1738691498000,
    "China Tariffs: Here’s What May Cost More In The US - Forbes"
  ],
  [
    1738691949000,
    "WHO Faces China Pushback On Member State Fee Increase - Even After Slashing Budget Following US Exit - Health Policy Watch"
  ],
  [
    1738694809000,
    "With China’s Antitrust Investigation Into Google, What’s at Stake? - The New York Times"
  ],
  [
    1738697116000,
    "Why India isn’t winning the contest with China - The Economist"
  ],
  [
    1738699227000,
    "De minimis shipping from China axed under Trump tariffs - Supply Chain Dive"
  ],
  [
    1738700925000,
    "US dollar edges lower as China tariffs kick in - Reuters"
  ],
  [
    1738704467000,
    "Trump downplays China’s retaliatory tariffs, ‘in no rush’ to talk to Xi - South China Morning Post"
  ],
  [
    1738705220000,
    "Wednesday Briefing: China Hits Back Against U.S. Tariffs - The New York Times"
  ],
  [
    1738706809000,
    "Trade war with China casts dark cloud over new US LNG projects - Reuters"
  ],
  [
    1738709195000,
    "Trump in ‘no rush’ to talk to Chinese leader Xi - POLITICO"
  ],
  [
    1738711620000,
    "Trump Tariff News, Feb. 4, 2025: U.S. President, Xi Won't Speak Tuesday After China Retaliates - The Wall Street Journal"
  ],
  [
    1738712035000,
    "U.S. Trade Actions in China and Canada - NPR"
  ],
  [
    1738713023000,
    "China responds to Trump with retaliatory tariffs and Google antitrust probe - PBS NewsHour"
  ],
  [
    1738713840000,
    "Farmer fears new tariffs after impacts of 2018 trade war with China - CBS News"
  ],
  [
    1738714260000,
    "From lip balm to sneakers, here's how Trump's China tariffs could raise prices - NBC News"
  ],
  [
    1738714980000,
    "Wall Street rises on US-China trade optimism, energy boost - Reuters"
  ],
  [
    1738716486000,
    "China announces counter tariffs on numerous U.S. products with U.S. levies due to take effect - CBS News"
  ],
  [
    1738717200000,
    "China counters with tariffs on US products. It will also investigate Google - The Associated Press"
  ],
  [
    1738717343000,
    "Tesla offers insurance subsidy for Model 3 buyers in China - Reuters"
  ],
  [
    1738720163000,
    "China displays multiple weapons in retaliation for Trump’s tariffs - The Washington Post"
  ],
  [
    1738720800000,
    "What Do Trump’s First Weeks Tell Us About His China Strategy? - The Wall Street Journal"
  ],
  [
    1738722204000,
    "A Guide to Minimum Wages in China (As of February 5, 2025) - China Briefing"
  ],
  [
    1738722720000,
    "China Retaliates Against U.S., Intensifying Trade War - The Wall Street Journal"
  ],
  [
    1738723057000,
    "USPS suspends inbound packages from China, Hong Kong Posts - Fox Business"
  ],
  [
    1738723266000,
    "Hours after suspending service, USPS to allow packages from China, Hong Kong - Scripps News"
  ],
  [
    1738724627000,
    "US Postal Service restores delivery of incoming parcels from China and Hong Kong after briefly suspending them - CNN"
  ],
  [
    1738726427000,
    "USPS Resumes Accepting Packages From China After Unexpected Suspension - WIRED"
  ],
  [
    1738727982000,
    "US Postal Service suspends incoming packages from China and Hong Kong - USA TODAY"
  ],
  [
    1738733850000,
    "USPS Reverses Decision to Halt Parcel Service From China - The New York Times"
  ],
  [
    1738736820000,
    "Trump in no hurry to talk to Xi amid new tariff war - Reuters"
  ],
  [
    1738736878000,
    "China has delayed or redirected 600,000 tons of wheat imports, sources say - Reuters.com"
  ],
  [
    1738737043000,
    "China’s tariff response - Financial Times"
  ],
  [
    1738743060000,
    "U.S. Postal Service reverses decision to stop accepting packages from China, after Trump ends ‘de minimis’ exemption used by Temu and Shein - Fortune"
  ],
  [
    1738743246000,
    "China keeps renminbi steady in first fix since Donald Trump’s tariffs - Financial Times"
  ],
  [
    1738744020000,
    "What cutting USAID could cost the U.S. — and how China, Russia may benefit - NBC News"
  ],
  [
    1738744980000,
    "USPS Halts All Inbound Packages From China And Hong Kong—Here’s Why It Could Affect Temu And Shein Orders - Forbes"
  ],
  [
    1738745001000,
    "China lodges complaints with U.S. over Panama Canal remarks - Reuters.com"
  ],
  [
    1738745188000,
    "China blames US 'sabotage' for Panama's departure from Belt and Road initiative - Reuters"
  ],
  [
    1738745543000,
    "China's stocks kick off Year of the Snake with trade war, AI rally - Reuters"
  ],
  [
    1738746000000,
    "How bad is the trade war with China going to get? - CNN"
  ],
  [
    1738746483000,
    "Apple shares slide after China reportedly considers probe into App Store practices - CNBC"
  ],
  [
    1738746709000,
    "China rejects Trump's plan to ‘take over’ Gaza, displace millions of Palestinians - Anadolu Agency | English"
  ],
  [
    1738748279000,
    "China calls for cooperation with EU amid 'global challenges' - Reuters"
  ],
  [
    1738749600000,
    "Trump Is Turning Out To Be a Very Pro-China President - POLITICO"
  ],
  [
    1738749613000,
    "Panama Canal and Trump: How much influence does China really have? - The Christian Science Monitor"
  ],
  [
    1738750001000,
    "China Weighs Probe Into Apple’s App Store Fees, Practices - Bloomberg"
  ],
  [
    1738753287000,
    "Los Angeles, My Chinese Christian Friends Are Praying for Us - ChristianityToday.com"
  ],
  [
    1738753748000,
    "Trump's China tariffs could drive up these prices - ABC News"
  ],
  [
    1738754100000,
    "Why China is blacklisting Calvin Klein and Tommy Hilfiger after Trump’s tariffs - CNN"
  ],
  [
    1738756140000,
    "China and Europe target Big Tech in scramble to fight back against Trump’s tariff broadside - Fortune"
  ],
  [
    1738756800000,
    "How I Accidentally Became Part of China’s PR Campaign - The Assembly"
  ],
  [
    1738761025000,
    "US Postal Service Reverses Decision to Halt China Shipments - Bloomberg"
  ],
  [
    1738761158000,
    "US Postal Service briefly suspends inbound packages from China - VOA Asia"
  ],
  [
    1738761291000,
    "USPS says it will resume accepting inbound packages from China, Hong Kong - CNBC"
  ],
  [
    1738761475000,
    "DeepSeek coding has the capability to transfer users' data directly to the Chinese government - ABC News"
  ],
  [
    1738762200000,
    "Trump Tariffs Live Updates: USPS Does A U-Turn And Says It Will Continue Accepting Packages From China - Forbes"
  ],
  [
    1738762750000,
    "USPS Resumes Accepting Shipments From China—Including Temu, Shein—After Brief Halt - Forbes"
  ],
  [
    1738763220000,
    "U.S. Postal Service Resumes Shipments of China Parcels - The Wall Street Journal"
  ],
  [
    1738763458000,
    "Preventing China’s DeepSeek in Space - Defense News"
  ],
  [
    1738763844000,
    "Trump’s China tariffs are shutting the big loophole that make Shein and Temu so cheap - Yahoo Finance"
  ],
  [
    1738764080000,
    "USPS will continue to accept packages from China and Hong Kong, reversing prior decision - USA TODAY"
  ],
  [
    1738765535000,
    "USPS resumes accepting packages from China, Hong Kong amid Trump trade war - Axios"
  ],
  [
    1738765694000,
    "US Postal Service will accept packages from China, Hong Kong after freeze - Al Jazeera English"
  ],
  [
    1738765908000,
    "Trump tariffs: US Postal Service resumes deliveries from China - BBC.com"
  ],
  [
    1738767108000,
    "China considers probe into Apple's policies and App Store fees, Bloomberg News reports - Reuters"
  ],
  [
    1738768380000,
    "Pakistan’s president says extremist attacks won’t end friendship with China - The Associated Press"
  ],
  [
    1738768444000,
    "Postal Service to resume accepting China shipments - NBC News"
  ],
  [
    1738768500000,
    "China is building a giant laser facility to master near-limitless clean energy, satellite images appear to show - CNN"
  ],
  [
    1738768620000,
    "Fast fashion, laptops and toys are likely to cost more due to US tariffs on Chinese imports - The Associated Press"
  ],
  [
    1738770180000,
    "Tesla brings new discount to China amid demand slump - Electrek.co"
  ],
  [
    1738771800000,
    "Researchers link DeepSeek’s blockbuster chatbot to Chinese telecom banned from doing business in US - The Associated Press"
  ],
  [
    1738771980000,
    "US Postal Service flip-flops on Hong Kong-China packages, lifting a ban imposed a day earlier - The Associated Press"
  ],
  [
    1738774309000,
    "USPS says packages from China and Hong Kong will be accepted again after temporary suspension - CBS News"
  ],
  [
    1738775652000,
    "Shenyang Visas - US Embassy & Consulates in China"
  ],
  [
    1738776373000,
    "Lu Shaye, China’s controversial ex-envoy to France, handed new role for Europe - South China Morning Post"
  ],
  [
    1738776809000,
    "China restricts metal exports in response to US tariffs. Why they're important. - USA TODAY"
  ],
  [
    1738780274000,
    "COMMISSIONER SID MILLER SAYS MYSTERY SEED PACKAGES FROM CHINA ARE BACK - Texas Department of Agriculture"
  ],
  [
    1738782102000,
    "China launches WTO dispute over Trump tariffs - Reuters"
  ],
  [
    1738782355000,
    "Year of the Snake comes with a bite for Chinese consumers facing an economic slowdown - NBC News"
  ],
  [
    1738783038000,
    "What are the risks of a U.S.-China trade war, and can conflict be averted? - CBS News"
  ],
  [
    1738783411000,
    "A Chinese migrant’s harrowing escape by boat to Florida amid crackdown on illegal immigration - NBC News"
  ],
  [
    1738784374000,
    "The End of the Chinese Economic Miracle? - American Enterprise Institute"
  ],
  [
    1738785464000,
    "Oil down as US crude inventories swell, traders worry about China-US trade - Reuters"
  ],
  [
    1738790613000,
    "Trump's China focus increases odds its special trading status could end - Reuters"
  ],
  [
    1738792711000,
    "China no longer has a de minimis trade exemption. What is it? - NPR"
  ],
  [
    1738793040000,
    "Opinion | China Watches as Russia’s Economy Teeters - The Wall Street Journal"
  ],
  [
    1738796405000,
    "Trade war or not, global investors turn even more cautious on China - Reuters"
  ],
  [
    1738798140000,
    "US Shoppers Face Fees of Up to $50 or More to Get Packages From China - WIRED"
  ],
  [
    1738799144000,
    "B-1 Bombers, Philippine Fighters Maneuver Over South China Sea - Air & Space Forces Magazine"
  ],
  [
    1738800929000,
    "San Diego-based Illumina caught in U.S.-China trade war - Axios"
  ],
  [
    1738802594000,
    "Trump wants a TikTok deal. China may pull the plug. - The Washington Post"
  ],
  [
    1738803180000,
    "US Postal Service U-turn on China parcels sows confusion among retailers, shippers - Reuters"
  ],
  [
    1738806378000,
    "China calls Trump tariffs 'discriminatory' in WTO complaint - BBC.com"
  ],
  [
    1738806900000,
    "Cook Islands PM aims to boost trade ties during China visit - Reuters"
  ],
  [
    1738808685000,
    "China’s 60-second dramas head to the U.S. after beating box office - Fortune"
  ],
  [
    1738812824000,
    "McKinsey partners question China presence as US tensions mount - The Economic Times"
  ],
  [
    1738816860000,
    "China touts record spending over Lunar New Year holiday - CNN"
  ],
  [
    1738818000000,
    "China’s Trump Strategy - Foreign Affairs Magazine"
  ],
  [
    1738818000000,
    "‘Bring me my tariffs’: how Trump’s China plan was 40 years in the making - The Guardian"
  ],
  [
    1738818540000,
    "Why Trump Is Closing a Trade Exemption for China - The Wall Street Journal"
  ],
  [
    1738823726000,
    "With US funding freeze, China nonprofits are facing extinction. They need emergency assistance - The Strategist"
  ],
  [
    1738826100000,
    "After DeepSeek leap forward, Russia's Sberbank plans joint AI research with China - Reuters"
  ],
  [
    1738828320000,
    "Xi calls for China, Thailand to beef up ties to fight global uncertainties - Reuters"
  ],
  [
    1738828620000,
    "Focus: China's U.S. ethane imports to surge in 2025 in drive to cut costs - Reuters"
  ],
  [
    1738829245000,
    "China’s first counter-sanction on US biotech industry a turning point in tech war - South China Morning Post"
  ],
  [
    1738830120000,
    "China's Xi and Thailand's leader vow to crack down on scam networks that plague Southeast Asia - The Associated Press"
  ],
  [
    1738830120000,
    "Russia's Sberbank plans joint AI research with China as DeepSeek leaps forward - Reuters"
  ],
  [
    1738830267000,
    "China names combative diplomat as senior envoy for Europe - Reuters"
  ],
  [
    1738831020000,
    "A flurry of international naval drills around the Philippines prompts complaints from Beijing - The Associated Press"
  ],
  [
    1738831482000,
    "DeepSeek fever fuels patriotic bets on Chinese AI stocks - Reuters"
  ],
  [
    1738832008000,
    "China says will protect its own interests in face of U.S. 'bullying' - CNBC"
  ],
  [
    1738832536000,
    "Europe could be a big loser in US-China trade war, ECB warns - Reuters"
  ],
  [
    1738835183000,
    "China says it opposes Trump's Gaza takeover proposal - Reuters"
  ],
  [
    1738837072000,
    "WATCH: Can America Win the AI War with China? - The FP"
  ],
  [
    1738837160000,
    "Tungsten Miner Says Clients in Shock as China Chokes Supply - Bloomberg"
  ],
  [
    1738841640000,
    "China appoints ‘wolf warrior’ ambassador to manage affairs with Europe - Financial Times"
  ],
  [
    1738844809000,
    "AstraZeneca shares rise as China probe update reassures - Reuters"
  ],
  [
    1738847602000,
    "How Calvin Klein and Tommy Hilfiger got caught in Trump's trade war with China - CNBC"
  ],
  [
    1738849057000,
    "China Anger Over US Naval Drills: 'Illegal Claims' - Newsweek"
  ],
  [
    1738850513000,
    "China is the US’s biggest threat: Q&A with Washington Times reporter Bill Gertz - Hillsdale Collegian"
  ],
  [
    1738850936000,
    "China is infiltrating Taiwan’s armed forces - The Economist"
  ],
  [
    1738850936000,
    "Cuts in American aid are crippling groups promoting rights in China - The Economist"
  ],
  [
    1738850973000,
    "Global Cost of Renewables to Continue Falling in 2025 as China Extends Manufacturing Lead: BloombergNEF - BloombergNEF"
  ],
  [
    1738852620000,
    "U.S. lawmakers move to ban China's DeepSeek from government devices - NBC News"
  ],
  [
    1738857141000,
    "President Trump Pauses Tariffs on Mexico and Canada, but not China - Hunton Andrews Kurth LLP"
  ],
  [
    1738857720000,
    "China’s Firms Are Bleeding Cash—and Vulnerable to Trump’s Trade War - The Wall Street Journal"
  ],
  [
    1738858003000,
    "Trump, the Panama Canal and China’s Role: What We Know - The New York Times"
  ],
  [
    1738859314000,
    "Did Biden Get China Right? - Foreign Policy"
  ],
  [
    1738860145000,
    "Trump faces pressure from US industry over China tariff on medicines - Reuters"
  ],
  [
    1738860258000,
    "Shipping companies warn of delays and new charges from Trump’s China tariffs - The Verge"
  ],
  [
    1738863450000,
    "Internet-connected cameras made in China may be used to spy on US infrastructure: DHS - ABC News"
  ],
  [
    1738865580000,
    "US imposes sanctions on network that helps ship Iranian oil to China - The Associated Press"
  ],
  [
    1738867354000,
    "US slaps sanctions on network shipping Iranian oil to China - Reuters"
  ],
  [
    1738868400000,
    "News at a glance: Ebola vaccine test, asteroid watch, and China’s fusion laser lab - Science"
  ],
  [
    1738870021000,
    "Panama formally exits China’s Belt and Road Initiative as US claims ‘victory’ - South China Morning Post"
  ],
  [
    1738872117000,
    "China’s retaliatory tariffs will hurt Trump-voting counties most - Brookings Institution"
  ],
  [
    1738875560000,
    "China challenges Trump tariffs at WTO as package shippers warn of chaos - Reuters"
  ],
  [
    1738876082000,
    "China’s Long Economic Slowdown - Dissent"
  ],
  [
    1738876424000,
    "Though China might aim to fill aid void left by USAID, its own challenges could limit it - VOA Asia"
  ],
  [
    1738876842000,
    "Beyond Manufacturing: Why Services Are Key to U.S.-China Economic Competition - Center for Strategic & International Studies"
  ],
  [
    1738877397000,
    "Big companies see no China recovery soon, adding to trade tensions gloom - Reuters"
  ],
  [
    1738879302000,
    "Can India and China Turn the Corner? - Foreign Policy"
  ],
  [
    1738884855000,
    "White House monitoring China’s complaint on Trump tariffs at WTO - VOA Asia"
  ],
  [
    1738886181000,
    "Trump's tariffs on China bite US bargain-hunting online shoppers - Reuters"
  ],
  [
    1738886347000,
    "China tariffs could drive US crude exports lower in 2025 - Reuters"
  ],
  [
    1738886519000,
    "Tesla's China-made EV sales fall 11.5% y/y in January - Reuters"
  ],
  [
    1738888508000,
    "Trump tariffs hit China: See how tariffs work, which goods are impacted - USA TODAY"
  ],
  [
    1738894279000,
    "DeepSeek shows that ‘China eats the world’: Deutsche Bank - South China Morning Post"
  ],
  [
    1738894380000,
    "China's Xiaomi to explore ways to ramp up auto production, CEO says - Reuters"
  ],
  [
    1738901280000,
    "Xiaomi Hits Fresh Record High on China’s Subsidy Program Boost - Bloomberg"
  ],
  [
    1738906560000,
    "Morning Bid: China AI rally rouses trade war-weary markets - Reuters"
  ],
  [
    1738908016000,
    "China can detect US Seawolf-class submarine with magnetic wake tracking: study - South China Morning Post"
  ],
  [
    1738910100000,
    "Thailand lobbies for chip investments as Trump's trade war with China kicks off - Reuters"
  ],
  [
    1738911576000,
    "Taiwan detects airplanes, 6 balloons from China near island - DW (English)"
  ],
  [
    1738916745000,
    "DeepSeek Shock Fires Up Bullish Bets on Cheap China Tech Stocks - Bloomberg"
  ],
  [
    1738917060000,
    "Trump says China ‘operates’ the Panama Canal – how deep are Beijing’s ties to the key waterway? - CNN"
  ],
  [
    1738919632000,
    "China’s Central Bank Buys More Gold as Prices Hit Record - Bloomberg"
  ],
  [
    1738920060000,
    "China lashes out at US ‘coercion’ after Panama declines to renew infrastructure agreement - The Associated Press"
  ],
  [
    1738921662000,
    "China's January bank lending seen surging, but demand still fragile: Reuters poll - Reuters"
  ],
  [
    1738922340000,
    "Tesla China sells 63,238 cars in Jan, down 33% from Dec - CnEVPost"
  ],
  [
    1738922493000,
    "Hong Kong Gets Swept Up in Trump’s Trade War With China - Bloomberg"
  ],
  [
    1738924140000,
    "Foreign Ministry Spokesperson Lin Jian’s Regular Press Conference on February 7, 2025 - MFA China"
  ],
  [
    1738924316000,
    "L'Oreal CEO bullish on US as China sales stay weak - Reuters"
  ],
  [
    1738927210000,
    "Tesla car sales in China fall 11.5% as competition intensifies - CNBC"
  ],
  [
    1738928410000,
    "China slams US as Panama quits Belt and Road Initiative - Al Jazeera English"
  ],
  [
    1738928988000,
    "Exclusive: VW's SEAT boss warns Spanish jobs at risk if China-made EV tariff is not lowered - Reuters"
  ],
  [
    1738929609000,
    "US risks ‘losing next industrial revolution’ as China races forward, panel told - South China Morning Post"
  ],
  [
    1738930440000,
    "China’s economic miracle appears to be over, and the future is looking bleak - MarketWatch"
  ],
  [
    1738931160000,
    "China derides U.S. \"pressure and coercion\" as Panama scraps Belt and Road deal with Beijing amid canal standoff - CBS News"
  ],
  [
    1738933200000,
    "Hopping robot will hunt for moon water on China's Chang'e 7 lunar mission in 2026 - Space.com"
  ],
  [
    1738940280000,
    "Tesla sales hold OK in China amid Model Y changeover - Electrek.co"
  ],
  [
    1738943161000,
    "Republican state attorneys scrutinize US asset managers over China funds - Reuters"
  ],
  [
    1738943445000,
    "US pressure has forced Panama to quit China’s Belt and Road Initiative – it could set the pattern for further superpower clashes - The Conversation"
  ],
  [
    1738945421000,
    "Sharpie maker Newell Brands working to reduce China dependency amid tariff pressure - Reuters"
  ],
  [
    1738948440000,
    "US cedes ground to China with ‘self-inflicted wound’ of USAid shutdown, analysts say - The Guardian"
  ],
  [
    1738948560000,
    "Congressman sponsoring DeepSeek ban says China has 'tried many, many' times to infiltrate the U.S. via software. 'We're right to be vigilant' - Fortune"
  ],
  [
    1738948997000,
    "China Throws Weight Behind Panama Amid US Pressure - Newsweek"
  ],
  [
    1738949040000,
    "Trump says dismantling USAID will save money. Experts say it’s a ‘great gift’ for China - CNN"
  ],
  [
    1738949220000,
    "What do Trump’s tariffs mean for US-China trade? - The Guardian"
  ],
  [
    1738949899000,
    "Trump delays cancellation of de minimis trade exemption targeting China imports - CNBC"
  ],
  [
    1738952814000,
    "Trump pauses tariffs on small packages from China, a win for Shein and Temu - Axios"
  ],
  [
    1738953426000,
    "Here’s Where China’s Retaliatory Tariffs on the U.S. Could Hit Hardest - TIME"
  ],
  [
    1738955880000,
    "Trump says reciprocal tariffs on countries are coming soon; China duties in effect - Yahoo Finance"
  ],
  [
    1738957980000,
    "Trump Delays Crackdown on China Imports Loophole - The Wall Street Journal"
  ],
  [
    1738958880000,
    "Trump Tariffs Live Updates: Exemption For Cheaper Chinese Goods Reinstated - Forbes"
  ],
  [
    1738960516000,
    "Trump delays order eliminating trade loophole amid Chinese package whiplash - USA TODAY"
  ],
  [
    1738960835000,
    "Chinese tech giant quietly unveils advanced AI model amid battle over TikTok - ABC News"
  ],
  [
    1738961100000,
    "Trump delays key piece of China tariff plan amid threats to other countries - The Guardian US"
  ],
  [
    1738965381000,
    "More mystery seeds from China turn up in Texas, state agriculture commissioner warns - KHOU.com"
  ],
  [
    1738965621000,
    "Why 12 more South Korean FA-50 fighter jets for Manila may make China ‘insecure’ - South China Morning Post"
  ],
  [
    1738965627000,
    "Cheap China e-bikes 'kick in teeth' for UK firms - BBC.com"
  ],
  [
    1738965961000,
    "China Condemns U.S. ‘Coercion’ Over Panama Canal - Foreign Policy"
  ],
  [
    1738966738000,
    "Trump signs order delaying tariffs on de minimis imports from China - South China Morning Post"
  ],
  [
    1738966800000,
    "Trump delayed tariffs on low-cost packages from China - The Hill"
  ],
  [
    1738978209000,
    "Being Chinese | To know who we are, China must remain open to foreigners - South China Morning Post"
  ],
  [
    1738990775000,
    "Canada detects China-linked campaign targeting Freeland - DW (English)"
  ]
]