[
  [
    1732358760000,
    "Amber Glenn wins ISU GP Cup of China 2024 to surge into Grand Prix Final - Olympics"
  ],
  [
    1732363200000,
    "Amber Glenn wins Cup of China, joins exclusive U.S. figure skating club - NBC Sports"
  ],
  [
    1732363800000,
    "Google Exposes GLASSBRIDGE: A Pro-China Influence Network of Fake News Sites - The Hacker News"
  ],
  [
    1732371300000,
    "ISU Grand Prix Cup of China 2024: Full schedule, all results, scores, and standings - Complete list - Olympics"
  ],
  [
    1732374457000,
    "What happens when China puts boots on the ground in Myanmar? - Radio Free Asia"
  ],
  [
    1732384842000,
    "China looks to step into global vacuum as Trump vows to pull U.S. back - The Washington Post"
  ],
  [
    1732390221000,
    "Opinion | China’s crackdown on Hong Kong is a test for Trump - The Washington Post"
  ],
  [
    1732395744000,
    "The shocking truth behind China’s EV dominance and America’s uphill battle - Autoblog"
  ],
  [
    1732402860000,
    "National security officials meet with US telecom execs to share intel on Chinese cyber-espionage campaign, White House says - CNN"
  ],
  [
    1732403397000,
    "Admiral Warns Russia Will Help China Cut US Military Dominance: Here's How - Newsweek"
  ],
  [
    1732406400000,
    "Man Group, Abrdn Count on China Stimulus to Revive Bull Run - Bloomberg"
  ],
  [
    1732424467000,
    "China’s cash-strapped shoppers drawn to second-hand luxury items - Financial Times"
  ],
  [
    1732435208000,
    "‘Recoilless AK-47’ that can be used by most drones built by Chinese scientists - South China Morning Post"
  ],
  [
    1732435934000,
    "China to Crack Down on Unfair Algorithm-Based Internet Practices - Bloomberg"
  ],
  [
    1732443428000,
    "China's local governments step up public safety measures after attacks - Reuters"
  ],
  [
    1732443720000,
    "China Looks to Musk as Conduit to Trump, Seeking to Ward Off Harsh Policies - The Wall Street Journal"
  ],
  [
    1732454715000,
    "Fund managers at Fidelity share how they’re playing China’s stimulus plans - CNBC"
  ],
  [
    1732455720000,
    "China, EU reportedly nearing a solution over Chinese EV tariffs - Global Times"
  ],
  [
    1732470300000,
    "Beijing renews crackdown on Chinese tech companies’ use of algorithms - Semafor"
  ],
  [
    1732478640000,
    "China unnerved by Russia’s growing ties with North Korea, claims US official - The Guardian"
  ],
  [
    1732482000000,
    "China Investors Digest Another Letdown From Big Tech Earnings - Yahoo Finance"
  ],
  [
    1732483808000,
    "Opinion | Exit America, enter China? How Beijing can benefit from an isolationist US - South China Morning Post"
  ],
  [
    1732492800000,
    "Trump can do a business deal with China - China Daily"
  ],
  [
    1732492887000,
    "Huawei to launch phone with own software in sign of China-US splintering - Financial Times"
  ],
  [
    1732498740000,
    "Elon Musk Says FSD V13 'Coming Soon' As Tesla Cuts China Prices - Investor's Business Daily"
  ],
  [
    1732499400000,
    "China Keeps Policy Loan Rate Unchanged for Second Month - Bloomberg"
  ],
  [
    1732500018000,
    "Coating makes China’s stealth aircraft invisible to anti-stealth radar: study - South China Morning Post"
  ],
  [
    1732501323000,
    "China-India ties to be more resilient in the Trump 2.0 era - The Interpreter"
  ],
  [
    1732501980000,
    "Chinese startups suffer as IPO freeze prompts investors to exercise redemption rights - Reuters"
  ],
  [
    1732503480000,
    "Apple Chief Returns to China as Beijing Prepares to Fete CEOs - Bloomberg"
  ],
  [
    1732503600000,
    "Thailand, the 'Detroit of Southeast Asia', is at the forefront of China’s battle for the global auto market - Fortune"
  ],
  [
    1732503737000,
    "Taiwan reports Chinese balloon, first time in six months - Reuters"
  ],
  [
    1732503780000,
    "China’s Decades-Long Dairy Boom Is Drawing to a Close, Says S&P - Bloomberg"
  ],
  [
    1732506801000,
    "China calls for 'common disputes' to be probed following series of deadly attacks - UPI News"
  ],
  [
    1732507331000,
    "[News] Biden Reportedly to Unveil New China Export Rules This Week, Affecting 200 Chinese Chip Firms - TrendForce"
  ],
  [
    1732507864000,
    "Meituan, Chow Tai Fook Earnings to Offer Clues on China Consumer Sentiment - Yahoo Finance"
  ],
  [
    1732507920000,
    "Watch Why Elon Musk's Mother Is Popular in China - Bloomberg"
  ],
  [
    1732508760000,
    "China's central bank keeps medium-term loan rate unchanged amid yuan weakness - CNBC"
  ],
  [
    1732511040000,
    "EU, China close to minimum pricing deal for EVs, trade official says - Automotive News"
  ],
  [
    1732511322000,
    "Is China being played by North Korea and Russia? - Responsible Statecraft"
  ],
  [
    1732511400000,
    "China Box Office: ‘Her Story’ Claims Victory as ‘Gladiator II’ Opens in Fourth Place - Variety"
  ],
  [
    1732512480000,
    "How Trump’s Tariffs on China Changed U.S. Trade, in Charts - The Wall Street Journal"
  ],
  [
    1732513740000,
    "‘Kraven the Hunter’ Sets Release in Mainland China Theaters - Variety"
  ],
  [
    1732514040000,
    "Bessent at Treasury May Give China Breathing Room Over Tariffs - Bloomberg"
  ],
  [
    1732514431000,
    "Ex-Chinese gymnast Wu blasted by Olympic champion Guan for posting ‘sexy’ videos - South China Morning Post"
  ],
  [
    1732516489000,
    "China c.bank injects $124 bln into banking system via one-year policy loans - Reuters"
  ],
  [
    1732516655000,
    "Texas takes the lead in deeper decoupling from China - Asia Times"
  ],
  [
    1732517340000,
    "China issues extra crude oil import quota to independent refineries, sources say - Reuters"
  ],
  [
    1732518026000,
    "Apple’s Cook makes third trip to China in 2024 amid iPhone slump and AI uncertainty - South China Morning Post"
  ],
  [
    1732519740000,
    "China and EU are not adversaries, says Chinese foreign minister - Reuters"
  ],
  [
    1732519774000,
    "Taiwan says Chinese balloon detected near island - VOA Asia"
  ],
  [
    1732519920000,
    "China hopes Japan works towards improved people exchanges after visa-free announcement - Reuters.com"
  ],
  [
    1732521305000,
    "Taiwan reports sighting of Chinese balloon near island - Al Jazeera English"
  ],
  [
    1732523400000,
    "Will Trump’s plan to kill the EV tax credit help China? - Canary Media"
  ],
  [
    1732524463000,
    "Beyond TikTok — The National Security Risks of Chinese Agricultural Drones - War On The Rocks"
  ],
  [
    1732525200000,
    "'Be aware': House lawmakers describe what it's like living under threat by China, Iran - Fox News"
  ],
  [
    1732526845000,
    "China flies balloon close to Taiwan, Taipei says - DW (English)"
  ],
  [
    1732526942000,
    "G-7 Poised to Boost Pressure on China Over Russian Support - Bloomberg"
  ],
  [
    1732529372000,
    "Alex Wong: What Trump's New National Security Official Has Said About China - Newsweek"
  ],
  [
    1732532401000,
    "China's People Deserve the Truth—Not Censorship | Opinion - Newsweek"
  ],
  [
    1732532415000,
    "China’s GDP forecast cut as Trump trade worries take hold before new term - South China Morning Post"
  ],
  [
    1732532895000,
    "European Union launches WTO case against Chinese tariffs on brandy exports - South China Morning Post"
  ],
  [
    1732533420000,
    "Foreign Ministry Spokesperson Mao Ning’s Regular Press Conference on November 25, 2024 - MFA China"
  ],
  [
    1732535054000,
    "China launches pair of SuperView Neo-2 radar satellites - SpaceNews"
  ],
  [
    1732536060000,
    "China is increasingly unnerved by Russia and North Korea's growing alliance, says top US official - Business Insider"
  ],
  [
    1732537431000,
    "China welcomes Nvidia's continued presence, pledges better environment for foreign firms - Yahoo Finance"
  ],
  [
    1732539024000,
    "EU challenges Chinese brandy tariffs at WTO - Reuters"
  ],
  [
    1732539615000,
    "Russia’s ‘economic isolation’ seen benefiting China amid fresh US sanctions - South China Morning Post"
  ],
  [
    1732540500000,
    "China has utterly pwned 'thousands and thousands' of devices at US telcos - The Register"
  ],
  [
    1732541692000,
    "Apple’s Cook Joins CEO Summit With Chinese Premier on Trade - Bloomberg"
  ],
  [
    1732542300000,
    "China and Canada respond to Trump’s tariff threats and border comments – as it happened - The Guardian US"
  ],
  [
    1732543440000,
    "Is China Getting Ready For A Trade War? - Agweb Powered by Farm Journal"
  ],
  [
    1732544474000,
    "Is China headed for new White Paper protests? - DW (English)"
  ],
  [
    1732544984000,
    "Chinese trans woman awarded thousands over forced electroshock \"conversion therapy\" hopes for change - CBS News"
  ],
  [
    1732545345000,
    "EU not close to deal with China on EV tariffs, officials say - Reuters"
  ],
  [
    1732547863000,
    "China's White Emperor 6th Generation NGAD Fighter Summed Up in 2 Words - The National Interest Online"
  ],
  [
    1732548600000,
    "Apple’s Thin iPhone Has No Physical SIMs—That Could Dampen China Sales - The Information"
  ],
  [
    1732549448000,
    "EU To Target Chinese Firms With Asset Freezes, Visa Bans For Aiding Russia In Ukraine - Radio Free Europe / Radio Liberty"
  ],
  [
    1732551120000,
    "Trump tariff on China could lower global inflation, says UK economist - The Guardian"
  ],
  [
    1732555500000,
    "Huawei’s new smartphone marks a ‘turning point’ for US-China tech war - Semafor"
  ],
  [
    1732559695000,
    "China, the US, and Averting Nuclear Götterdämmerung - Center for European Policy Analysis"
  ],
  [
    1732559703000,
    "China Concedes to US Ally Japan Near Maritime Flashpoint - Newsweek"
  ],
  [
    1732564590000,
    "Denmark says in talks with China over ship linked to cut undersea cables - South China Morning Post"
  ],
  [
    1732566361000,
    "China’s Salt Typhoon hackers target telecom firms in Southeast Asia with new malware - The Record from Recorded Future News"
  ],
  [
    1732567598000,
    "Tariffs on China or Mexico, Not Both - American Enterprise Institute"
  ],
  [
    1732571861000,
    "News updates from November 25: Trump says he will hit China, Canada and Mexico with new tariffs, UniCredit makes €10bn offer for Italian rival Banco BPM - Financial Times"
  ],
  [
    1732574360000,
    "China could respond 'asymmetrically' to Trump tariffs: Expert - Yahoo Finance"
  ],
  [
    1732578507000,
    "Donald Trump Plans 10% Tariffs on China Goods, 25% on Mexico and Canada - Bloomberg"
  ],
  [
    1732578906000,
    "Trump Roils Markets With Tariff Threat on China, Mexico, Canada - Bloomberg"
  ],
  [
    1732579129000,
    "Trump vows new Canada, Mexico, China tariffs that threaten global trade - Reuters"
  ],
  [
    1732579140000,
    "Trump says he will impose new tariffs on Canada, Mexico and China on first day - The Hill"
  ],
  [
    1732579200000,
    "China, the U.S. & the Rise of Xi Jinping - PBS"
  ],
  [
    1732579218000,
    "US task force backs Philippine Sea operations in ‘clear signal to China’ - South China Morning Post"
  ],
  [
    1732579680000,
    "Trump vows 25% tariffs on Mexico and Canada and deeper tariffs on China - The Guardian US"
  ],
  [
    1732580285000,
    "Donald Trump Threatens Even Higher Tariffs on China, Canada and Mexico - Newsweek"
  ],
  [
    1732580310000,
    "Trump ups the ante on tariffs, vowing massive taxes on goods from Mexico, Canada and China on Day 1 - CNN"
  ],
  [
    1732580588000,
    "Trump plans new tariffs on Canada, Mexico and China - Axios"
  ],
  [
    1732581140000,
    "Trump Promises New Tariffs On China, Mexico, Canada After Taking Office - Forbes"
  ],
  [
    1732581180000,
    "Trump vows an additional 10% tariff on China, 25% tariffs on Canada and Mexico - CNBC"
  ],
  [
    1732582851000,
    "US-China Relations in the Biden-Era: A Timeline - China Briefing"
  ],
  [
    1732585097000,
    "Trump plans new tariffs on goods from China, Canada, and Mexico - NBC News"
  ],
  [
    1732585193000,
    "Trump threatens Canada, Mexico, China with tariffs - NPR"
  ],
  [
    1732586100000,
    "'No one will win a trade war,' China says after Trump tariff threat - Reuters"
  ],
  [
    1732587713000,
    "Trump vows massive tariffs on Mexico, Canada, and China on day one of his presidency - Le Monde"
  ],
  [
    1732589160000,
    "Trump threatens Mexico, China, and Canada with tariffs over immigration and drugs - The Independent"
  ],
  [
    1732590675000,
    "Trump says he'll slap tariffs on Canada, China and Mexico on Day 1 - ABC News"
  ],
  [
    1732590840000,
    "China Draws a Red Line for the Yuan as Trump Risks Return - Yahoo Finance"
  ],
  [
    1732591500000,
    "Trump Pledges Tariffs on Mexico, Canada and China - The Wall Street Journal"
  ],
  [
    1732591800000,
    "China's yuan slides to four-month low on Trump's tariff promise - Reuters"
  ],
  [
    1732596268000,
    "China is Negotiating Over Access to Bulker Suspected of Subsea Sabotage - The Maritime Executive"
  ],
  [
    1732597200000,
    "How America’s War on Chinese Tech Backfired: And Why Trump’s Plans Would Make Things Even Worse - Foreign Affairs Magazine"
  ],
  [
    1732597206000,
    "Apple hits hurdles in China with AI rollout for iPhones - Financial Times"
  ],
  [
    1732597211000,
    "China’s Police Are Preying on Small Firms in Search of Cash - The New York Times"
  ],
  [
    1732602564000,
    "Tim Cook and other U.S. executives attend China expo, meet officials as Trump tariff threat looms - CNBC"
  ],
  [
    1732604537000,
    "China Hits Back At Trump Tariff Announcement—As Asian Stocks Fall - Forbes"
  ],
  [
    1732606380000,
    "China's CATL says has no suppliers from Xinjiang region - Reuters"
  ],
  [
    1732606783000,
    "China Issues Warning to Trump Over Tariffs: 'No One Will Win' - Newsweek"
  ],
  [
    1732609380000,
    "Trump fires the first salvo in his renewed trade war with China: A 10% across-the-board tariff - Fortune"
  ],
  [
    1732609893000,
    "China sends naval, air forces to shadow US plane over Taiwan Strait - Reuters"
  ],
  [
    1732610505000,
    "US Air Force Chief's Stark Warning About War With Russia and China - Newsweek"
  ],
  [
    1732610991000,
    "China’s Huawei Takes Aim at Apple With Latest Smartphone - The New York Times"
  ],
  [
    1732613230000,
    "Myanmar rebel army ready for talks with junta, backed by China - NBC News"
  ],
  [
    1732614317000,
    "Pakistan tests secret China-like ‘firewall’ to tighten online surveillance - Al Jazeera English"
  ],
  [
    1732615751000,
    "Fentanyl Rises Again, This Time as Trump’s Diplomatic Weapon Against China - The New York Times"
  ],
  [
    1732616054000,
    "Chinese ship linked to cable sabotage urged to move into Swedish waters - Financial Times"
  ],
  [
    1732616103000,
    "After Trump’s Tariff Threat, Is a China Currency War Next? - The New York Times"
  ],
  [
    1732616760000,
    "Ex-Bank of China chairman gets suspended death sentence for bribery, state media reports - Reuters"
  ],
  [
    1732621747000,
    "Tencent to end Nintendo Switch eShop sales and services in China from 2026 - Reuters"
  ],
  [
    1732622045000,
    "Trump Threatens 25% Import Tariffs on Mexico, Canada, Additional 10% on China - Investopedia"
  ],
  [
    1732622400000,
    "Trump camp says China is ‘attacking’ U.S. with fentanyl. A fight looms - Reuters"
  ],
  [
    1732626000000,
    "China sucks up seaborne thermal coal, but domestic output caps prices - Reuters"
  ],
  [
    1732626000000,
    "China’s famously rich dinosaur fossil beds get a new origins story - Science News Magazine"
  ],
  [
    1732626211000,
    "New Report: China Cuts Pilot Training Time, Aims to Modernize by 2030 - Air & Space Forces Magazine"
  ],
  [
    1732627162000,
    "Myanmar: How far will China go to keep junta afloat? - DW (English)"
  ],
  [
    1732627877000,
    "Donald Trump says he will hit China, Canada and Mexico with new tariffs - Financial Times"
  ],
  [
    1732628126000,
    "'I don't want to do this anymore!': China's new 5,000 foot attraction terrifies tourist - CNN"
  ],
  [
    1732628220000,
    "Donald Trump Threatens Big Tariff Hikes On China, Canada, Mexico On Day One - Investor's Business Daily"
  ],
  [
    1732628331000,
    "China’s influence grows at COP29 climate talks as US leadership fades - The Conversation"
  ],
  [
    1732628680000,
    "3 Essential Vitamins Tell the Story of U.S. Dependence on China - HBR.org Daily"
  ],
  [
    1732629600000,
    "TSMC’s Push to Be Tech’s Switzerland in Doubt as U.S.-China Tensions Grow - The Information"
  ],
  [
    1732630092000,
    "U.S. Navy aircraft shadowed by Chinese warplanes as it flies over Taiwan Strait - CBS News"
  ],
  [
    1732630186000,
    "Nintendo to close Switch eShop and online services in China in 2026 - GamesIndustry.biz"
  ],
  [
    1732632120000,
    "Trump’s sharp tariff hikes could speed up China’s shift to new markets and offshore factories - The Associated Press"
  ],
  [
    1732632422000,
    "China in Latin America: November 2024 - Council on Foreign Relations"
  ],
  [
    1732634550000,
    "'Counter to facts and reality': China, Mexico, Canada respond to Trump tariff threats - USA TODAY"
  ],
  [
    1732636735000,
    "Trump pledges Mexico, Canada, China tariffs over border, fentanyl - NewsNation Now"
  ],
  [
    1732638600000,
    "What are Trump’s plans for tariffs on China, Canada and Mexico? - Al Jazeera English"
  ],
  [
    1732638924000,
    "China Scrambles Jets Against US Military Plane - Newsweek"
  ],
  [
    1732639760000,
    "As Trump Vows Larger China Tariffs, How Did His Trade War Play Out the First Time Around? - PBS"
  ],
  [
    1732645496000,
    "Trump threatens to impose sweeping new tariffs on Mexico, Canada and China on first day in office - CBS News"
  ],
  [
    1732646788000,
    "Violent attacks in China fuel concerns some are ‘taking revenge’ on society - The Washington Post"
  ],
  [
    1732647180000,
    "Is the China-US fentanyl pipeline really responsible for the US opioid crisis? - The Guardian"
  ],
  [
    1732648865000,
    "China's been trying to 'Trump-proof' its economy amid his tariff threats, experts say - ABC News"
  ],
  [
    1732650900000,
    "Opinion | The U.S. Is Losing the Ability to Deter War With China - The Wall Street Journal"
  ],
  [
    1732651955000,
    "The Turning Point? U.S.-China Relations, Economic Growth, and the Race for Technology Leadership - Center for Strategic & International Studies"
  ],
  [
    1732653016000,
    "Opinion | Trump can’t bully the world out of doing business with China - The Washington Post"
  ],
  [
    1732653930000,
    "China warns NZ against joining AUKUS amid security concerns -report - Reuters.com"
  ],
  [
    1732656480000,
    "What Trump’s Tariffs Will Mean for China - Foreign Policy"
  ],
  [
    1732658400000,
    "Chinese Carmakers Are Trouncing Once-Unbeatable Japanese Rivals - Bloomberg"
  ],
  [
    1732661340000,
    "The True Impact of Allied Export Controls on the U.S. and Chinese Semiconductor Manufacturing Equipment Industries - Center for Strategic & International Studies"
  ],
  [
    1732665697000,
    "Five things the market got wrong about China’s stimulus package - Financial Times"
  ],
  [
    1732667283000,
    "China state media warn Trump against mutually destructive tariff war - Reuters"
  ],
  [
    1732668960000,
    "US' largest trade partners Mexico, Canada and China respond to Trump's tariff threat - The Times of India"
  ],
  [
    1732670759000,
    "Pakistan and China’s diplomatic relations reach a low ebb - The Interpreter"
  ],
  [
    1732671840000,
    "China's industrial profits fall by 10% in October as deflation worries linger - CNBC"
  ],
  [
    1732672503000,
    "Exclusive: In careful protest, China Evergrande's investors press for action - Reuters.com"
  ],
  [
    1732674401000,
    "China’s emissions peak in sight as solar and electric cars boom - Financial Times"
  ],
  [
    1732675980000,
    "China’s hottest new tourist attraction is 5,000 feet in the air - CNN"
  ],
  [
    1732676828000,
    "Canada, Mexico and China respond to Trump tariff threats - BBC.com"
  ],
  [
    1732678140000,
    "China’s bid to join major trade bloc kicked into the long grass - POLITICO Europe"
  ],
  [
    1732680600000,
    "China’s Battling Solar Exporters Aim to End ‘Unfair’ Competition - Bloomberg"
  ],
  [
    1732683634000,
    "China investigates defense minister for corruption — report - DW (English)"
  ],
  [
    1732683677000,
    "China’s market targets are ‘just psychological’, says former regulator - Financial Times"
  ],
  [
    1732684020000,
    "China Is Bombarding Tech Talent With Job Offers. The West Is Freaking Out. - The Wall Street Journal"
  ],
  [
    1732684860000,
    "Leaked BYD Letter Signals China EV Price War Is Set to Intensify - Bloomberg"
  ],
  [
    1732685850000,
    "China’s defence minister placed under investigation for corruption - Financial Times"
  ],
  [
    1732688073000,
    "China Oct industrial profits narrow decline, but headwinds loom - Reuters"
  ],
  [
    1732690273000,
    "China launches corruption probe against Defence Minister Dong Jun: Report - Al Jazeera English"
  ],
  [
    1732690500000,
    "A moment that changed me: at seven, I saw the truth of China’s one-child policy – and felt my parents’ pain - The Guardian"
  ],
  [
    1732692420000,
    "China calls report that Defence Minister Dong Jun is under probe 'shadow-chasing' - Reuters.com"
  ],
  [
    1732693980000,
    "Sweden urges Chinese ship to return for undersea cable investigation - Reuters"
  ],
  [
    1732694635000,
    "China Defense Minister Investigated for Corruption, FT Says - Bloomberg"
  ],
  [
    1732695687000,
    "Volkswagen to Exit China’s Xinjiang Region After 12 Years - The New York Times"
  ],
  [
    1732696087000,
    "Foreign smartphone sales in China drop 44.25% y/y in Oct, data shows - Reuters"
  ],
  [
    1732697368000,
    "BYD asks suppliers to cut prices as China auto war intensifies - Yahoo Finance"
  ],
  [
    1732699058000,
    "Trump’s Trade Chief Advocates ‘Strategic Decoupling’ From China - Bloomberg"
  ],
  [
    1732701720000,
    "China’s CO2 emissions have peaked or will in 2025, say 44% of experts in survey - The Guardian"
  ],
  [
    1732702957000,
    "BYD and Rivals in China Tell Suppliers to Cut Costs Amid Price War - The New York Times"
  ],
  [
    1732704421000,
    "It’s not us, it’s you: China’s surging overcapacities and distortive exports are pressuring many developing countries too - Mercator Institute for China Studies (MERICS)"
  ],
  [
    1732707238000,
    "China Responds to Possible EU Sanctions Over Russia War Drones - Newsweek"
  ],
  [
    1732707717000,
    "Germany issues more investment guarantees for business in China - Reuters"
  ],
  [
    1732709813000,
    "'Supergiant' gold deposit discovered in China is one of the largest on Earth — and is worth more than $80 billion - Livescience.com"
  ],
  [
    1732710785000,
    "China could launch military drills near Taiwan over president's Pacific visit, sources say - Reuters"
  ],
  [
    1732716720000,
    "China releases 3 'wrongfully detained' Americans, White House says - Fox News"
  ],
  [
    1732717227000,
    "Three Americans Held for Years in China Released - Newsweek"
  ],
  [
    1732718340000,
    "Volkswagen sells its car plant in Xinjiang, citing ‘economic reasons’ - CNN"
  ],
  [
    1732718760000,
    "Exclusive | Chinese Ship’s Crew Suspected of Deliberately Dragging Anchor for 100 Miles to Cut Baltic Cables - The Wall Street Journal"
  ],
  [
    1732718917000,
    "3 Americans held for years in China, Mark Swidan, Kai Li and John Leung, have been released, White House says - ABC7 Los Angeles"
  ],
  [
    1732720348000,
    "3 Americans released by China - VOA Asia"
  ],
  [
    1732720980000,
    "China releases three US citizens held for years in prisoner swap - The Guardian US"
  ],
  [
    1732721827000,
    "Volkswagen to exit China's Xinjiang, sell factory - DW (English)"
  ],
  [
    1732721844000,
    "US exchanges Chinese detainees for 3 imprisoned Americans - POLITICO"
  ],
  [
    1732723449000,
    "US brokers release of three Americans it says were wrongly detained in China - USA TODAY"
  ],
  [
    1732724829000,
    "Houstonian Mark Swidan to be released from Chinese imprisonment - The Texas Tribune"
  ],
  [
    1732725049000,
    "China releases three US citizens in final days of Biden term: White House - Al Jazeera English"
  ],
  [
    1732726120000,
    "China's cut to coal power share is a rare but key climate win - Reuters"
  ],
  [
    1732726188000,
    "China off track on emissions goals as energy demand offsets renewables push, researchers say - Reuters"
  ],
  [
    1732726963000,
    "China Has a New Playbook to Counter Trump: ‘Supply Chain Warfare’ - The New York Times"
  ],
  [
    1732730040000,
    "Three Americans wrongfully detained in China released in prisoner swap - The Washington Post"
  ],
  [
    1732730340000,
    "Three Americans freed in prisoner swap with China - Axios"
  ],
  [
    1732730682000,
    "How Trump’s Tariffs Could Impact Top Imports From Mexico, Canada, and China - TIME"
  ],
  [
    1732732320000,
    "Trump's proposed tariffs on Mexico, Canada, China will increase inflation, Goldman Sachs warns - Fox Business"
  ],
  [
    1732732447000,
    "China has freed 3 Americans following an apparent prisoner swap deal with the U.S. - NPR"
  ],
  [
    1732734662000,
    "State Dept. downgrades China travel warning after prisoner swap - POLITICO"
  ],
  [
    1732735125000,
    "Three Americans detained by China are released - MSNBC"
  ],
  [
    1732741260000,
    "What are tariffs and why is Trump levying them on Canada, Mexico and China? - The Guardian US"
  ],
  [
    1732741651000,
    "Houstonian Mark Swidan among 3 Americans released from China as part of agreement with U.S. - ABC13 Houston"
  ],
  [
    1732741800000,
    "Nvidia Slips Again On Post-Earnings Blues, New China Trade War - Investor's Business Daily"
  ],
  [
    1732742700000,
    "China Releases Three American Prisoners in Swap With U.S. - The Wall Street Journal"
  ],
  [
    1732747260000,
    "3 Americans held for years in China have been released, White House says - WESH 2 Orlando"
  ],
  [
    1732747809000,
    "US to Introduce New Restrictions on China’s Access to Cutting-Edge Chips - WIRED"
  ],
  [
    1732748429000,
    "Buying Into China Stimulus Is ‘Painful Trade,’ Lombard Odier Says - Bloomberg"
  ],
  [
    1732750440000,
    "US secures release of 3 Americans in prisoner swap with China - CNN"
  ],
  [
    1732753696000,
    "Convicted ex-Chicago Illinois Institute of Technology college student Chaoqun Ji part of U.S.-China spy swap - ABC7 Chicago"
  ],
  [
    1732755600000,
    "Why Is China Purging Some of Its Most Senior Military Leaders? - Bloomberg"
  ],
  [
    1732755900000,
    "China’s EV Boom Threatens to Push Gasoline Demand Off a Cliff - Bloomberg"
  ],
  [
    1732756350000,
    "E.U. Vessels Surround Anchored Chinese Ship After Baltic Sea Cables Are Severed - The New York Times"
  ],
  [
    1732756533000,
    "Kylie Jenner’s vodka seltzer deal signals China VC investor’s global push - Financial Times"
  ],
  [
    1732757991000,
    "Plane carrying Americans wrongfully jailed in China lands on US soil - ABC News"
  ],
  [
    1732759659000,
    "New missile plan by US-Japan eyes Chinese invasion of Taiwan - VOA Asia"
  ],
  [
    1732765986000,
    "Understanding Indonesia's Gambit With China in the South China Sea - The Maritime Executive"
  ],
  [
    1732768440000,
    "China to test new-gen Beidou network rivalling GPS in 2027 - Reuters"
  ],
  [
    1732771575000,
    "3 Americans Are Said to Be Freed From China in Prisoner Swap - The New York Times"
  ],
  [
    1732773602000,
    "Opinion | Is Communist China Coming for Your Turkey, Too? - The New York Times"
  ],
  [
    1732775639000,
    "Chinese companies apologise for 'shrunken' sanitary pads - BBC.com"
  ],
  [
    1732777200000,
    "Has China Become the New Japan and Japan the New China? - Barron's"
  ],
  [
    1732779480000,
    "Nornickel sees new technologies sustaining China's palladium demand - Reuters"
  ],
  [
    1732779866000,
    "China tells ICC to be 'just and fair' after it sought warrant for Myanmar junta chief - Reuters.com"
  ],
  [
    1732782071000,
    "Shares of key chip suppliers jump as U.S. reportedly considers toned-down China curbs - CNBC"
  ],
  [
    1732782432000,
    "Is China holding back fire to deal with Trump tariffs? - DW (English)"
  ],
  [
    1732782473000,
    "Shares in ASML and peers climb amid hopes for less severe US curbs on China chips - Yahoo Finance"
  ],
  [
    1732782480000,
    "China’s EV price war is so brutal that BYD is trying to pinch its suppliers - CNN"
  ],
  [
    1732782507000,
    "China to launch next-generation Beidou satellites in 2027 - SpaceNews"
  ],
  [
    1732783050000,
    "China releases 3 Americans it imprisoned for years; Beijing says US returned 4 people to China - WISN Milwaukee"
  ],
  [
    1732783846000,
    "Three Americans released in US-China prisoner exchange - BBC.com"
  ],
  [
    1732784386000,
    "China Defence Minister Dong Jun’s fate unclear as corruption probe sparks differing account - Reuters"
  ],
  [
    1732784648000,
    "China’s Property Slump May Extend Into 2025, Fitch Says - Bloomberg"
  ],
  [
    1732786042000,
    "US Preps China Chip Curbs That Stop Short of Early Proposals - Bloomberg"
  ],
  [
    1732786200000,
    "Tech war: new US chip sanctions to deal fresh blow to China's self-reliance push - Yahoo Finance"
  ],
  [
    1732786425000,
    "Taiwan conducts air drill amid China pressure - DW (English)"
  ],
  [
    1732787879000,
    "China says top military official suspended, placed under investigation - Al Jazeera English"
  ],
  [
    1732788040000,
    "Tariffs may be just the start of U.S.-China disputes in a second Trump term - NBC News"
  ],
  [
    1732788456000,
    "A Top Chinese Commander Is Suspended Under Suspicion of Corruption - The New York Times"
  ],
  [
    1732788957000,
    "China warns of 'necessary actions' if US escalates chip curbs - Reuters"
  ],
  [
    1732789167000,
    "AstraZeneca's Enhertu breast cancer drug added to China's state insurance list - Reuters"
  ],
  [
    1732789800000,
    "Oil, Raspberries, Smartphones: What the U.S. Imports From Canada, Mexico and China - The Wall Street Journal"
  ],
  [
    1732789947000,
    "Is China better prepared for another trade row with the US? - Al Jazeera English"
  ],
  [
    1732790007000,
    "‘A Lack of Respect’: Chinese Women Mobilize Against Subpar Sanitary Pads - The New York Times"
  ],
  [
    1732790587000,
    "China: X must immediately end shadow ban of prominent human rights account - ARTICLE 19"
  ],
  [
    1732791023000,
    "Top Chinese military official under investigation, ministry says - NBC News"
  ],
  [
    1732791153000,
    "U.S. eases China travel advisory after 3 detained Americans are released - NBC News"
  ],
  [
    1732791626000,
    "Satellite Photos Capture Chinese Ship Swarm Near US Ally's Territory - Newsweek"
  ],
  [
    1732793340000,
    "China’s EV boom signals demise of gasoline - Automotive News"
  ],
  [
    1732794363000,
    "Exclusive: Chinese ships gather near island disputed with Philippines, satellite images show - Reuters"
  ],
  [
    1732795211000,
    "Xi Jinping Doesn’t Have an Answer for China’s Demographic Crisis - Foreign Policy"
  ],
  [
    1732796764000,
    "China and Pakistan talk security as they target terrorism against belt and road - South China Morning Post"
  ],
  [
    1732797011000,
    "Opinion | Trump’s tariff obsession is no match for China’s growth model - South China Morning Post"
  ],
  [
    1732797900000,
    "China and Trump's tariffs: Beijing tries to unleash economy - DW (English)"
  ],
  [
    1732798842000,
    "Ahead of Taiwan president's Hawaii trip, China says it will defeat secessionism - Reuters"
  ],
  [
    1732802011000,
    "China suffers eruptions from its simmering discontents - The Economist"
  ],
  [
    1732802011000,
    "China’s government is badgering women to have babies - The Economist"
  ],
  [
    1732804553000,
    "France, Germany, Sweden urge EU battery sector push to avoid China reliance - Reuters.com"
  ],
  [
    1732808987000,
    "China hails US release of citizen convicted over child pornography - Financial Times"
  ],
  [
    1732810440000,
    "Sweden asks for China's cooperation over Baltic Sea cables cut while a Chinese ship was nearby - The Associated Press"
  ],
  [
    1732811220000,
    "Sweden seeks clarity from China about suspected sabotage of undersea cables - The Guardian"
  ],
  [
    1732811510000,
    "Renault Goes on China Hiring Spree to Bolster EV Push at Home - Bloomberg"
  ],
  [
    1732812205000,
    "Sweden asks China to co-operate with severed cable investigation - BBC.com"
  ],
  [
    1732813021000,
    "China criticises Trump tariff threat, says it won't solve America's problems - Reuters"
  ],
  [
    1732813880000,
    "Dragons In Detroit? China’s Secret To Automotive Success - Forbes"
  ],
  [
    1732814040000,
    "Carrier USS Abraham Lincoln Now in the South China Sea, Russian Surface Action Group Also Underway - USNI News"
  ],
  [
    1732815389000,
    "China Issues New Missile Warning to US and Philippines - Newsweek"
  ],
  [
    1732815633000,
    "US, China swap detained citizens after years of diplomacy - Reuters"
  ],
  [
    1732820514000,
    "China announces top military official is under investigation - The Washington Post"
  ],
  [
    1732829194000,
    "High-Ranking Military Official in China Placed Under Investigation, Defense Ministry Says - Military.com"
  ],
  [
    1732834583000,
    "Macquarie Seeks Japan, India Fund Bets as China Appetite Cools - Bloomberg"
  ],
  [
    1732835056000,
    "China–India pact a borderline solution - East Asia Forum"
  ],
  [
    1732835091000,
    "China plans to restrict exports of a critical metal. But the market isn't that worried - CNBC"
  ],
  [
    1732839060000,
    "3 Americans detained in China released in prisoner swap and back in U.S. - NBC News"
  ],
  [
    1732839780000,
    "China Probes Senior Military Official for ‘Serious Violations’ - Bloomberg"
  ],
  [
    1732841040000,
    "Drawing lines in the South China Sea: what Beijing’s new claims over a disputed coral reef mean - The Conversation"
  ],
  [
    1732844280000,
    "China's Nov manufacturing activity seen expanding for second month: Reuters poll - Reuters"
  ],
  [
    1732846920000,
    "China investigates a top military official as Xi broadens purge of PLA generals - CNN International"
  ],
  [
    1732847412000,
    "World's Largest Gold Deposit Found In China, Valued At A Staggering Rs 7 Lakh Crore - NDTV"
  ],
  [
    1732848420000,
    "China's home prices set to stabilise by 2026 after slower falls: Reuters poll - Reuters"
  ],
  [
    1732849020000,
    "Chinese court to announce verdict in veteran journalist spy case-media group - Reuters"
  ],
  [
    1732852427000,
    "China to extend tariff exemptions for some US products to 2025 - Reuters"
  ],
  [
    1732852680000,
    "With Tariff Threat, Trump Reminds China of His Ability to Shock - Bloomberg"
  ],
  [
    1732854900000,
    "China court sentences journalist to seven years on spy charges, family says - CNN"
  ],
  [
    1732854960000,
    "Did China just blink in the South China Sea? - Asia Times"
  ],
  [
    1732855440000,
    "China Resumes Multiple-Entry Visas for Shenzhen to Hong Kong - Bloomberg"
  ],
  [
    1732855950000,
    "China probes top officer discipline ‘violations’ - Financial Times"
  ],
  [
    1732856400000,
    "The Trump Administration’s China Challenge - Foreign Affairs Magazine"
  ],
  [
    1732856443000,
    "South Korea scrambles jets as China, Russia warplanes fly over Sea of Japan - South China Morning Post"
  ],
  [
    1732856464000,
    "Elon Musk: the ‘wild card’ in Trump’s dealings with China - Financial Times"
  ],
  [
    1732856520000,
    "China’s Local Governments Hold Back Wages in Desperate Scrape for Cash - The Wall Street Journal"
  ],
  [
    1732857120000,
    "Stimulus Bets Drive Chinese Stocks Higher Before Key Meeting - Bloomberg"
  ],
  [
    1732857849000,
    "China Journalist, Dong Yuyu, Is Sentenced to Prison for Espionage - The New York Times"
  ],
  [
    1732858260000,
    "U.S. Citizen Sentenced for Spying on Behalf of China's Intelligence Agency - The Hacker News"
  ],
  [
    1732859085000,
    "South China Sea: US alliances mar peace and stability, China envoy tells Asean - South China Morning Post"
  ],
  [
    1732859389000,
    "China sentences veteran journalist on espionage charges - NPR"
  ],
  [
    1732859640000,
    "China’s aging population fuels ‘silver economy’ boom, but profits can prove elusive - The Associated Press"
  ],
  [
    1732859640000,
    "Chinese, Russian military planes enter South Korea's air defence zone, Seoul says - Reuters"
  ],
  [
    1732859700000,
    "Taiwan’s president set to visit Hawaii and Guam, drawing Beijing’s ire - CNN"
  ],
  [
    1732860820000,
    "How China Became the World’s Largest Car Exporter - The New York Times"
  ],
  [
    1732862619000,
    "China sentences former journalist to seven years for espionage - BBC.com"
  ],
  [
    1732863197000,
    "EU and China advance towards alternative solution for EV tariffs - Euronews"
  ],
  [
    1732863720000,
    "Exclusive: HSBC pulling back from China credit card business after struggling to expand - Reuters"
  ],
  [
    1732867200000,
    "China - The Guardian"
  ],
  [
    1732868670000,
    "Chinese bond market grapples with ‘Japanification’ - Financial Times"
  ],
  [
    1732870959000,
    "China jails journalist for seven years on espionage charges - Al Jazeera English"
  ],
  [
    1732871287000,
    "China, Russia militaries conduct joint air patrol over Sea of Japan - Reuters"
  ],
  [
    1732872600000,
    "Jack Ma returns to Alibaba campus, as China moves to boost business confidence - Yahoo Finance"
  ],
  [
    1732872638000,
    "US Defies China to Greenlight Taiwan President's Pacific Stopovers - Newsweek"
  ],
  [
    1732873440000,
    "China criticizes Taiwanese president's plan to stop in Hawaii and Guam during trip to South Pacific - The Associated Press"
  ],
  [
    1732873973000,
    "Inside the AI back-channel between China and the West - The Economist"
  ],
  [
    1732874422000,
    "U.S. Zoos Gave a Fortune to Protect Pandas. That’s Not How China Spent It. - The New York Times"
  ],
  [
    1732874422000,
    "Millions of Dollars to Protect Pandas Was Spent by China on Roads and Buildings - The New York Times"
  ],
  [
    1732874506000,
    "Russia and China stage nuclear bomber exercise near US allies - Newsweek"
  ],
  [
    1732877019000,
    "China backing wrong side in Myanmar’s civil war - Asia Times"
  ],
  [
    1732877448000,
    "Chinese-born buyer of US$6.2 million banana art eats it in Hong Kong - South China Morning Post"
  ],
  [
    1732877799000,
    "China says ready to 'work with' Baltic Sea cut cables probe - DW (English)"
  ],
  [
    1732877901000,
    "Uniqlo criticised in China after BBC report of CEO's Xinjiang comments - Reuters"
  ],
  [
    1732879647000,
    "What Does The U.S. Import From Mexico, Canada And China? - Forbes"
  ],
  [
    1732880688000,
    "China completes 3,000-km green belt around its biggest desert, state media says - Reuters"
  ],
  [
    1732881300000,
    "How China can hit back at Trump: Target U.S. firms, turn to India, Africa - Fortune"
  ],
  [
    1732881600000,
    "Why China is probably on board with Putin’s nuclear threats - The Hill"
  ],
  [
    1732882003000,
    "It started with Elon. Now there’s another celebrity Musk in China: His mother. - NBC News"
  ],
  [
    1732882323000,
    "Fighter jets scrambled as 11 Russian and Chinese warplanes fly through South Korea's air defense zone - CBS News"
  ],
  [
    1732883015000,
    "China Says It's Found A \"Superlarge\" Gold Deposit Worth An Estimated $83 Billion - IFLScience"
  ],
  [
    1732886015000,
    "Uniqlo faces online China backlash over Xinjiang cotton comments - BBC.com"
  ],
  [
    1732887009000,
    "As rouble plummets, how will Chinese merchants get money out of Russia? - South China Morning Post"
  ],
  [
    1732891625000,
    "China Warns of Nuclear War Risk in Ukraine - Newsweek"
  ],
  [
    1732897844000,
    "Mercedes to use Momenta software in 4 models, accelerate China comeback, sources say - Reuters"
  ],
  [
    1732899260000,
    "Lithuania expels three Chinese diplomats - Reuters"
  ],
  [
    1732902943000,
    "World's Largest Gold Deposit Worth $80 Billion Discovered in China: Reports - Newsweek"
  ],
  [
    1732903946000,
    "Chinese tech workers expecting to attend US CES trade show report visa problems - South China Morning Post"
  ],
  [
    1732905038000,
    "What is the West's response to China's role in Myanmar war? - DW (English)"
  ],
  [
    1732905179000,
    "China slams Taiwanese president’s plan to stop in Hawaii and Guam - Fox News"
  ],
  [
    1732905442000,
    "China warns U.S. ahead of Taiwan president’s Hawaii visit - Honolulu Star-Advertiser"
  ],
  [
    1732912255000,
    "Canada says North American free trade partners should be fully aligned on China - Reuters"
  ],
  [
    1732915800000,
    "Trump has assembled a team of China hawks. How will Beijing respond? - CNN"
  ],
  [
    1732917601000,
    "China’s Lone-Wolf Attacks Pose Challenge for Xi’s Security State - Bloomberg"
  ],
  [
    1732917612000,
    "Stimulus perplexity: why Beijing, foreign investors can’t see eye to eye - South China Morning Post"
  ],
  [
    1732918756000,
    "China urges utmost caution by US ahead of Taiwan president's Hawaii trip - Reuters"
  ],
  [
    1732925706000,
    "Reflections | China’s Great Wall, and the Malaysian state that wants its own - South China Morning Post"
  ],
  [
    1732930073000,
    "Who were the prisoners in US-China swap? - VOA Asia"
  ],
  [
    1732932000000,
    "The Whiz Kid Who Made Billions for Yale Is Rethinking His China Strategy - The Wall Street Journal"
  ],
  [
    1732932014000,
    "Decentralised kingdom: bitcoin’s Trump bump and how China lost its crypto crown - South China Morning Post"
  ],
  [
    1732936260000,
    "Joint Russian, Chinese Pacific Bomber Flight Prompts Japan and South Korea to Scramble Fighters - USNI News"
  ],
  [
    1732938120000,
    "China’s Factory Activity Expands in Sign of Slow Recovery - Bloomberg"
  ],
  [
    1732939080000,
    "China sentences journalist detained at meal with Japanese diplomat to 7 years for espionage - The Associated Press"
  ],
  [
    1732942461000,
    "China’s manufacturing sector expands in November, reflecting impact of stimulus - South China Morning Post"
  ],
  [
    1732942860000,
    "After U.S.-China Prisoner Swap, Scores of Americans Are Still Trapped in China - The Wall Street Journal"
  ],
  [
    1732944960000,
    "China finds world’s largest gold deposit worth over £63 billion - The Independent"
  ],
  [
    1732946418000,
    "Chinese power group planning to build green energy island - South China Morning Post"
  ],
  [
    1732953601000,
    "Nuclear Bomb Map Shows Impact of US Weapons on North Korea, Russia, China - Newsweek"
  ],
  [
    1732954980000,
    "Uniqlo faces calls for boycott in China after CEO’s Xinjiang cotton comment - The Independent"
  ],
  [
    1732957212000,
    "Chinese drone prepped for mass production as demand for aerial deliveries soars - South China Morning Post"
  ],
  [
    1732957544000,
    "Taiwan’s President Visits Pacific Islands to Counter China’s Influence - The New York Times"
  ],
  [
    1732960812000,
    "China announces plan to cut food waste at the production, transport and storage end - South China Morning Post"
  ],
  [
    1732962987000,
    "China resumes visa-free scheme for short-term Japan visitors - Kyodo News Plus"
  ],
  [
    1732963920000,
    "China-Russia joint air strategic patrol ‘at their doorsteps’ completely normal: expert - Global Times"
  ],
  [
    1732964408000,
    "Chinese scientists keep monkey alive for 6 months with gene-edited pig’s kidney - South China Morning Post"
  ],
  [
    1732964452000,
    "China Home Sales Drop Again as Sustained Stimulus Effect Missing - Bloomberg"
  ],
  [
    1732966229000,
    "Biden admin debates on additional China chip curbs, Bloomberg says - Yahoo Finance"
  ],
  [
    1732968709000,
    "Taiwan's Lai provokes China's ire with planned US visit - DW (English)"
  ],
  [
    1732972770000,
    "Russian Ruble Plunge Hurting Chinese Companies: Report - Newsweek"
  ],
  [
    1732973583000,
    "After PLA, Chinese coastguard patrols disputed Scarborough Shoal - South China Morning Post"
  ],
  [
    1732974635000,
    "Minnesota families in limbo as China halts foreign adoptions - Star Tribune"
  ],
  [
    1732978323000,
    "Taiwan president's Hawaii trip draws Chinese anger - BBC.com"
  ],
  [
    1732978640000,
    "Russian and Chinese bombers conduct joint air patrol - Reuters"
  ],
  [
    1732981713000,
    "China launches first Long March 12 from new commercial spaceport in boost for country's lunar plans - SpaceNews"
  ],
  [
    1732989020000,
    "Is China striding past Europe, America and Japan on nuclear fusion? - EURACTIV"
  ],
  [
    1732995530000,
    "Trump threatens Brics countries with huge tariff if they undercut US dollar - South China Morning Post"
  ],
  [
    1732997836000,
    "U.S. Condemns China’s Harsh Sentence for a Prominent Journalist - The New York Times"
  ],
  [
    1732998240000,
    "Taiwan’s President Begins Hawaii Stopover Despite China’s Protests - The Wall Street Journal"
  ],
  [
    1733002548000,
    "Donald Trump Sends New Warning to China-Led Bloc Over US Dollar - Newsweek"
  ],
  [
    1733004000000,
    "Gazprom Bets on China, Cuts 2025 Investments by 7% - OilPrice.com"
  ],
  [
    1733005020000,
    "China claims to have unearthed the largest gold deposit in the world —worth $83B - New York Post"
  ],
  [
    1733012924000,
    "China new home price rises accelerate in November, survey finds - Reuters"
  ],
  [
    1733013970000,
    "Philippines-China Legal Warfare Escalates At Scarborough Shoal - Forbes"
  ],
  [
    1733014811000,
    "China’s digital yuan roared out of the gate, but stumbling blocks have popped up - South China Morning Post"
  ],
  [
    1733015104000,
    "China sharpens trade war tools ahead of Trump’s arrival - Asia Times"
  ],
  [
    1733018413000,
    "China’s 1,000km/h ‘hyperloop’ trains will support 5G: study - South China Morning Post"
  ],
  [
    1733018949000,
    "\"Go Find Another Sucker\": Trump's Big Warning For India, China, Russia - NDTV"
  ],
  [
    1733022012000,
    "China property market faces long recovery road despite debt-plan progress - South China Morning Post"
  ],
  [
    1733025360000,
    "China Carries Out Maiden Rocket Launch From Commercial Site - Bloomberg"
  ],
  [
    1733025613000,
    "China looks beyond Confucius in latest move to win narrative war with West - South China Morning Post"
  ],
  [
    1733026560000,
    "China vows strong, resolute countermeasures following US approval of $385 million arms sales to Taiwan region - Global Times"
  ],
  [
    1733028127000,
    "China 'strongly condemns' US for Taiwan President's Hawaii visit - Le Monde"
  ],
  [
    1733029260000,
    "Exclusive | China Is Studying Russia’s Sanctions Evasion to Prepare for Taiwan Conflict - The Wall Street Journal"
  ],
  [
    1733029380000,
    "How a Young Chinese Nationalist Turned Her Back on Beijing - The Wall Street Journal"
  ],
  [
    1733029380000,
    "Biden’s long-awaited Africa trip to tout a win against China - Reuters"
  ],
  [
    1733030700000,
    "Taiwan president stops in Hawaii during Pacific tour, drawing ire from China - The Guardian"
  ],
  [
    1733032945000,
    "China seeks to boost energy ties with Turkmenistan - South China Morning Post"
  ],
  [
    1733035680000,
    "China sentences journalist for espionage after he was detained while eating with Japanese diplomat - Fox News"
  ],
  [
    1733039880000,
    "China Condemns US Over Hawaii Transit by Taiwan President Lai - Bloomberg"
  ],
  [
    1733040014000,
    "Chinese county grapples with how to reward workers for difficult, low-level jobs - South China Morning Post"
  ],
  [
    1733040059000,
    "The 'Chinese Exclusion Era' shows how Trump's mass deportation plan could unfold - NPR"
  ],
  [
    1733045114000,
    "Maharaja China box office: Vijay Sethupathi, Anurag Kashyap film clocks ₹19.30 crore in just 2 days - Hindustan Times"
  ],
  [
    1733045480000,
    "Biden to spotlight Angola’s Lobito Corridor, his legacy to counter China in Africa - VOA Asia"
  ],
  [
    1733045561000,
    "China blasts US arms sale to Taiwan, President Lai’s U.S. transit - NBC News"
  ],
  [
    1733047318000,
    "Beijing vows ‘resolute’ response as US approves US$385 million in arms to Taiwan - South China Morning Post"
  ],
  [
    1733050217000,
    "Submarine detection at near-light-speed possible with China’s sci-fi-like radar - Yahoo! Voices"
  ],
  [
    1733050680000,
    "On Brief Stop in U.S., Taiwan President Sends Signal to Both China and Trump - The Wall Street Journal"
  ],
  [
    1733050856000,
    "China tourism figures ‘nudge pre-Covid levels’ as visa-free access expands - South China Morning Post"
  ],
  [
    1733051379000,
    "China launches new Long March 12 rocket, carrying broadband ‘test satellites’ - South China Morning Post"
  ],
  [
    1733054408000,
    "Dinosaurs grew stupid over time – and the same could happen to humans: study - South China Morning Post"
  ],
  [
    1733054413000,
    "Explainer | How do China’s visa-free entry schemes for tourists work? - South China Morning Post"
  ],
  [
    1733056614000,
    "Micron Technology, Inc. (MU): Navigating U.S.-China Semiconductor Restrictions Amid AI Growth - Yahoo Finance"
  ],
  [
    1733056740000,
    "Chinese consumers are on a health kick — and Lululemon is reaping the rewards - Business Insider"
  ],
  [
    1733058204000,
    "China vows ‘resolute and forceful’ response as Taiwan leader visits Hawaii - The Japan Times"
  ],
  [
    1733059320000,
    "Biden fulfilling promise to visit Africa as US looks to counter China’s deepening influence in region - CNN"
  ],
  [
    1733060486000,
    "America Must Get Its Mind Right to Defeat China - The National Interest Online"
  ],
  [
    1733060814000,
    "Women's Pro League Hockey: England lose to China in opener - BBC.com"
  ],
  [
    1733061608000,
    "What Biden’s visit to Angola says about Africa’s role in US-China rivalry - South China Morning Post"
  ],
  [
    1733062500000,
    "China promises 'countermeasures' to US arms sale to Taiwan - Fox News"
  ],
  [
    1733063460000,
    "Feminist hit movie Her Story touted as China’s answer to Barbie - The Guardian"
  ],
  [
    1733067106000,
    "Germany’s Top Diplomat Bashes China’s Weapon Supplies to Russia - Bloomberg"
  ],
  [
    1733068800000,
    "China Discovers World's Largest Gold Deposit Near Existing Mines - OilPrice.com"
  ],
  [
    1733068980000,
    "Trump Threatens Putin’s Russia And Xi’s China With ‘100% Tariffs’ - The Daily Beast"
  ],
  [
    1733069659000,
    "China’s Ties With Israel Are Hindering the Palestinian Struggle for Freedom - Truthout"
  ],
  [
    1733071527000,
    "How China will strike back at Trump - The Economist"
  ],
  [
    1733071753000,
    "On GPS: Is China ready for Trump 2.0? - CNN"
  ],
  [
    1733072280000,
    "Experts react: What Biden’s trip to Angola says about US Africa policy, China, and more - Atlantic Council"
  ],
  [
    1733074320000,
    "Largest gold deposit in the world worth $83 billion found in China - Fox News"
  ],
  [
    1733076526000,
    "Germany’s Baerbock slams China’s support for Russia ahead of Beijing trip - South China Morning Post"
  ],
  [
    1733087617000,
    "Why Did China’s Current Account Surplus Surge in the Third Quarter? - Council on Foreign Relations"
  ],
  [
    1733090417000,
    "Open Questions | Nobel winner James Robinson on ‘intensification’ of trade wars under Trump - South China Morning Post"
  ],
  [
    1733091666000,
    "‘Italian’ purees likely to contain Chinese forced-labour tomatoes - BBC.com"
  ],
  [
    1733093280000,
    "Trump threatens 100% tariffs on China and Russia if BRICS group of nations issues new currency - New York Post"
  ],
  [
    1733094000000,
    "Bulgari CEO Eyes India for Growth as China Luxury Demand Weakens - Bloomberg"
  ],
  [
    1733094017000,
    "Why China’s defence companies aren’t cashing in on a global arms sale surge - South China Morning Post"
  ],
  [
    1733095367000,
    "Taiwan’s president meets Hawaiian leaders in visit condemned by China - POLITICO"
  ],
  [
    1733098764000,
    "Asia's factories perk up on China recovery but Trump risks loom - Reuters"
  ],
  [
    1733103180000,
    "China launches first next-gen Long March 12 rocket, christens private spaceport - The Register"
  ],
  [
    1733104672000,
    "China’s factory activity hits 5-month high in November: Caixin PMI - South China Morning Post"
  ],
  [
    1733104800000,
    "Caixin PMI: China’s November factory growth hits five-month high, beats forecasts - CNBC"
  ],
  [
    1733104825000,
    "Is Beijing eyeing a new South China Sea island with ‘salami-slicing strategy’? - South China Morning Post"
  ],
  [
    1733106960000,
    "Tesla, BYD Ramp Up China Incentives in End-of-Year Sales Push - Bloomberg"
  ],
  [
    1733109180000,
    "China Skips Politburo Readout as Investors Await Stimulus Clues - Bloomberg"
  ],
  [
    1733109780000,
    "China's Nov factory activity growth hits 5-month high, Caixin PMI shows - Reuters"
  ],
  [
    1733111100000,
    "China Private Factory Gauge Grows Again in Sign of Stabilization - Bloomberg"
  ],
  [
    1733112840000,
    "Iron Ore Extends Gain as China’s Manufacturing Activity Improves - Bloomberg"
  ],
  [
    1733112967000,
    "China’s efforts to lure foreign investment clouded by Trump presidency: analysts - South China Morning Post"
  ],
  [
    1733114286000,
    "China And The U.S. Compete For Bauxite, The Ore Of Aluminum - Forbes"
  ],
  [
    1733115689000,
    "Chinese exporters front-load shipments in bid to dodge Trump tariffs - Financial Times"
  ],
  [
    1733115794000,
    "Exclusive-Latest US strike on China's chips hits semiconductor toolmakers - Yahoo Finance"
  ],
  [
    1733117409000,
    "Exclusive | China’s Meituan to expand Keeta food delivery service to more Middle East cities - South China Morning Post"
  ],
  [
    1733118900000,
    "Marcos Calls Russian Sub in South China Sea ‘Very Worrisome’ - Bloomberg"
  ],
  [
    1733119378000,
    "China’s intelligence ministry warns of security risks from open-source data - South China Morning Post"
  ],
  [
    1733119560000,
    "Building Apple Products Has Become a Side Hustle for China’s Biggest EV Maker - The Wall Street Journal"
  ],
  [
    1733119680000,
    "Exclusive | China Tensions Prompt U.S. Navy Race to Reload Missiles at Sea - The Wall Street Journal"
  ],
  [
    1733121060000,
    "Taiwan’s president visits East-West think tank as China criticizes his 2-day visit to Hawaii - The Associated Press"
  ],
  [
    1733125140000,
    "Malaysia urges Chinese firms to avoid using it to dodge U.S. tariffs - Reuters"
  ],
  [
    1733125418000,
    "New US chip sanctions to hit Chinese tool makers, but Japan, Netherlands exempt - South China Morning Post"
  ],
  [
    1733125711000,
    "China bonds rally with 10-year yield hitting a multi-decade low on rate cut expectations - CNBC"
  ],
  [
    1733126400000,
    "China Is the World's Manufacturing Superpower - Statista"
  ],
  [
    1733126543000,
    "China’s benchmark bond yields dip below 2% in 22-year low - Financial Times"
  ],
  [
    1733126940000,
    "China Box Office: ‘Moana 2’ Opens in Second Place as ‘Her Story’ Retains Top Spot - Variety"
  ],
  [
    1733127975000,
    "China condemns Lithuanian expulsion of its diplomats - Reuters"
  ],
  [
    1733128036000,
    "China completes full pipeline for Power-of-Siberia gas - Reuters"
  ],
  [
    1733128268000,
    "China’s 10-Year Yield Sinks to Record Low on Bets PBOC Will Ease - Bloomberg"
  ],
  [
    1733128320000,
    "China as friendly country willing to make positive efforts to prevent situation in Syria from deteriorating: Chinese FM - Global Times"
  ],
  [
    1733128823000,
    "China's relentless bond rally pushes 10-year yield below 2%, lowest on record - Reuters"
  ],
  [
    1733130000000,
    "Biden travels to Africa where policies were ‘over-promised and under-delivered,' amid massive China expansion - Fox News"
  ],
  [
    1733130128000,
    "[News] Latest U.S. Chip Curbs on China Targets 140 Companies, Led by Chip-tool Giant Naura Technology - TrendForce"
  ],
  [
    1733130521000,
    "‘Chinese support for Russia’ hitting ties, German foreign minister tells Wang Yi - South China Morning Post"
  ],
  [
    1733131219000,
    "Iran’s Oil Trade With China Rattled by US Sanctions on Tankers - Bloomberg"
  ],
  [
    1733131674000,
    "Indonesia yet to agree joint development areas with Beijing in South China Sea, minister says - Reuters"
  ],
  [
    1733131800000,
    "Chinese recycling firm Carbon Zero aims to replicate success overseas after Nasdaq IPO - Yahoo Finance"
  ],
  [
    1733131813000,
    "1 in 6 people in China use generative AI, government figures show - South China Morning Post"
  ],
  [
    1733133565000,
    "Philippines says China Coast Guard 'sideswiped' vessel - BBC.com"
  ],
  [
    1733133600000,
    "US Tightens Curbs on China’s Access to AI Memory and Chips Tools - Bloomberg"
  ],
  [
    1733133600000,
    "The US Just Made It Way Harder for China to Build Its Own AI Chips - WIRED"
  ],
  [
    1733133618000,
    "Biden takes a last aim at China’s hi-tech ambitions with new chip restrictions - South China Morning Post"
  ],
  [
    1733133662000,
    "Biden Visits Angola to Promote Lobito Corridor and Counter China - The New York Times"
  ],
  [
    1733133770000,
    "Biden Targets China’s Chip Industry With Wider Trade Bans - The New York Times"
  ],
  [
    1733133841000,
    "Inside a Secret Plan to Bring Uyghurs Trapped in China to the United States - The New York Times"
  ],
  [
    1733134080000,
    "Biden’s Farewell to China’s Tech Sector: A New Type of Forbidden Chip - The Wall Street Journal"
  ],
  [
    1733135047000,
    "China and North Korea Throw U.S. War Plans out the Window - Foreign Policy"
  ],
  [
    1733135382000,
    "Germany's Baerbock warns China over Russia support - DW (English)"
  ],
  [
    1733135400000,
    "Rubio’s Tough Stance on China Means Pressure on Importers - The Wall Street Journal"
  ],
  [
    1733137722000,
    "China condemns Lithuania’s expulsion of diplomats; says countermeasures possible - South China Morning Post"
  ],
  [
    1733140200000,
    "China is studying sanctions on Russia to figure out how to handle them if it invades Taiwan, report says - Business Insider"
  ],
  [
    1733140800000,
    "America’s nuclear submarine crisis on a collision course with China - Fox News"
  ],
  [
    1733141981000,
    "How provinces and cities can sustain US–China climate cooperation - Nature.com"
  ],
  [
    1733142600000,
    "The Electric: How Trump Set the Stage for a Grand EV Bargain With China - The Information"
  ],
  [
    1733145553000,
    "US Expands China Restrictions, Banning AI Memory Exports and 140 Companies - PCMag"
  ],
  [
    1733146560000,
    "Biden takes a parting swing at China's chip industry ahead of Trump's 2nd term - Business Insider"
  ],
  [
    1733147460000,
    "Wang Yi and German Federal Foreign Minister Annalena Baerbock Hold the Seventh Round of China-Germany Strategic Dialogue on Diplomacy and Security_Ministry of Foreign Affairs of the People's Republic of China - mfa.gov.cn"
  ],
  [
    1733147661000,
    "German FM urges China to stop backing Russia, work for Ukraine peace - VOA Asia"
  ],
  [
    1733148012000,
    "Beijing mulls options as China hawk Rubio awaits top US diplomat post - South China Morning Post"
  ],
  [
    1733148700000,
    "China Reacts to Trump's BRICS Threat - Newsweek"
  ],
  [
    1733149609000,
    "\"Very unique\" Russian submarine spotted in the South China Sea; Philippines deploys navy ship, warplanes - CBS News"
  ],
  [
    1733152864000,
    "Chinese lidar sensors pose hacking risk to US defense equipment, report says - Reuters"
  ],
  [
    1733153802000,
    "China's Cars Will Take Over the World - Bloomberg"
  ],
  [
    1733154501000,
    "US unveils fresh export curbs targeting China's chip sector - VOA Asia"
  ],
  [
    1733154637000,
    "Sanofi charts biggest China investment to date with plans for €1B insulin 'manufacturing base' in Beijing - FiercePharma"
  ],
  [
    1733154756000,
    "QatarEnergy signs long-term LNG deal with Shell for delivery to China - Reuters"
  ],
  [
    1733155320000,
    "China slams US latest chip curbs, vowing resolute measures to defend Chinese firms’ legitimate interests - Global Times"
  ],
  [
    1733158712000,
    "European factories struggled last month as China's perked up ahead of Trump tariffs - Reuters"
  ],
  [
    1733159520000,
    "US issues new restrictions on chip manufacturing exports to China - The Hill"
  ],
  [
    1733164834000,
    "Protecting U.S. Allies and Partners from Chinese Economic Coercion - Council on Foreign Relations"
  ],
  [
    1733164999000,
    "Sanofi announces its biggest China investment deal amid China-EU trade tensions - Reuters"
  ],
  [
    1733166033000,
    "ASML not changing guidance after new US crackdown on China chip exports - Reuters"
  ],
  [
    1733169480000,
    "Can Trump Win a Trade War With China? Xi Jinping Knows What’s Coming. - Barron's"
  ],
  [
    1733170120000,
    "Oil Steadies as OPEC Uncertainty Counters China’s Economic Gain - Yahoo Finance"
  ],
  [
    1733170650000,
    "EU-US Cooperation on China and Taiwan - The Diplomat"
  ],
  [
    1733171041000,
    "The Growing Militarization of China’s Africa Policy - Africa Center for Strategic Studies"
  ],
  [
    1733171773000,
    "Oil steady, traders hopeful on China demand but worried about Fed - Reuters"
  ],
  [
    1733172862000,
    "Ending the Strategic Vacuum: A U.S. Strategy for China in Latin America - Center for Strategic & International Studies"
  ],
  [
    1733173200000,
    "Big Pharma’s Bet on China Biotech Is a Rare Trade Bright Spot - Bloomberg"
  ],
  [
    1733173556000,
    "US hits China’s chip industry with new export controls - Financial Times"
  ],
  [
    1733176513000,
    "US unleashes another crackdown on China’s chip industry - Al Jazeera English"
  ],
  [
    1733177289000,
    "Help from Asean nations to counter China is unlikely: ex-Philippine Navy officer - South China Morning Post"
  ],
  [
    1733178272000,
    "Uber-Bullish China ETF Attracts $55 Million Call-Buying Spree - Bloomberg"
  ],
  [
    1733180683000,
    "China's AI balancing act — beating the U.S. but keeping the tech from threatening Beijing's rule - CNBC"
  ],
  [
    1733184174000,
    "From VOA Mandarin: China flooding Global South markets with cheap goods - VOA Asia"
  ],
  [
    1733184907000,
    "US to block sale of cutting-edge, chip-making equipment to China - VOA Asia"
  ],
  [
    1733184998000,
    "After decades, China sputters as engine of global oil demand growth - Reuters"
  ],
  [
    1733185498000,
    "Tesla's China-made EV sales drop 4.3% in Nov - Reuters"
  ],
  [
    1733189262000,
    "A glimpse of future airpower on display at biennial China airshow - Al Jazeera English"
  ],
  [
    1733192361000,
    "China hits out at latest US effort to block Beijing’s access to chip technology - CNN"
  ],
  [
    1733192448000,
    "US targets China's chip industry with new restrictions - Reuters"
  ],
  [
    1733192520000,
    "HKBN Shares Jump After China Mobile Makes $882 Million Offer - Yahoo Finance"
  ],
  [
    1733194620000,
    "China’s Central Bank Chief Signals Support for Economy in 2025 - Bloomberg"
  ],
  [
    1733198325000,
    "US expands curbs on China’s AI memory and chip tools, raising supply chain concerns - CIO"
  ],
  [
    1733199240000,
    "Asian chip stocks mostly rise, shrugging off new U.S. semiconductor export curbs on China - CNBC"
  ],
  [
    1733200400000,
    "Taiwan watching Chinese carrier movements as sources say war games may start this weekend - Reuters"
  ],
  [
    1733202180000,
    "China’s Flood of Cheap Goods Is Angering Its Allies, Too - The Wall Street Journal"
  ],
  [
    1733203680000,
    "U.S. cranks up China chip industry curbs: 5 things to know - Nikkei Asia"
  ],
  [
    1733205360000,
    "US expands list of Chinese technology companies under export controls - The Associated Press"
  ],
  [
    1733205610000,
    "Chinese tourists leave Japan guest house in disarray, sparking price hike proposal - South China Morning Post"
  ],
  [
    1733207040000,
    "China Leaders Plan to Discuss GDP Target, Stimulus Next Week - Bloomberg"
  ],
  [
    1733208000000,
    "U.S. announces new export controls on China's chip industry - NBC News"
  ],
  [
    1733209213000,
    "U.S. unveils news rules banning China from semiconductor technology - UPI News"
  ],
  [
    1733212800000,
    "Canadian miners use China's rare metals ban to push back on Trump tariffs - Financial Post"
  ],
  [
    1733212898000,
    "Chinese chip firms say they can withstand new US export curbs - Reuters"
  ],
  [
    1733213714000,
    "A crossing on a ‘placeless place’ from China to South Korea - South China Morning Post"
  ],
  [
    1733214075000,
    "China shuts US out of critical minerals trade in reply to new tech curbs - South China Morning Post"
  ],
  [
    1733214519000,
    "Traders Defy China's Yuan Support, Sending Currency to One-Year Low - Yahoo Finance"
  ],
  [
    1733216348000,
    "China ‘deposits’ statement regarding disputed Scarborough shoal to UN - Radio Free Asia"
  ],
  [
    1733216910000,
    "Tesla China Shipments Fall Again Amid Hopes for Bumper Quarter - Yahoo Finance"
  ],
  [
    1733219433000,
    "The Youth Are ‘Lifeless’: Economist’s Speech Goes Viral in China - Bloomberg"
  ],
  [
    1733219580000,
    "Tesla’s China Sales Fall as Competition Heats Up - The Wall Street Journal"
  ],
  [
    1733220840000,
    "China tightens export controls on dual-use items to the US: MOFCOM - Global Times"
  ],
  [
    1733223000000,
    "China bans exports of gallium and other key high-tech materials, hitting back at US chip sanctions - WTOC"
  ],
  [
    1733223564000,
    "China Announces a Ban on Rare Minerals to the U.S. - The New York Times"
  ],
  [
    1733225924000,
    "India signals readiness to pursue China business ties after border row resolved - Reuters"
  ],
  [
    1733226393000,
    "China launches clandestine TJS-13 satellite, rocket reaches milestone - SpaceNews"
  ],
  [
    1733226621000,
    "China as It Is – David P. Goldman - Law & Liberty"
  ],
  [
    1733226720000,
    "China bans exports to U.S. of key high-tech materials in response to expanded American chip sanctions - Fortune"
  ],
  [
    1733227433000,
    "In pivot from India, Nepal PM seeks economic support from China - Reuters.com"
  ],
  [
    1733227524000,
    "Explainer: After China's mineral export ban, how else could it respond to U.S. chip curbs? - Reuters"
  ],
  [
    1733227920000,
    "China bans exports to US of gallium, germanium, antimony in response to chip sanctions - The Associated Press"
  ],
  [
    1733228763000,
    "NATO to step up action against Russian, Chinese ‘sabotage’ - Al Jazeera English"
  ],
  [
    1733229840000,
    "China hits back at Biden's chip restrictions by banning shipments of key materials to the US - Business Insider"
  ],
  [
    1733232660000,
    "Trump Tariffs on China Will Cause Pain Elsewhere. Stocks to Play It. - Barron's"
  ],
  [
    1733236140000,
    "Chip war ramps up with new US semiconductor restrictions on China - The Guardian US"
  ],
  [
    1733236560000,
    "China’s share of global electric car market rises to 76% - The Guardian"
  ],
  [
    1733236666000,
    "China hits back at U.S. with export ban on rare minerals - Axios"
  ],
  [
    1733237247000,
    "As China’s purge of top military officials continues, will Xi’s high-stakes gamble pay off? - Chatham House"
  ],
  [
    1733240160000,
    "China bans exports to U.S. of some materials for electronics manufacturing - CBS News"
  ],
  [
    1733241094000,
    "Ford Foundation paid CCP allies millions to aid China’s global influence operations - Washington Examiner"
  ],
  [
    1733241120000,
    "China responds to US chip sanctions, banning exports of key minerals - The Hill"
  ],
  [
    1733242984000,
    "US needs Japan as Trump's China tariffs loom: Policy expert - Yahoo Finance"
  ],
  [
    1733243974000,
    "A Chinese-Flagged Ship Cut Baltic Sea Internet Cables. This Time, Europe Was More Prepared. - Carnegie Endowment for International Peace"
  ],
  [
    1733244132000,
    "What Are Gallium and Germanium? The Niche Metals Hit by China’s Export Ban - Bloomberg"
  ],
  [
    1733244600000,
    "China Bans Gallium, Germanium Exports to U.S. What It Means for Chip Stocks. - Barron's"
  ],
  [
    1733244813000,
    "China bans export of critical minerals to US as trade tensions escalate - Reuters"
  ],
  [
    1733245106000,
    "China retaliates against latest US chip restrictions - Financial Times"
  ],
  [
    1733245620000,
    "Illegal immigrant from China shipped weapons to North Korea from California: DOJ - Fox News"
  ],
  [
    1733246640000,
    "Trump’s China Tariffs Will Raise Prices on Some Goods. How to Best Protect U.S. Manufacturing. - Barron's"
  ],
  [
    1733247540000,
    "Advanced Russian Attack Submarine Operating in the East China Sea - USNI News"
  ],
  [
    1733248385000,
    "Biden tightens tech controls on China as clock ticks down - The Washington Post"
  ],
  [
    1733248800000,
    "To defend Taiwan tomorrow, we must prepare to sanction China today - The Hill"
  ],
  [
    1733249580000,
    "China Hits Back at U.S. Chip Controls With Limits on Key Raw Materials - The Wall Street Journal"
  ],
  [
    1733249625000,
    "Undocumented Chinese immigrant charged with shipping weapons to North Korea - ABC News"
  ],
  [
    1733252408000,
    "China Dials Up US Trade Tension With Tit-for-Tat Metals Ban - Yahoo Finance"
  ],
  [
    1733253607000,
    "China hits back at US chip sanctions with bans on exports - DW (English)"
  ],
  [
    1733255705000,
    "Antidoping Agency Froze Out Investigators Who Warned About China - The New York Times"
  ],
  [
    1733256308000,
    "China hits back against US chip crackdown - Al Jazeera English"
  ],
  [
    1733257897000,
    "Chinese hack of global telecom providers is ‘ongoing,’ officials warn - POLITICO"
  ],
  [
    1733266906000,
    "US blasts China’s export ban on key minerals, vows ‘necessary steps’ - South China Morning Post"
  ],
  [
    1733268980000,
    "The U.S. may have reached 'the high-water mark' in tensions with China, Jim Cramer says - CNBC"
  ],
  [
    1733271420000,
    "I'm 25 and felt suffocated by city life — so I spent 2 months in a youth retirement village in China - Business Insider"
  ],
  [
    1733272277000,
    "Chinese hackers still lurk in US telecommunications systems - VOA Asia"
  ],
  [
    1733277565000,
    "China’s ties with Saudi Arabia buoyed by green tech - Financial Times"
  ],
  [
    1733279220000,
    "FBI tells telecom firms to boost security following wide-ranging Chinese hacking campaign - The Associated Press"
  ],
  [
    1733279280000,
    "China calls South Korea's political situation an 'internal matter' - Nikkei Asia"
  ],
  [
    1733279760000,
    "China Services Expansion Cools Off Despite Recent Stimulus Push - Bloomberg"
  ],
  [
    1733282460000,
    "Taiwan says China's threats over president's US visit are counterproductive - Reuters"
  ],
  [
    1733283435000,
    "U.S. officials say they still have not expelled Chinese telco hackers - The Washington Post"
  ],
  [
    1733283720000,
    "China May Maintain Rapid Pace of Atomic Power Reactor Approvals - Bloomberg"
  ],
  [
    1733284800000,
    "China calls on universities to provide 'love education' - Reuters"
  ],
  [
    1733288181000,
    "Philippines and China in South China Sea confrontation - DW (English)"
  ],
  [
    1733288400000,
    "A Last Chance to Prevent Nuclear Anarchy: Can Trump Engage China and Russia Before It’s Too Late? - Foreign Affairs Magazine"
  ],
  [
    1733296320000,
    "China can accept GDP growth of less than 5%, says People's Daily - Reuters"
  ],
  [
    1733302800000,
    "Before DOGE, Ramaswamy spent years attacking Musk for ties to China - CNN"
  ],
  [
    1733304863000,
    "China’s November Car Sales Seen Surging 18% on Subsidy Rush - Bloomberg"
  ],
  [
    1733310000000,
    "D.R. Congo's mining capital is at the heart of Biden's bid to counter China in Africa - NPR"
  ],
  [
    1733311801000,
    "Nepal, China sign deal on Belt and Road plan, paving way for progress on projects - Reuters"
  ],
  [
    1733312419000,
    "South Korea’s tumult is a symptom of China-US strife - Financial Times"
  ],
  [
    1733312819000,
    "G.M.’s Ailing China Business Will Deal It a $5 Billion Blow - The New York Times"
  ],
  [
    1733312834000,
    "GM expects more than $5 billion impact from China restructuring, including plant closures - CNBC"
  ],
  [
    1733313883000,
    "Using Stock Returns to Assess the Aggregate Effect of the U.S.-China Trade War - Liberty Street Economics -"
  ],
  [
    1733313977000,
    "GM warns Wall Street of a $5 billion hit it expects to take from losses in China - Detroit Free Press"
  ],
  [
    1733314496000,
    "China stacked the deck against Augusta-made golf carts. Here's what America did about it. - USA TODAY"
  ],
  [
    1733314848000,
    "U.S. accuses China of illegal, \"dangerous maneuvers\" as Philippine vessels blasted with water cannons - CBS News"
  ],
  [
    1733315322000,
    "US chips are 'no longer safe,' Chinese industry bodies say in latest trade salvo - Reuters"
  ],
  [
    1733315760000,
    "GM is struggling so much in China, it had to announce massive charges to fix its business - CNN"
  ],
  [
    1733318018000,
    "People’s Bank of China’s Stimulus Package Lifted Alibaba (BABA) - Yahoo Finance"
  ],
  [
    1733319675000,
    "Chinese espionage campaign scooped up data on thousands of US mobile phone users, sources say - ABC7 New York"
  ],
  [
    1733320404000,
    "Chanel Takes Its Métiers d’Art Show to China, for 1,100 Guests. - The New York Times"
  ],
  [
    1733320694000,
    "Chanel’s Answer to the China Question - The New York Times"
  ],
  [
    1733320800000,
    "Apple Hits Snags Adapting Baidu’s AI Models for China Users - The Information"
  ],
  [
    1733320800000,
    "How American entrepreneurs can help win the space race against China - SpaceNews"
  ],
  [
    1733321194000,
    "China Blocks Shipment of Rare Minerals to US: What To Know - Newsweek"
  ],
  [
    1733321194000,
    "China grows global influence through partnership with Russia in 2024 - VOA Asia"
  ],
  [
    1733323325000,
    "Tech wars: Why has China banned exports of rare minerals to US? - Al Jazeera English"
  ],
  [
    1733323957000,
    "Spring festival, social practices of the Chinese people in celebration of traditional new year - UNESCO"
  ],
  [
    1733324104000,
    "China bans export of key minerals to U.S. as trade row deepens even before Trump's second term - CBS News"
  ],
  [
    1733324410000,
    "US Reacts As China Clashes With Ally at Sea - Newsweek"
  ],
  [
    1733325407000,
    "Apple facing hurdles in adapting Baidu AI models for China, The Information reports - Reuters"
  ],
  [
    1733328283000,
    "The rise of US economic sanctions on China: Analysis of a new PIIE dataset - Peterson Institute for International Economics"
  ],
  [
    1733328900000,
    "With AstraZeneca exec under investigation in China, company names Reic new international chief - FiercePharma"
  ],
  [
    1733329624000,
    "GM takes more than $5bn charge against China businesses - Financial Times"
  ],
  [
    1733330004000,
    "Nepal Joins China's Belt And Road Initiative, Raises Concerns For New Delhi - NDTV"
  ],
  [
    1733331083000,
    "Feds raise alarm on China-linked infiltration of telecom networks - Cybersecurity Dive"
  ],
  [
    1733331329000,
    "China Just Showed Washington How It Plans to Fight the Next Trade War - The New York Times"
  ],
  [
    1733331441000,
    "Senators Warn the Pentagon: Get a Handle on China’s Telecom Hacking - WIRED"
  ],
  [
    1733331720000,
    "China won’t step in to end the war in Ukraine, warns Lithuanian FM - POLITICO Europe"
  ],
  [
    1733331824000,
    "China’s economic stimulus to partially offset US tariffs in 2025 - Goldman Sachs"
  ],
  [
    1733332781000,
    "China Takes Harder Trade Stance as Trump Prepares for Office - The New York Times"
  ],
  [
    1733333268000,
    "GM China to take $5B hit; 'there will be no comeback story,' expert says - Yahoo Finance"
  ],
  [
    1733334240000,
    "Losses in China lead to $5 billion charge for General Motors as it cuts the value of its assets - The Associated Press"
  ],
  [
    1733334331000,
    "China deletes warning that youth unemployment is tanking economy - Radio Free Asia"
  ],
  [
    1733334704000,
    "Trump nominates China hawk David Perdue to become ambassador - BBC.com"
  ],
  [
    1733339925000,
    "What China gains from ban on rare mineral exports to US - DW (English)"
  ],
  [
    1733347200000,
    "White House official: 8 US telecom providers hacked by Chinese - CNN"
  ],
  [
    1733347362000,
    "Trump’s Threat to Revoke China’s Trade Status, Explained - Foreign Policy"
  ],
  [
    1733347492000,
    "The U.S. and China Vie for Influence in Africa - NPR"
  ],
  [
    1733347555000,
    "GM to take more than $5 billion in charges on China operations - Reuters"
  ],
  [
    1733348143000,
    "At least 8 U.S. telcos compromised in Chinese hack, White House says - Axios"
  ],
  [
    1733348437000,
    "China Imposes Its Most Stringent Critical Minerals Export Restrictions Yet Amidst Escalating U.S.-China Tech War - Center for Strategic & International Studies"
  ],
  [
    1733349060000,
    "GM to write down value of China business by more than $5bn - The Guardian"
  ],
  [
    1733349900000,
    "White House says at least 8 US telecom firms, dozens of nations impacted by China hacking campaign - The Associated Press"
  ],
  [
    1733351195000,
    "At least 8 U.S. telecom firms were hit by China’s hacking campaign, White House says - PBS NewsHour"
  ],
  [
    1733351220000,
    "Dozens of Countries Hit in Chinese Telecom Hacking Campaign, Top U.S. Official Says - The Wall Street Journal"
  ],
  [
    1733352432000,
    "Dozens of nations hit by 'China' hack - as Americans warned to stop sending texts - Sky News"
  ],
  [
    1733352825000,
    "Chinese hackers stole Americans’ phone data from 8 telecoms, U.S. officials say - NBC News"
  ],
  [
    1733353541000,
    "Far from a bazooka, China's stimulus measures are just trickling through the economy - CNBC"
  ],
  [
    1733355620000,
    "Chinese hackers have infiltrated at least 8 U.S. telecom companies, White House says - PBS NewsHour"
  ],
  [
    1733358000000,
    "Many Americans’ cellphone data being hacked by China, official says - The Guardian"
  ],
  [
    1733360160000,
    "General Motors Takes $5 Billion Hit From Ailing China Business - The Wall Street Journal"
  ],
  [
    1733360460000,
    "Philippines says China’s coast guard fired water cannons and sideswiped its patrol vessel - The Associated Press"
  ],
  [
    1733370180000,
    "China Warns Against ‘Worship’ of Faster Growth Before Key Confab - Bloomberg"
  ],
  [
    1733370300000,
    "China to Set Another Solar Record Even as Industry Struggles - Bloomberg"
  ],
  [
    1733374101000,
    "Biden Aide Says US Would Run Out of Munition in China War - The Defense Post"
  ],
  [
    1733374853000,
    "China’s shift to local chips gains momentum from latest US export controls - Financial Times"
  ],
  [
    1733374853000,
    "Only China can now lead the world on climate - Financial Times"
  ],
  [
    1733381520000,
    "OnlyFans is now accessible in China - CNN"
  ],
  [
    1733382180000,
    "Taiwan official says China trying to set a 'red line' for incoming Trump government - Reuters"
  ],
  [
    1733383757000,
    "Mainland China sanctions 13 US companies over weapons sales to Taiwan - South China Morning Post"
  ],
  [
    1733387644000,
    "China slaps sanctions on 13 US military firms over Taiwan arms sale - Reuters"
  ],
  [
    1733392800000,
    "China Imposes Sanctions on 13 US Firms Over Arms Sales to Taiwan - Bloomberg"
  ],
  [
    1733393912000,
    "China Slaps Sanctions on 13 U.S. Defense Firms - The New York Times"
  ],
  [
    1733394833000,
    "Philippines files diplomatic protest against China over South China Sea incident - Reuters"
  ],
  [
    1733396317000,
    "China's Xi stresses need to fight graft in military - Reuters"
  ],
  [
    1733396992000,
    "U.S. Organization in China Targeted by Attackers - Symantec Enterprise Blogs"
  ],
  [
    1733406247000,
    "Taiwan president speaks with US House Speaker Johnson, China warns of 'red lines' - Reuters"
  ],
  [
    1733406519000,
    "Fresh doubts about China’s ability to invade Taiwan - The Economist"
  ],
  [
    1733406520000,
    "Will China’s “green Great Wall” save it from encroaching sands? - The Economist"
  ],
  [
    1733406520000,
    "Chinese women are making themselves heard on the big screen - The Economist"
  ],
  [
    1733409660000,
    "Chinese Embassy in Syria advises Chinese citizens to return to China or leave the country ASAP - Global Times"
  ],
  [
    1733409690000,
    "China bans sale of three critical elements and ‘superhard materials’ to the US - Chemistry World"
  ],
  [
    1733410302000,
    "China automakers pivot to hybrids for Europe to counter EV tariffs - Reuters"
  ],
  [
    1733412557000,
    "Why China's ban on exports of gallium, germanium and more could cost US billions - USA TODAY"
  ],
  [
    1733416286000,
    "China’s Surveillance State Is Losing Its Grip - Forbes"
  ],
  [
    1733416663000,
    "World is entering 'third nuclear age' fueled by Russia and China, British admiral says - NBC News"
  ],
  [
    1733417001000,
    "Myanmar’s Resistance Manages to Defy Chinese Pressure — For Now - United States Institute of Peace"
  ],
  [
    1733417775000,
    "China in 2025 - Mercator Institute for China Studies (MERICS)"
  ],
  [
    1733421096000,
    "GOP China Panel Chair Slams US Chip Curbs for Huawei ‘Loopholes’ - Bloomberg"
  ],
  [
    1733422020000,
    "Paraguay kicks out a visiting Chinese envoy for urging its lawmakers to turn their backs on Taiwan - The Associated Press"
  ],
  [
    1733422651000,
    "I was censored from talking about Chinese influence in Latin America - The Spectator World"
  ],
  [
    1733424660000,
    "Paraguay kicks out Chinese envoy after he urges country to cut ties with Taiwan - The Guardian"
  ],
  [
    1733425059000,
    "China Increasing Interest in Strategic Arctic Region - Department of Defense"
  ],
  [
    1733431475000,
    "Biden Tees Up Trump With a Final China Chip Battle - Foreign Policy"
  ],
  [
    1733433423000,
    "FCC chair proposes cybersecurity rules in response to China's Salt Typhoon telecom hack - Reuters"
  ],
  [
    1733434518000,
    "NASA says moon mission is delayed, hopes to land astronauts before China - NBC News"
  ],
  [
    1733439180000,
    "China and Russia plotting military stranglehold on Arctic, warns Pentagon - The Telegraph"
  ],
  [
    1733439442000,
    "Dwarfed by China in shipbuilding, US looks to build its defense base to fend off war - Yahoo! Voices"
  ],
  [
    1733440898000,
    "DOD: Russian Weakness Fuels China’s Rise in the Arctic - Air & Space Forces Magazine"
  ],
  [
    1733442549000,
    "Paraguay expels visiting Chinese envoy who urged lawmakers to reject Taiwan - Al Jazeera English"
  ],
  [
    1733445036000,
    "Trump picks former Senator David Perdue as ambassador to China - Reuters"
  ],
  [
    1733445060000,
    "India's steel imports from China hit record high, latest data shows - Reuters India"
  ],
  [
    1733445960000,
    "Trump China Tariff Plan Has $64 Billion Hole in Missing Imports - Bloomberg"
  ],
  [
    1733446810000,
    "China wife pushed off Thai cliff by husband says he demands US$4 million for divorce - South China Morning Post"
  ],
  [
    1733450400000,
    "Sources: Nets-Suns set as NBA's return to China - ESPN"
  ],
  [
    1733450416000,
    "Will China’s manufacturing juggernaut run out of road? - Financial Times"
  ],
  [
    1733453342000,
    "NBA signs deal with Sands China for pre-season games in Macau - South China Morning Post"
  ],
  [
    1733455460000,
    "Trump picks David Perdue to be ambassador to China - POLITICO"
  ],
  [
    1733456460000,
    "Europe in the line of fire as Trump threatens trade war with China - POLITICO Europe"
  ],
  [
    1733461200000,
    "Can Trump Split China and Russia? - Foreign Affairs Magazine"
  ],
  [
    1733461246000,
    "Bolster defenses against China hackers or face fines, FCC warns telecoms - The Washington Post"
  ],
  [
    1733461920000,
    "NBA will return to China with 2 preseason games, 5 years after Daryl Morey-Hong Kong firestorm - Yahoo Sports"
  ],
  [
    1733466780000,
    "China Sets Precedent by Banning Others From Selling Goods to US - Bloomberg"
  ],
  [
    1733468400000,
    "China’s military and private security inroads in Africa - Geopolitical Intelligence Services AG"
  ],
  [
    1733471520000,
    "US, Japan and Philippine forces jointly patrol in South China Sea after hostilities involving China - The Associated Press"
  ],
  [
    1733472810000,
    "Asia Gold Indian dealers offer discounts; China sees seasonally soft demand - Reuters"
  ],
  [
    1733473015000,
    "Ahead of expected war games, Taiwan urges China to 'unclench its fists' - Reuters"
  ],
  [
    1733473380000,
    "Chinese fishing vessel under control of suspected pirates off Somali coast, EU naval force says - CNN"
  ],
  [
    1733473500000,
    "Meet Trump's Pick for Ambassador to China - Business Insider"
  ],
  [
    1733474172000,
    "China's ban on key high-tech materials could have broad impact on industries, economy - ABC News"
  ],
  [
    1733475600000,
    "What China’s critical mineral ban means for the US - MIT Technology Review"
  ],
  [
    1733475971000,
    "Paraguay expels Chinese envoy over Taiwan 'interference' - Reuters Canada"
  ],
  [
    1733477400000,
    "China's ByteDance, Alibaba, Tencent seek fresh talent at 'Olympics of AI' - Yahoo Finance"
  ],
  [
    1733479320000,
    "China's cheap goods are threatening to undermine its influence in the developing world - Business Insider"
  ],
  [
    1733479592000,
    "NBA to return to China with multiyear deal in Macau - Reuters"
  ],
  [
    1733480220000,
    "NBA returning to China for pair of Suns-Nets preseason games in 2025 - The Associated Press"
  ],
  [
    1733480832000,
    "Two critical online views on China's economy vanish ahead of policy meeting - Reuters"
  ],
  [
    1733482487000,
    "Wall Street Banks Predict Biggest China Rate Cuts in a Decade - Bloomberg"
  ],
  [
    1733483040000,
    "China fine tunes economic stimulus as it braces for new US administration - The Associated Press"
  ],
  [
    1733485552000,
    "What David Perdue Has Said About China as Trump Makes Him Ambassador - Newsweek"
  ],
  [
    1733487480000,
    "NBA returning to China after friction between league, country: report - Fox News"
  ],
  [
    1733488478000,
    "Four Taiwan Soldiers Charged With Spying for China - The Defense Post"
  ],
  [
    1733490480000,
    "GM's $5B Q4 China Setback: Is Its Long-Term Growth Story Intact? - Yahoo Finance"
  ]
]