[
  [
    1738012818000,
    "Tech stocks fall as China's DeepSeek sparks U.S. worries about the AI race - NBC News"
  ],
  [
    1738027320000,
    "Trump says China's DeepSeek AI ‘should be a wake-up call’ - NBC News"
  ],
  [
    1738062673000,
    "China’s DeepSeek and its Open-Source AI Models - China Briefing"
  ],
  [
    1738065963000,
    "Exclusive: Images show China building huge fusion research facility, analysts say - Reuters"
  ],
  [
    1738067870000,
    "DeepSeek: How China's 'AI heroes' overcame US curbs to stun Silicon Valley - BBC.com"
  ],
  [
    1738082046000,
    "Inside China, DeepSeek Provides a National Mic Drop Moment - The New York Times"
  ],
  [
    1738088051000,
    "UK will not be able to resist China's tech dominance - BBC.com"
  ],
  [
    1738094640000,
    "China built out record amount of wind and solar power in 2024 - The Associated Press"
  ],
  [
    1738101633000,
    "A big, beautiful Trump deal with China? - The Economist"
  ],
  [
    1738127580000,
    "After talking tough during campaign, Trump appears to ease up on China at start of presidency - The Associated Press"
  ],
  [
    1738137112000,
    "China’s DeepSeek faces questions over claims after shaking up global tech - Al Jazeera English"
  ],
  [
    1738158177000,
    "Commerce Nominee Defends Trump Tariffs and Promises Strong Stance on China - The New York Times"
  ],
  [
    1738159200000,
    "The Case for “Avalanche Decoupling” From China - Foreign Affairs Magazine"
  ],
  [
    1738166791000,
    "The world should take the prospect of Chinese tech dominance seriously, and start preparing now - Chatham House"
  ],
  [
    1738171909000,
    "As Trump's tariffs loom, analysts say China is better prepared than ever for a trade war with the U.S. - CBS News"
  ],
  [
    1738175537000,
    "OpenAI says Chinese rivals using its work for their AI apps - BBC.com"
  ],
  [
    1738182247000,
    "Why blocking China's DeepSeek from using US AI may be difficult - Reuters"
  ],
  [
    1738224000000,
    "China’s cheap, open AI model DeepSeek thrills scientists - Nature.com"
  ],
  [
    1738231225000,
    "DeepSeek, TikTok, RedNote: How Did China’s Internet Become So Cool? - Bloomberg"
  ],
  [
    1738233419000,
    "How China created AI model DeepSeek and shocked the world - Nature.com"
  ],
  [
    1738236540000,
    "Philippine president offers a deal to China: Stop sea aggression and I’ll return missiles to US - The Associated Press"
  ],
  [
    1738250233000,
    "Coming Together or Falling Apart Over China? - Center for European Policy Analysis"
  ],
  [
    1738251752000,
    "Is Cambodia slipping out of China’s orbit? - The Economist"
  ],
  [
    1738257553000,
    "Managing the Risks of China’s Access to U.S. Data and Control of Software and Connected Technology - Carnegie Endowment for International Peace"
  ],
  [
    1738263084000,
    "Moolenaar, Krishnamoorthi Call For Tightening Export Controls on Chips Critical to China's AI Platform DeepSeek and Other Measures to Address its Risks to Americans’ Data and Security - Select Committee on the CCP |"
  ],
  [
    1738278008000,
    "Why The China Bubble Still Hasn’t Popped - Bloomberg"
  ],
  [
    1738280520000,
    "Nvidia Chip Flow to China Should be Throttled Post-DeepSeek, U.S. Lawmakers Say - The Wall Street Journal"
  ],
  [
    1738282920000,
    "Rubio warns of risk of China shutting down Panama Canal in any conflict - Reuters Canada"
  ],
  [
    1738283580000,
    "Cook points to 'fiscal stimulus' after Apple suffers steepest China sales decline in a year - CNBC"
  ],
  [
    1738294781000,
    "Tell Us How Tariffs on Goods From China Will Affect Your Business - The New York Times"
  ],
  [
    1738302796000,
    "Trump announces steep tariffs on Canada, Mexico and China starting Saturday - FRANCE 24 English"
  ],
  [
    1738307185000,
    "Trump support for denuclearization talks with Russia, China raises hopes - VOA Asia"
  ],
  [
    1738321652000,
    "China says Japan's plans for chip export controls could damage business relations - Reuters"
  ],
  [
    1738324359000,
    "China builds nuke-resistant bunker - Axios"
  ],
  [
    1738326594000,
    "China passes on US soybeans despite Brazilian delays - Reuters"
  ],
  [
    1738331700000,
    "DeepSeek’s Breakthrough Sparks National Pride in China - The Wall Street Journal"
  ],
  [
    1738334775000,
    "Rubio heads to Central America, pursuing ‘America First’ diplomacy, countering China - VOA Asia"
  ],
  [
    1738335600000,
    "What questions will China's DeepSeek not answer? - DW (English)"
  ],
  [
    1738335879000,
    "Trump Will Hit Mexico, Canada and China With Tariffs - The New York Times"
  ],
  [
    1738336932000,
    "Here's what Trump’s tariff threats look like on the ground in China - CNBC"
  ],
  [
    1738339844000,
    "Trump says he will impose tariffs on Mexico, Canada, China beginning Saturday - Scripps News"
  ],
  [
    1738340013000,
    "DeepSeek’s Answers Include Chinese Propaganda, Researchers Say - The New York Times"
  ],
  [
    1738348274000,
    "Trump tariffs on Canada, Mexico and China begin Saturday, White House says - CNBC"
  ],
  [
    1738348807000,
    "White House Says China, Mexico, Canada Tariffs to Hit Feb. 1 - Bloomberg"
  ],
  [
    1738348870000,
    "Exclusive: Chinese workers in BYD Brazil factory signed contracts with abusive clauses, investigators say - Reuters"
  ],
  [
    1738349220000,
    "Trump to impose tariffs on imports from Canada, Mexico and China - The Guardian US"
  ],
  [
    1738349392000,
    "Reacting to DeepSeek, US Senate bill would separate US and China AI efforts - South China Morning Post"
  ],
  [
    1738350812000,
    "Trump to enact tariffs against Canada, China and Mexico on Feb. 1. Here's what to know. - CBS News"
  ],
  [
    1738350873000,
    "The global AI race: Is China catching up to the US? - Financial Times"
  ],
  [
    1738351137000,
    "Why the US is claiming China’s presence violates the Panama neutrality treaty - Reuters Canada"
  ],
  [
    1738352340000,
    "Trump to enact tariffs on Canada, Mexico, China - VOA Asia"
  ],
  [
    1738353275000,
    "White House Says Trump Tariffs on Canada, Mexico and China Will Come Saturday - TIME"
  ],
  [
    1738353676000,
    "US envoy calls China's presence around Panama Canal a security concern - Reuters"
  ],
  [
    1738357077000,
    "Here's how tariffs on Canada, China and Mexico may impact U.S. consumers - CNBC"
  ],
  [
    1738360234000,
    "Former Federal Reserve adviser arrested for passing trade secrets to China, Justice Department says - Reuters"
  ],
  [
    1738361193000,
    "US deportations to China continue amid shifts in immigration crackdown - VOA Asia"
  ],
  [
    1738361491000,
    "US charges former Fed official with spying for China - South China Morning Post"
  ],
  [
    1738364625000,
    "Consumers brace for impact of China tariffs - VOA Asia"
  ],
  [
    1738365875000,
    "Not 10 Feet Tall: Experts Say China’s Military Faces Major Issues - Air & Space Forces Magazine"
  ],
  [
    1738367430000,
    "What we know about Trump's plan to slap tariffs on Mexico, Canada and China - PBS NewsHour"
  ],
  [
    1738367575000,
    "Trump tariffs: President to hit Canada, Mexico and China with tariffs - BBC.com"
  ],
  [
    1738386016000,
    "Donald Trump’s China claims roil Panama as Marco Rubio visits - Financial Times"
  ],
  [
    1738386120000,
    "Trump: Nothing Canada, Mexico or China can do to delay Feb 1 tariffs - Reuters Canada"
  ],
  [
    1738393200000,
    "Can China’s Economy Wriggle Out of Danger? It’s Up to Xi and Trump. - Barron's"
  ],
  [
    1738404691000,
    "Trump's tariffs on Mexico, Canada, China would sock economy, lift inflation - USA TODAY"
  ],
  [
    1738405039000,
    "Rubio to focus on curbing immigration, countering China in Latin America - ABC News"
  ],
  [
    1738413900000,
    "Trump’s tariffs on Canada, Mexico and China: will they spark a trade war? - The Guardian US"
  ],
  [
    1738414807000,
    "China is surely ready to respond to Trump’s fresh tariffs, analysts say - South China Morning Post"
  ],
  [
    1738418018000,
    "Trump Signs Orders Imposing Tariffs on Canada, Mexico and China - The New York Times"
  ],
  [
    1738424319000,
    "Trump’s Tariffs on Canada, Mexico, and China Could Mean Higher Inflation and Economic Disruption - TIME"
  ],
  [
    1738425604000,
    "What could Trump's tariffs on Mexico, Canada and China mean for consumers? Here's what to know - NBC Chicago"
  ],
  [
    1738426377000,
    "I Followed My Stolen iPhone Across The World, Became A Celebrity In China, And Found A Friend For Life - BuzzFeed"
  ],
  [
    1738426944000,
    "Trump tariffs: US hits Mexico, Canada and China with import taxes - live updates - BBC.com"
  ],
  [
    1738427520000,
    "Trump’s tariffs on Mexico, Canada and China take effect Saturday - WBAL TV Baltimore"
  ],
  [
    1738443600000,
    "How American tech companies built China into an AI powerhouse - The Hill"
  ],
  [
    1738445408000,
    "Opinion | Why Beijing must move on from ‘Made in China 2025’ success - South China Morning Post"
  ],
  [
    1738447576000,
    "Trump Hits China, Canada, Mexico With Tariffs in Trade War - Bloomberg"
  ],
  [
    1738447633000,
    "Trump slaps tariffs on Mexico, Canada and China - CNBC"
  ],
  [
    1738448220000,
    "Trump slaps tariffs on Canada, Mexico, China, risking higher prices for U.S. consumers - NBC News"
  ],
  [
    1738448760000,
    "Former Federal Reserve adviser indicted and arrested for alleged espionage in dealings with China - The Associated Press"
  ],
  [
    1738448892000,
    "Former Federal Reserve official accused of passing secrets to China - Financial Times"
  ],
  [
    1738448940000,
    "Canada and Mexico hit back after Trump signs order for punishing tariffs - The Guardian US"
  ],
  [
    1738449180000,
    "Trump Signs New Tariffs On Canada, Mexico And China—Here’s What To Know - Forbes"
  ],
  [
    1738449579000,
    "See How Much the U.S. Trades With China, Canada and Mexico - The New York Times"
  ],
  [
    1738450385000,
    "Trump imposes tariffs on Canada, Mexico and China, raising prospect of higher costs for US - KEPR 19"
  ],
  [
    1738450759000,
    "Trump announces significant new tariffs on Mexico, Canada and China, sparking retaliatory actions - CNN"
  ],
  [
    1738450797000,
    "Trump signs executive orders imposing steep tariffs on China, Canada and Mexico - South China Morning Post"
  ],
  [
    1738450811000,
    "Trump imposes tariffs on Mexico, Canada, China linked to fentanyl crisis - UPI News"
  ],
  [
    1738450860000,
    "Bill Maher declares China ‘the new Islam,’ says left can’t be honest about the country’s threat - New York Post"
  ],
  [
    1738451178000,
    "Trump imposes steep tariffs on Canada, Mexico, and China. Will it sabotage economic growth? - The Christian Science Monitor"
  ],
  [
    1738454533000,
    "'The coming weeks will be difficult': Mexico, Canada respond to Trump's tariffs - ABC News"
  ],
  [
    1738457160000,
    "'Tariffs are not the answer': Industry and corporate leaders react to Trump duties on Mexico, Canada and China - CNBC"
  ],
  [
    1738459800000,
    "Trump enacts tariffs on America's largest trading partners, China, Mexico and Canada - CBS News"
  ],
  [
    1738460640000,
    "Here’s what will get more expensive from Trump’s tariffs on Mexico, Canada and China - CNN"
  ],
  [
    1738461477000,
    "Trump finalizes tariffs on Canada, Mexico, China, triggering likely trade war - POLITICO"
  ],
  [
    1738462500000,
    "Trump imposes 25% tariffs on Canada and Mexico; China is hit with 10% - USA TODAY"
  ],
  [
    1738464113000,
    "Donald Trump hits Canada, Mexico and China with steep tariffs - Financial Times"
  ],
  [
    1738464360000,
    "Canada, Mexico and China slam Trump's tariffs - NBC News"
  ],
  [
    1738464480000,
    "Reaction to Trump's imposition of tariffs on Mexico, Canada, China - Reuters"
  ],
  [
    1738464960000,
    "Mexico and Canada order retaliatory tariffs after Trump starts trade war - Los Angeles Times"
  ],
  [
    1738465253000,
    "Executive Order—Imposing Duties to Address the Synthetic Opioid Supply Chain in the People's Republic of China - The American Presidency Project"
  ],
  [
    1738465380000,
    "China firmly deplores and opposes US tariff move: China's FM, MOFCOM, CCPIT - Global Times"
  ],
  [
    1738465868000,
    "China vows retaliation on Trump tariffs, says 'no winners in trade war' - Hindustan Times"
  ],
  [
    1738466893000,
    "China hits back at US tariffs with vow to take case to the WTO - South China Morning Post"
  ],
  [
    1738469700000,
    "Trump Tariffs Target Loophole Used by Chinese Online Retailers - Bloomberg"
  ],
  [
    1738469925000,
    "Canada and Mexico Move to Retaliate on Trump Tariff Orders - The New York Times"
  ],
  [
    1738470122000,
    "China Assails Trump Tariffs and Threatens Legal Case With the W.T.O. - The New York Times"
  ],
  [
    1738470840000,
    "Trudeau answers after Trump imposes tariffs on goods from Canada, China and Mexico - NBC News"
  ],
  [
    1738470918000,
    "Trump says Canada, Mexico, China tariffs may bring 'pain' - DW (English)"
  ],
  [
    1738472100000,
    "China Vows Measures Against US Tariffs, Threatens WTO Action - Bloomberg"
  ],
  [
    1738472438000,
    "DeepSeek’s success will undermine the US-China tech war - Financial Times"
  ],
  [
    1738472465000,
    "DeepSeek A.I. Is a Win for China, but a Danger to Party Control - The New York Times"
  ],
  [
    1738472472000,
    "How US Tariffs Challenge China - The New York Times"
  ],
  [
    1738472472000,
    "Trump’s Tariffs Put China in a Difficult Spot - The New York Times"
  ],
  [
    1738472473000,
    "The ‘David and Goliath’ fight over China’s London mega-embassy - Financial Times"
  ],
  [
    1738473541000,
    "Mexico, Canada respond to Trump's tariffs: 'Difficult times' are ahead - ABC News"
  ],
  [
    1738474032000,
    "China 'firmly' opposes US tariff move, vows countermeasures to protect interests - Anadolu Agency | English"
  ],
  [
    1738474380000,
    "China vows to sue U.S. over Trump's tariff policy - Nikkei Asia"
  ],
  [
    1738476015000,
    "China’s Type 055 destroyer can stop US fleet with unmanned ‘kill web’: study - South China Morning Post"
  ],
  [
    1738477814000,
    "Donald Trump Hits China With Tariffs: Here's How Much Trade Is At Stake - NDTV"
  ],
  [
    1738478700000,
    "Experts react: Trump just slapped tariffs on Mexico, Canada, and China. What’s next? - Atlantic Council"
  ],
  [
    1738479993000,
    "China threatens countermeasures to combat Trump tariffs - Financial Times"
  ],
  [
    1738481220000,
    "US businesses brace for Trump’s tariffs on Canada, Mexico and China to drive up costs - The Associated Press"
  ],
  [
    1738484521000,
    "China denounces Trump tariff: 'Fentanyl is America's problem' - Reuters.com"
  ],
  [
    1738488059000,
    "China box office sets revenue record as sequels help overcome economic malaise - Reuters.com"
  ],
  [
    1738490340000,
    "China to retaliate after Trump fires first salvo in trade war - POLITICO Europe"
  ],
  [
    1738493891000,
    "'It doesn't have to be this way': Canada, Mexico, China and the EU respond to Trump's tariffs - CNBC"
  ],
  [
    1738495251000,
    "Canada, Mexico Hit Back at Trump Tariffs, China Vows Action - Yahoo Finance"
  ],
  [
    1738495380000,
    "Trump puts tariffs on Canada, Mexico and China, spurring trade war as North American allies respond - The Associated Press"
  ],
  [
    1738497600000,
    "President Trump Imposes 25% Tariffs on Canada and Mexico, and 10% Tariffs on China - White & Case LLP"
  ],
  [
    1738499346000,
    "US taxes imports from Canada, Mexico and China as Trump's tariffs begin - BBC.com"
  ],
  [
    1738500480000,
    "China to file lawsuit with WTO, vows ‘countermeasures’ in response to Trump tariffs - The Hill"
  ],
  [
    1738503631000,
    "Xi Weighs Retaliation After Trump Hits China With 10% Tariff - Bloomberg"
  ],
  [
    1738503718000,
    "China Hits Back at Donald Trump Tariffs: 'Serious Violation' - Newsweek"
  ],
  [
    1738505438000,
    "Donald Trump’s new trade war on China is also an opioid war - The Economist"
  ],
  [
    1738506769000,
    "DHS Sec. Kristi Noem says Canada, Mexico and China ‘will feel pain’ of tariffs: Full interview - NBC News"
  ],
  [
    1738507041000,
    "Canada and Mexico Under Attack: The China Solution - Center for Economic and Policy Research -"
  ],
  [
    1738508619000,
    "Trump tariff met with mixed reactions from China - VOA Asia"
  ],
  [
    1738509075000,
    "Global alarm, condemnation as Trump tariffs hit Mexico, Canada and China - Al Jazeera English"
  ],
  [
    1738509588000,
    "How have Canada, China and Mexico responded to Trump’s tariffs? - Al Jazeera English"
  ],
  [
    1738513920000,
    "Here are some goods in the crosshairs of Trump’s tariffs on Mexico, Canada and China - The Associated Press"
  ],
  [
    1738516852000,
    "Trump stretches trade law boundaries with Canada, Mexico, China tariffs - Reuters"
  ],
  [
    1738517200000,
    "On GPS: China is ready for a bigger trade war - CNN"
  ],
  [
    1738517237000,
    "On GPS: What explains China’s economic troubles? - CNN"
  ],
  [
    1738521390000,
    "Trump's Canada, Mexico, China tariffs suspend loophole behind fentanyl shipments - Yahoo! Voices"
  ],
  [
    1738523772000,
    "Trump says Americans could feel 'some pain' as he calls for tariffs on Canada, China, Mexico - USA TODAY"
  ],
  [
    1738524060000,
    "Live updates: Lawmakers talk Trump tariffs on Mexico, Canada, China - The Hill"
  ],
  [
    1738525980000,
    "China has a 'trick up its sleeve' to fight Trump's tariff as Beijing keeps response muted for now, former IMF adviser says - Fortune"
  ],
  [
    1738530714000,
    "Panama president defends sovereignty as US warns of action over China’s influence on canal - Anadolu Agency | English"
  ],
  [
    1738531130000,
    "US top diplomat warns Panama to reduce Chinese business interests in Canal - FRANCE 24 English"
  ],
  [
    1738531577000,
    "Rubio presses Panama to reduce Chinese influence over its canal or face U.S. ‘measures’ - PBS NewsHour"
  ],
  [
    1738531719000,
    "Canada, China, Mexico and the art of retaliation - The Economist"
  ],
  [
    1738532700000,
    "Secretary of State Marco Rubio warns Panama's president about Chinese influence over the Panama Canal - NBC News"
  ],
  [
    1738532810000,
    "Trump hits Canada, Mexico and China with steep new tariffs, says Americans could feel \"some pain\" - CBS News"
  ],
  [
    1738533600000,
    "Trump's antagonism risks pushing U.S. allies closer to China - NBC News"
  ],
  [
    1738537492000,
    "Rubio warns Panama of U.S. retaliation if China's canal influence remains - Axios"
  ],
  [
    1738538013000,
    "Rubio demands Panama 'reduce China influence' over canal - BBC.com"
  ],
  [
    1738540200000,
    "More China tariffs needed, says Trump's former trade chief, who calls the country an \"existential threat\" - CBS News"
  ],
  [
    1738540200000,
    "Trump's former trade chief says China is a threat, tariffs are necessary - CBS News"
  ],
  [
    1738540211000,
    "Rubio tells Panama to end China's influence of canal or face US action - Reuters Canada"
  ],
  [
    1738541760000,
    "Trump says EU tariffs will ‘definitely happen’ as Mexico, Canada and China retaliate - The Guardian US"
  ],
  [
    1738544749000,
    "Rubio warns of U.S. action if Panama does not curb Chinese influence around the canal - NPR"
  ],
  [
    1738548000000,
    "Trump says Americans could feel 'pain' in trade war with Mexico, Canada, China - Reuters"
  ],
  [
    1738548060000,
    "China factory activity growth slows in January, Caixin PMI shows - Reuters.com"
  ],
  [
    1738548180000,
    "China's January factory growth misses expectations as exports decline ahead of U.S. tariffs, Caixin PMI shows - CNBC"
  ],
  [
    1738548830000,
    "Won't renew Belt and Road deal with China, says Panama president amid US pressure - The Economic Times"
  ],
  [
    1738551000000,
    "Panama pledges to end key canal deal with China, work with US after Rubio visit - Fox News"
  ],
  [
    1738556511000,
    "China building world’s biggest military base in prep for US war - Asia Times"
  ],
  [
    1738557000000,
    "Taiwan and China need peace given 'multifold changes' internationally, president says - Reuters.com"
  ],
  [
    1738562190000,
    "China to propose restoring 2020 'Phase 1' trade deal with US, WSJ reports - Reuters"
  ],
  [
    1738564781000,
    "China tariffs deadline looms after Trump agrees reprieves with Canada and Mexico - BBC.com"
  ],
  [
    1738564793000,
    "Shein: Chinese fashion giant re-enters India five years after ban - BBC.com"
  ],
  [
    1738568770000,
    "China renews threat to retaliate against US tariffs - ABC News"
  ],
  [
    1738570989000,
    "China Stocks in Hong Kong Drop Post-Holiday on Trump 10% Tariff - Bloomberg"
  ],
  [
    1738570989000,
    "Chinese stocks in Hong Kong outperform peers as tech shares gain - Yahoo Finance"
  ],
  [
    1738573200000,
    "Trump's 'denuclearization' suggestion with Russia and China: How would it work? - Fox News"
  ],
  [
    1738574241000,
    "Trump Says Anybody Against His Tariffs 'Controlled by China' - Newsweek"
  ],
  [
    1738575142000,
    "New Unreported Submarine In China Leaves West Guessing - Naval News"
  ],
  [
    1738575288000,
    "For China, Trump’s Moves Bring Pain, but Also Potential Gains - The New York Times"
  ],
  [
    1738575319000,
    "DeepSeek signals China’s rising influence in AI — and AI drug development - STAT"
  ],
  [
    1738575660000,
    "China Box Office: ‘Ne Zha 2’ Leads Massive Lunar New Year Surge to $1.2 Billion as Imax Breaks Records - Variety"
  ],
  [
    1738578139000,
    "How should China respond to Trump? Ask DeepSeek - Reuters"
  ],
  [
    1738578600000,
    "Manufacturing Towns Hit by the ‘China Shock’ Bounced Back. The Workers Didn’t. - The Wall Street Journal"
  ],
  [
    1738578600000,
    "Estée Lauder’s $100 billion meltdown: How a big bet on China helped drag down shares in the luxury beauty titan - Fortune"
  ],
  [
    1738580400000,
    "Is DeepSeek China’s Sputnik Moment? - The New Yorker"
  ],
  [
    1738583428000,
    "Trump and Musk’s USAID ‘Shut Down’ Threat Opens Door for China - Bloomberg"
  ],
  [
    1738583807000,
    "Trump defends tariffs as Mexico, Canada and China plan retaliation - NewsNation Now"
  ],
  [
    1738585740000,
    "Trump fired the latest tariff shot at China. Is Beijing prepared to make it a trade war? - CNN"
  ],
  [
    1738588531000,
    "China announces retaliatory action as Trump tariffs take effect - BBC.com"
  ],
  [
    1738590600000,
    "China to pitch return to 'Phase One' Trump trade deal after warning US to 'correct its wrongdoings' - New York Post"
  ],
  [
    1738591200000,
    "A red moon: Will the next 'Sputnik Moment' be made in China? - Space.com"
  ],
  [
    1738591200000,
    "The Chinese AI companies that could match DeepSeek’s impact - The Guardian"
  ],
  [
    1738592883000,
    "Chinese officials vow countermeasures to Trump’s tariffs - NBC News"
  ],
  [
    1738595580000,
    "China Has Gotten Off Lightly on Tariffs—for Now - The Wall Street Journal"
  ],
  [
    1738596600000,
    "I bought a container full of Chinese electric excavators. Here’s what showed up - Electrek.co"
  ],
  [
    1738596960000,
    "JD Vance says Trump administration eyeing China crackdowns, with stocks in crosshairs - Fox Business"
  ],
  [
    1738597860000,
    "World reacts to Trump's order for tariffs on Canada, Mexico and China, as he warns Europe will be next - CBS News"
  ],
  [
    1738600860000,
    "Beijing residents speak about Trump’s trade tariffs on China - CNN"
  ],
  [
    1738600958000,
    "Trump's tariffs on Canada, Mexico, and China would cost the typical US household over $1,200 a year - Peterson Institute for International Economics"
  ],
  [
    1738600974000,
    "Chinese Embassy in Panama Reacts to Rubio's China Threat - Newsweek"
  ],
  [
    1738601985000,
    "What to know about China’s role in the fentanyl crisis - The Washington Post"
  ],
  [
    1738603740000,
    "Panama to end relationship with China’s premier foreign investment program after US pressure - New York Post"
  ],
  [
    1738605640000,
    "Global markets brace for chaos ahead of Trump's tariffs on Canada and China - NBC News"
  ],
  [
    1738607941000,
    "Trump tariffs may impact these items from Canada, Mexico and China. Who ends up paying? - Austin American-Statesman"
  ],
  [
    1738609963000,
    "Apple shares fall on concern Trump tariffs on China will hit profit - CNBC"
  ],
  [
    1738610357000,
    "Exclusive: US 'aware' of reports Iran trying to ship missile propellant chemical from China - VOA Asia"
  ],
  [
    1738611477000,
    "US hits Canada, Mexico, and China with significant new tariffs – implementation delayed by 30 days for Canada and Mexico - Dentons"
  ],
  [
    1738612876000,
    "What DeepSeek Revealed About the Future of U.S.-China Competition - Foreign Policy"
  ],
  [
    1738614910000,
    "Trump's China tariffs are likely to drive up drug prices and spur shortages - NBC News"
  ]
]