[
  [
    1738516852000,
    "Trump stretches trade law boundaries with Canada, Mexico, China tariffs - Reuters"
  ],
  [
    1738517200000,
    "On GPS: China is ready for a bigger trade war - CNN"
  ],
  [
    1738517237000,
    "On GPS: What explains China’s economic troubles? - CNN"
  ],
  [
    1738521390000,
    "Trump's Canada, Mexico, China tariffs suspend loophole behind fentanyl shipments - Yahoo! Voices"
  ],
  [
    1738523772000,
    "Trump says Americans could feel 'some pain' as he calls for tariffs on Canada, China, Mexico - USA TODAY"
  ],
  [
    1738524060000,
    "Live updates: Lawmakers talk Trump tariffs on Mexico, Canada, China - The Hill"
  ],
  [
    1738525980000,
    "China has a 'trick up its sleeve' to fight Trump's tariff as Beijing keeps response muted for now, former IMF adviser says - Fortune"
  ],
  [
    1738530714000,
    "Panama president defends sovereignty as US warns of action over China’s influence on canal - Anadolu Agency | English"
  ],
  [
    1738531130000,
    "US top diplomat warns Panama to reduce Chinese business interests in Canal - FRANCE 24 English"
  ],
  [
    1738531577000,
    "Rubio presses Panama to reduce Chinese influence over its canal or face U.S. ‘measures’ - PBS NewsHour"
  ],
  [
    1738531719000,
    "Canada, China, Mexico and the art of retaliation - The Economist"
  ],
  [
    1738532700000,
    "Secretary of State Marco Rubio warns Panama's president about Chinese influence over the Panama Canal - NBC News"
  ],
  [
    1738532810000,
    "Trump hits Canada, Mexico and China with steep new tariffs, says Americans could feel \"some pain\" - CBS News"
  ],
  [
    1738533600000,
    "Trump's antagonism risks pushing U.S. allies closer to China - NBC News"
  ],
  [
    1738537492000,
    "Rubio warns Panama of U.S. retaliation if China's canal influence remains - Axios"
  ],
  [
    1738538013000,
    "Rubio demands Panama 'reduce China influence' over canal - BBC.com"
  ],
  [
    1738540200000,
    "More China tariffs needed, says Trump's former trade chief, who calls the country an \"existential threat\" - CBS News"
  ],
  [
    1738540200000,
    "Trump's former trade chief says China is a threat, tariffs are necessary - CBS News"
  ],
  [
    1738540211000,
    "Rubio tells Panama to end China's influence of canal or face US action - Reuters Canada"
  ],
  [
    1738541760000,
    "Trump says EU tariffs will ‘definitely happen’ as Mexico, Canada and China retaliate - The Guardian US"
  ],
  [
    1738544749000,
    "Rubio warns of U.S. action if Panama does not curb Chinese influence around the canal - NPR"
  ],
  [
    1738548000000,
    "Trump says Americans could feel 'pain' in trade war with Mexico, Canada, China - Reuters"
  ],
  [
    1738548060000,
    "China factory activity growth slows in January, Caixin PMI shows - Reuters.com"
  ],
  [
    1738548180000,
    "China's January factory growth misses expectations as exports decline ahead of U.S. tariffs, Caixin PMI shows - CNBC"
  ],
  [
    1738548830000,
    "Won't renew Belt and Road deal with China, says Panama president amid US pressure - The Economic Times"
  ],
  [
    1738551000000,
    "Panama pledges to end key canal deal with China, work with US after Rubio visit - Fox News"
  ],
  [
    1738556511000,
    "China building world’s biggest military base in prep for US war - Asia Times"
  ],
  [
    1738557000000,
    "Taiwan and China need peace given 'multifold changes' internationally, president says - Reuters.com"
  ],
  [
    1738562190000,
    "China to propose restoring 2020 'Phase 1' trade deal with US, WSJ reports - Reuters"
  ],
  [
    1738564781000,
    "China tariffs deadline looms after Trump agrees reprieves with Canada and Mexico - BBC.com"
  ],
  [
    1738564793000,
    "Shein: Chinese fashion giant re-enters India five years after ban - BBC.com"
  ],
  [
    1738568770000,
    "China renews threat to retaliate against US tariffs - ABC News"
  ],
  [
    1738570989000,
    "China Stocks in Hong Kong Drop Post-Holiday on Trump 10% Tariff - Bloomberg"
  ],
  [
    1738570989000,
    "Chinese stocks in Hong Kong outperform peers as tech shares gain - Yahoo Finance"
  ],
  [
    1738573200000,
    "Trump's 'denuclearization' suggestion with Russia and China: How would it work? - Fox News"
  ],
  [
    1738574241000,
    "Trump Says Anybody Against His Tariffs 'Controlled by China' - Newsweek"
  ],
  [
    1738575142000,
    "New Unreported Submarine In China Leaves West Guessing - Naval News"
  ],
  [
    1738575288000,
    "For China, Trump’s Moves Bring Pain, but Also Potential Gains - The New York Times"
  ],
  [
    1738575319000,
    "DeepSeek signals China’s rising influence in AI — and AI drug development - STAT"
  ],
  [
    1738575660000,
    "China Box Office: ‘Ne Zha 2’ Leads Massive Lunar New Year Surge to $1.2 Billion as Imax Breaks Records - Variety"
  ],
  [
    1738578139000,
    "How should China respond to Trump? Ask DeepSeek - Reuters"
  ],
  [
    1738578600000,
    "Manufacturing Towns Hit by the ‘China Shock’ Bounced Back. The Workers Didn’t. - The Wall Street Journal"
  ],
  [
    1738578600000,
    "Estée Lauder’s $100 billion meltdown: How a big bet on China helped drag down shares in the luxury beauty titan - Fortune"
  ],
  [
    1738580400000,
    "Is DeepSeek China’s Sputnik Moment? - The New Yorker"
  ],
  [
    1738583428000,
    "Trump and Musk’s USAID ‘Shut Down’ Threat Opens Door for China - Bloomberg"
  ],
  [
    1738583807000,
    "Trump defends tariffs as Mexico, Canada and China plan retaliation - NewsNation Now"
  ],
  [
    1738585740000,
    "Trump fired the latest tariff shot at China. Is Beijing prepared to make it a trade war? - CNN"
  ],
  [
    1738588531000,
    "China announces retaliatory action as Trump tariffs take effect - BBC.com"
  ],
  [
    1738588531000,
    "Trump's 10% tariff on China begins as Beijing plans retaliation on US energy and some cars - BBC.com"
  ],
  [
    1738590600000,
    "China to pitch return to 'Phase One' Trump trade deal after warning US to 'correct its wrongdoings' - New York Post"
  ],
  [
    1738591200000,
    "A red moon: Will the next 'Sputnik Moment' be made in China? - Space.com"
  ],
  [
    1738591200000,
    "The Chinese AI companies that could match DeepSeek’s impact - The Guardian"
  ],
  [
    1738592883000,
    "Chinese officials vow countermeasures to Trump’s tariffs - NBC News"
  ],
  [
    1738595580000,
    "China Has Gotten Off Lightly on Tariffs—for Now - The Wall Street Journal"
  ],
  [
    1738596600000,
    "I bought a container full of Chinese electric excavators. Here’s what showed up - Electrek.co"
  ],
  [
    1738596960000,
    "JD Vance says Trump administration eyeing China crackdowns, with stocks in crosshairs - Fox Business"
  ],
  [
    1738597860000,
    "World reacts to Trump's order for tariffs on Canada, Mexico and China, as he warns Europe will be next - CBS News"
  ],
  [
    1738600860000,
    "Beijing residents speak about Trump’s trade tariffs on China - CNN"
  ],
  [
    1738600958000,
    "Trump's tariffs on Canada, Mexico, and China would cost the typical US household over $1,200 a year - Peterson Institute for International Economics"
  ],
  [
    1738600974000,
    "Chinese Embassy in Panama Reacts to Rubio's China Threat - Newsweek"
  ],
  [
    1738601985000,
    "What to know about China’s role in the fentanyl crisis - The Washington Post"
  ],
  [
    1738603740000,
    "Panama to end relationship with China’s premier foreign investment program after US pressure - New York Post"
  ],
  [
    1738605640000,
    "Global markets brace for chaos ahead of Trump's tariffs on Canada and China - NBC News"
  ],
  [
    1738607941000,
    "Trump tariffs may impact these items from Canada, Mexico and China. Who ends up paying? - Austin American-Statesman"
  ],
  [
    1738609963000,
    "Apple shares fall on concern Trump tariffs on China will hit profit - CNBC"
  ],
  [
    1738610357000,
    "Exclusive: US 'aware' of reports Iran trying to ship missile propellant chemical from China - VOA Asia"
  ],
  [
    1738611477000,
    "US hits Canada, Mexico, and China with significant new tariffs – implementation delayed by 30 days for Canada and Mexico - Dentons"
  ],
  [
    1738611924000,
    "How will the Biden administration’s China policy be remembered? - Brookings Institution"
  ],
  [
    1738612569000,
    "Rubio hails Panama's move to exit Chinese infrastructure plan - Reuters"
  ],
  [
    1738612876000,
    "What DeepSeek Revealed About the Future of U.S.-China Competition - Foreign Policy"
  ],
  [
    1738614910000,
    "Trump's China tariffs are likely to drive up drug prices and spur shortages - NBC News"
  ],
  [
    1738616696000,
    "'Good opportunity' for Rubio, Wang to meet at UN on Feb. 18, says China's UN envoy - Reuters"
  ],
  [
    1738624028000,
    "Trump to speak with China's Xi after hiking tariffs, White House says - Reuters"
  ],
  [
    1738626071000,
    "Stocks, dollar stumble as China quickly hits back at US tariffs - Reuters"
  ],
  [
    1738630380000,
    "China Tightens Critical-Mineral Export Controls - The Wall Street Journal"
  ],
  [
    1738630380000,
    "Why China's Retaliatory Moves Aren't Very Painful for the U.S. So Far - The Wall Street Journal"
  ],
  [
    1738630920000,
    "US says packages from China to face formal customs entry under new tariffs - Reuters"
  ],
  [
    1738631414000,
    "Trump's tariffs: China strikes back with levies of up to 15% - DW (English)"
  ],
  [
    1738638060000,
    "Trump's tariff reprieve to bring relief to rupee; focus on China - Reuters"
  ],
  [
    1738638480000,
    "Rubio welcomes Panama’s move to exit Chinese infrastructure plan as ‘great step forward’ - The Guardian"
  ],
  [
    1738638840000,
    "Trump agrees to pause tariffs on Canada and Mexico after they pledge to boost border enforcement - The Associated Press"
  ],
  [
    1738639980000,
    "Trump Plans to Speak With Xi as Deadline for China Tariffs Looms - Bloomberg"
  ],
  [
    1738645260000,
    "Trump 10% Tariffs on China Set to Take Effect as Deadline Passes - Bloomberg"
  ],
  [
    1738645320000,
    "Trump’s new 10% tariffs on China take effect — Beijing responds with retaliatory taxes on US imports - New York Post"
  ],
  [
    1738645752000,
    "China Strikes Back After Trump Imposes 10% Tariff on Goods - The New York Times"
  ],
  [
    1738645752000,
    "China Counters Trump’s Tariffs As Talks Remain in Limbo - The New York Times"
  ],
  [
    1738645851000,
    "China to impose tariffs on US products, launches anti-monopoly probe into Google - South China Morning Post"
  ],
  [
    1738646040000,
    "China unveils US tariffs and Google investigation in response to Trump levies - The Guardian US"
  ],
  [
    1738646056000,
    "China retaliates with additional tariffs of up to 15% on select U.S. imports starting Feb. 10 - CNBC"
  ],
  [
    1738646880000,
    "China's finance ministry announces tariffs to counter Trump trade moves - Reuters"
  ],
  [
    1738647660000,
    "China hits back at Trump with new tariff on U.S. products - NBC News"
  ],
  [
    1738648413000,
    "China to launch probe into Google over alleged antitrust violations - CNBC"
  ],
  [
    1738648620000,
    "China puts PVH Corp, Illumina on its unreliable entity list - Reuters"
  ],
  [
    1738648680000,
    "China retaliates with tariffs on some US goods and a probe into Google - Business Insider"
  ],
  [
    1738649580000,
    "Reactions to China's tit-for-tat tariffs - Reuters"
  ],
  [
    1738649749000,
    "Trump agrees to pause tariffs on Canada and Mexico but not on China - BBC.com"
  ],
  [
    1738650600000,
    "China Announces Counter Measures Against U.S. - TIME"
  ],
  [
    1738651440000,
    "These Are All the US Goods China Is Targeting With Tariffs - Bloomberg"
  ],
  [
    1738651594000,
    "China retaliates against US tariffs with tariffs, probes, WTO complaint - Le Monde"
  ],
  [
    1738653080000,
    "China hits back against Trump tariffs with retaliatory measures, renewing trade war - FRANCE 24 English"
  ],
  [
    1738653317000,
    "China hits US with retaliatory tariffs - WJTV"
  ],
  [
    1738653360000,
    "China plans to send a flying robot to search for water on the moon’s far side - CNN"
  ],
  [
    1738653551000,
    "China Counters Trump, Imposes 15% Tariff On Coal, Gas Imports From US - NDTV"
  ],
  [
    1738654090000,
    "Trump sows uncertainty - and Xi Jinping sees an opportunity - BBC.com"
  ],
  [
    1738655550000,
    "China retaliates with tariffs on US goods after Trump’s move - Al Jazeera English"
  ],
  [
    1738657346000,
    "China targets U.S. coal, gas, Google as Trump tariffs take effect - NPR"
  ],
  [
    1738658040000,
    "China hits back at Trump’s tariffs with an antitrust investigation into Google and a new 15% tax on U.S. coal and gas - Fortune"
  ],
  [
    1738659314000,
    "VOA Mandarin: China reacts to Panama quitting BRI - VOA Asia"
  ],
  [
    1738661216000,
    "How China is playing to win Trump’s trade war - Asia Times"
  ],
  [
    1738661280000,
    "US and Philippine fighter aircraft jointly patrol disputed shoal region guarded by China - The Associated Press"
  ],
  [
    1738662600000,
    "China responds with tariffs on US goods after Trump's tariffs on Chinese imports take effect - Fox Business"
  ],
  [
    1738664760000,
    "Trump Tariffs Live Updates: China Responds With Retaliatory Tariffs, Export Controls And Google Probe - Forbes"
  ],
  [
    1738670004000,
    "What are the five critical metal exports restricted by China? - Reuters"
  ],
  [
    1738670013000,
    "China Immediately Hits Back at Trump Tariffs With Levies, Google Probe - Investopedia"
  ],
  [
    1738670429000,
    "Breakingviews - Tariff whiplash fires up China stimulus games - Reuters"
  ],
  [
    1738670514000,
    "Xi’s Careful Reply to Trump Tariffs Shows China Has More to Lose - Bloomberg"
  ],
  [
    1738670663000,
    "China Swiftly Responds to Trump’s Tariffs With a Range of Measures - The New York Times"
  ],
  [
    1738670856000,
    "China expands key mineral export controls after US imposes tariffs - Reuters"
  ],
  [
    1738670895000,
    "China hits U.S. with tariffs and Elon Musk's influence and access questioned: Morning Rundown - NBC News"
  ],
  [
    1738673708000,
    "Trump tariffs: Beijing hits back – can China and US avoid trade war escalation? - BBC.com"
  ],
  [
    1738673887000,
    "China's curbs on exports of strategic minerals - Reuters"
  ],
  [
    1738673996000,
    "China kills energy trade with the US, but initial impact is limited - Reuters"
  ],
  [
    1738675105000,
    "China strikes back at Trump, retaliating with new tariffs as it 'firmly opposes' US plan - ABC News"
  ],
  [
    1738675543000,
    "Coal and gas among US targets of China's retaliatory tariffs - BBC.com"
  ],
  [
    1738676573000,
    "China hits back with levies on US products after Trump's tariffs take effect - USA TODAY"
  ],
  [
    1738677150000,
    "China hits back as Trump’s tariffs go into effect - CNN"
  ],
  [
    1738679794000,
    "What tariffs is China imposing on the US – and why are they significant? - Al Jazeera English"
  ],
  [
    1738680033000,
    "Five ways China is hitting back against US tariffs - BBC.com"
  ],
  [
    1738682482000,
    "Merck stops Gardasil shipments to China, hitting 2025 outlook; shares tumble - Yahoo Finance"
  ],
  [
    1738682570000,
    "Air cargo industry jolted by Trump tariffs on Chinese e-commerce - FreightWaves"
  ],
  [
    1738683060000,
    "China launches an antitrust probe into Google. Here’s what it means - The Associated Press"
  ],
  [
    1738683287000,
    "Trump tariffs updates: China retaliates with levies against US - Al Jazeera English"
  ],
  [
    1738683655000,
    "China and the Future of Global Supply Chains - Rhodium Group"
  ],
  [
    1738684706000,
    "China announces measures against Google, other US firms, as trade tensions escalate - Reuters"
  ],
  [
    1738686300000,
    "China has reacted in kind to Trump’s tariffs, but a deal may still emerge - The Guardian"
  ],
  [
    1738687980000,
    "Big tech to tungsten: what industries are the focus of China’s new US tariffs? - The Guardian"
  ],
  [
    1738688385000,
    "‘Treat others the same way they treat us’: China reacts to US trade tariffs - CNN"
  ],
  [
    1738688782000,
    "China tariff retaliation targets its modest US energy imports - Reuters"
  ],
  [
    1738691498000,
    "China Tariffs: Here’s What May Cost More In The US - Forbes"
  ],
  [
    1738691949000,
    "WHO Faces China Pushback On Member State Fee Increase - Even After Slashing Budget Following US Exit - Health Policy Watch"
  ],
  [
    1738694809000,
    "With China’s Antitrust Investigation Into Google, What’s at Stake? - The New York Times"
  ],
  [
    1738697116000,
    "Why India isn’t winning the contest with China - The Economist"
  ],
  [
    1738699227000,
    "De minimis shipping from China axed under Trump tariffs - Supply Chain Dive"
  ],
  [
    1738700925000,
    "US dollar edges lower as China tariffs kick in - Reuters"
  ],
  [
    1738704467000,
    "Trump downplays China’s retaliatory tariffs, ‘in no rush’ to talk to Xi - South China Morning Post"
  ],
  [
    1738705220000,
    "Wednesday Briefing: China Hits Back Against U.S. Tariffs - The New York Times"
  ],
  [
    1738706809000,
    "Trade war with China casts dark cloud over new US LNG projects - Reuters"
  ],
  [
    1738708302000,
    "Trump 2.0: U.S. Tariffs on China Take Effect; Mexico and Canada Granted 30-Day Pause - Global Trade & Sanctions Law"
  ],
  [
    1738709195000,
    "Trump in ‘no rush’ to talk to Chinese leader Xi - POLITICO"
  ],
  [
    1738711620000,
    "Trump Tariff News, Feb. 4, 2025: U.S. President, Xi Won't Speak Tuesday After China Retaliates - The Wall Street Journal"
  ],
  [
    1738712035000,
    "U.S. Trade Actions in China and Canada - NPR"
  ],
  [
    1738713023000,
    "China responds to Trump with retaliatory tariffs and Google antitrust probe - PBS NewsHour"
  ],
  [
    1738713840000,
    "Farmer fears new tariffs after impacts of 2018 trade war with China - CBS News"
  ],
  [
    1738714260000,
    "From lip balm to sneakers, here's how Trump's China tariffs could raise prices - NBC News"
  ],
  [
    1738714980000,
    "Wall Street rises on US-China trade optimism, energy boost - Reuters"
  ],
  [
    1738716486000,
    "China announces counter tariffs on numerous U.S. products with U.S. levies due to take effect - CBS News"
  ],
  [
    1738717200000,
    "China counters with tariffs on US products. It will also investigate Google - The Associated Press"
  ],
  [
    1738717343000,
    "Tesla offers insurance subsidy for Model 3 buyers in China - Reuters"
  ],
  [
    1738720163000,
    "China displays multiple weapons in retaliation for Trump’s tariffs - The Washington Post"
  ],
  [
    1738720800000,
    "What Do Trump’s First Weeks Tell Us About His China Strategy? - The Wall Street Journal"
  ],
  [
    1738722204000,
    "A Guide to Minimum Wages in China (As of February 5, 2025) - China Briefing"
  ],
  [
    1738722720000,
    "China Retaliates Against U.S., Intensifying Trade War - The Wall Street Journal"
  ],
  [
    1738723057000,
    "USPS suspends inbound packages from China, Hong Kong Posts - Fox Business"
  ],
  [
    1738723266000,
    "Hours after suspending service, USPS to allow packages from China, Hong Kong - Scripps News"
  ],
  [
    1738724627000,
    "US Postal Service restores delivery of incoming parcels from China and Hong Kong after briefly suspending them - CNN"
  ],
  [
    1738726427000,
    "USPS Resumes Accepting Packages From China After Unexpected Suspension - WIRED"
  ],
  [
    1738727982000,
    "US Postal Service suspends incoming packages from China and Hong Kong - USA TODAY"
  ],
  [
    1738733850000,
    "USPS Reverses Decision to Halt Parcel Service From China - The New York Times"
  ],
  [
    1738736820000,
    "Trump in no hurry to talk to Xi amid new tariff war - Reuters"
  ],
  [
    1738736878000,
    "China has delayed or redirected 600,000 tons of wheat imports, sources say - Reuters.com"
  ],
  [
    1738737043000,
    "China’s tariff response - Financial Times"
  ],
  [
    1738743060000,
    "U.S. Postal Service reverses decision to stop accepting packages from China, after Trump ends ‘de minimis’ exemption used by Temu and Shein - Fortune"
  ],
  [
    1738743246000,
    "China keeps renminbi steady in first fix since Donald Trump’s tariffs - Financial Times"
  ],
  [
    1738744020000,
    "What cutting USAID could cost the U.S. — and how China, Russia may benefit - NBC News"
  ],
  [
    1738744980000,
    "USPS Halts All Inbound Packages From China And Hong Kong—Here’s Why It Could Affect Temu And Shein Orders - Forbes"
  ],
  [
    1738745001000,
    "China lodges complaints with U.S. over Panama Canal remarks - Reuters.com"
  ],
  [
    1738745188000,
    "China blames US 'sabotage' for Panama's departure from Belt and Road initiative - Reuters"
  ],
  [
    1738745543000,
    "China's stocks kick off Year of the Snake with trade war, AI rally - Reuters"
  ],
  [
    1738746000000,
    "How bad is the trade war with China going to get? - CNN"
  ],
  [
    1738746483000,
    "Apple shares slide after China reportedly considers probe into App Store practices - CNBC"
  ],
  [
    1738746709000,
    "China rejects Trump's plan to ‘take over’ Gaza, displace millions of Palestinians - Anadolu Agency | English"
  ],
  [
    1738748279000,
    "China calls for cooperation with EU amid 'global challenges' - Reuters"
  ],
  [
    1738749600000,
    "Trump Is Turning Out To Be a Very Pro-China President - POLITICO"
  ],
  [
    1738749613000,
    "Panama Canal and Trump: How much influence does China really have? - The Christian Science Monitor"
  ],
  [
    1738750001000,
    "China Weighs Probe Into Apple’s App Store Fees, Practices - Bloomberg"
  ],
  [
    1738753287000,
    "Los Angeles, My Chinese Christian Friends Are Praying for Us - ChristianityToday.com"
  ],
  [
    1738753748000,
    "Trump's China tariffs could drive up these prices - ABC News"
  ],
  [
    1738754100000,
    "Why China is blacklisting Calvin Klein and Tommy Hilfiger after Trump’s tariffs - CNN"
  ],
  [
    1738756140000,
    "China and Europe target Big Tech in scramble to fight back against Trump’s tariff broadside - Fortune"
  ],
  [
    1738756800000,
    "How I Accidentally Became Part of China’s PR Campaign - The Assembly"
  ],
  [
    1738761025000,
    "US Postal Service Reverses Decision to Halt China Shipments - Bloomberg"
  ],
  [
    1738761158000,
    "US Postal Service briefly suspends inbound packages from China - VOA Asia"
  ],
  [
    1738761291000,
    "USPS says it will resume accepting inbound packages from China, Hong Kong - CNBC"
  ],
  [
    1738761475000,
    "DeepSeek coding has the capability to transfer users' data directly to the Chinese government - ABC News"
  ],
  [
    1738762200000,
    "Trump Tariffs Live Updates: USPS Does A U-Turn And Says It Will Continue Accepting Packages From China - Forbes"
  ],
  [
    1738762750000,
    "USPS Resumes Accepting Shipments From China—Including Temu, Shein—After Brief Halt - Forbes"
  ],
  [
    1738763220000,
    "U.S. Postal Service Resumes Shipments of China Parcels - The Wall Street Journal"
  ],
  [
    1738763458000,
    "Preventing China’s DeepSeek in Space - Defense News"
  ],
  [
    1738763844000,
    "Trump’s China tariffs are shutting the big loophole that make Shein and Temu so cheap - Yahoo Finance"
  ],
  [
    1738764080000,
    "USPS will continue to accept packages from China and Hong Kong, reversing prior decision - USA TODAY"
  ],
  [
    1738765535000,
    "USPS resumes accepting packages from China, Hong Kong amid Trump trade war - Axios"
  ],
  [
    1738765694000,
    "US Postal Service will accept packages from China, Hong Kong after freeze - Al Jazeera English"
  ],
  [
    1738765908000,
    "Trump tariffs: US Postal Service resumes deliveries from China - BBC.com"
  ],
  [
    1738767108000,
    "China considers probe into Apple's policies and App Store fees, Bloomberg News reports - Reuters"
  ],
  [
    1738768380000,
    "Pakistan’s president says extremist attacks won’t end friendship with China - The Associated Press"
  ],
  [
    1738768444000,
    "Postal Service to resume accepting China shipments - NBC News"
  ],
  [
    1738768500000,
    "China is building a giant laser facility to master near-limitless clean energy, satellite images appear to show - CNN"
  ],
  [
    1738768620000,
    "Fast fashion, laptops and toys are likely to cost more due to US tariffs on Chinese imports - The Associated Press"
  ],
  [
    1738770180000,
    "Tesla brings new discount to China amid demand slump - Electrek.co"
  ],
  [
    1738771800000,
    "Researchers link DeepSeek’s blockbuster chatbot to Chinese telecom banned from doing business in US - The Associated Press"
  ],
  [
    1738771980000,
    "US Postal Service flip-flops on Hong Kong-China packages, lifting a ban imposed a day earlier - The Associated Press"
  ],
  [
    1738774309000,
    "USPS says packages from China and Hong Kong will be accepted again after temporary suspension - CBS News"
  ],
  [
    1738775652000,
    "Shenyang Visas - US Embassy & Consulates in China"
  ],
  [
    1738775833000,
    "2025 News items - China initiates WTO dispute complaint regarding US tariff measures - WTO Latest News"
  ],
  [
    1738776373000,
    "Lu Shaye, China’s controversial ex-envoy to France, handed new role for Europe - South China Morning Post"
  ],
  [
    1738776809000,
    "China restricts metal exports in response to US tariffs. Why they're important. - USA TODAY"
  ],
  [
    1738780274000,
    "COMMISSIONER SID MILLER SAYS MYSTERY SEED PACKAGES FROM CHINA ARE BACK - Texas Department of Agriculture"
  ],
  [
    1738782102000,
    "China launches WTO dispute over Trump tariffs - Reuters"
  ],
  [
    1738782355000,
    "Year of the Snake comes with a bite for Chinese consumers facing an economic slowdown - NBC News"
  ],
  [
    1738783038000,
    "What are the risks of a U.S.-China trade war, and can conflict be averted? - CBS News"
  ],
  [
    1738783411000,
    "A Chinese migrant’s harrowing escape by boat to Florida amid crackdown on illegal immigration - NBC News"
  ],
  [
    1738784374000,
    "The End of the Chinese Economic Miracle? - American Enterprise Institute"
  ],
  [
    1738785464000,
    "Oil down as US crude inventories swell, traders worry about China-US trade - Reuters"
  ],
  [
    1738790613000,
    "Trump's China focus increases odds its special trading status could end - Reuters"
  ],
  [
    1738792711000,
    "China no longer has a de minimis trade exemption. What is it? - NPR"
  ],
  [
    1738793040000,
    "Opinion | China Watches as Russia’s Economy Teeters - The Wall Street Journal"
  ],
  [
    1738796405000,
    "Trade war or not, global investors turn even more cautious on China - Reuters"
  ],
  [
    1738798140000,
    "US Shoppers Face Fees of Up to $50 or More to Get Packages From China - WIRED"
  ],
  [
    1738799144000,
    "B-1 Bombers, Philippine Fighters Maneuver Over South China Sea - Air & Space Forces Magazine"
  ],
  [
    1738800929000,
    "San Diego-based Illumina caught in U.S.-China trade war - Axios"
  ],
  [
    1738802594000,
    "Trump wants a TikTok deal. China may pull the plug. - The Washington Post"
  ],
  [
    1738803180000,
    "US Postal Service U-turn on China parcels sows confusion among retailers, shippers - Reuters"
  ],
  [
    1738806378000,
    "China calls Trump tariffs 'discriminatory' in WTO complaint - BBC.com"
  ],
  [
    1738806900000,
    "Cook Islands PM aims to boost trade ties during China visit - Reuters"
  ],
  [
    1738808685000,
    "China’s 60-second dramas head to the U.S. after beating box office - Fortune"
  ],
  [
    1738812824000,
    "McKinsey partners question China presence as US tensions mount - The Economic Times"
  ],
  [
    1738816860000,
    "China touts record spending over Lunar New Year holiday - CNN"
  ],
  [
    1738816860000,
    "China touts record spending over Lunar New Year holiday amid economic woes but unclear if momentum can continue - CNN"
  ],
  [
    1738818000000,
    "China’s Trump Strategy - Foreign Affairs Magazine"
  ],
  [
    1738818000000,
    "‘Bring me my tariffs’: how Trump’s China plan was 40 years in the making - The Guardian"
  ],
  [
    1738818540000,
    "Why Trump Is Closing a Trade Exemption for China - The Wall Street Journal"
  ],
  [
    1738823726000,
    "With US funding freeze, China nonprofits are facing extinction. They need emergency assistance - The Strategist"
  ],
  [
    1738826100000,
    "After DeepSeek leap forward, Russia's Sberbank plans joint AI research with China - Reuters"
  ],
  [
    1738828320000,
    "Xi calls for China, Thailand to beef up ties to fight global uncertainties - Reuters"
  ],
  [
    1738828620000,
    "Focus: China's U.S. ethane imports to surge in 2025 in drive to cut costs - Reuters"
  ],
  [
    1738829245000,
    "China’s first counter-sanction on US biotech industry a turning point in tech war - South China Morning Post"
  ],
  [
    1738830120000,
    "China's Xi and Thailand's leader vow to crack down on scam networks that plague Southeast Asia - The Associated Press"
  ],
  [
    1738830120000,
    "Russia's Sberbank plans joint AI research with China as DeepSeek leaps forward - Reuters"
  ],
  [
    1738830267000,
    "China names combative diplomat as senior envoy for Europe - Reuters"
  ],
  [
    1738831020000,
    "A flurry of international naval drills around the Philippines prompts complaints from Beijing - The Associated Press"
  ],
  [
    1738831482000,
    "DeepSeek fever fuels patriotic bets on Chinese AI stocks - Reuters"
  ],
  [
    1738832008000,
    "China says will protect its own interests in face of U.S. 'bullying' - CNBC"
  ],
  [
    1738832334000,
    "The Relationship Between Chinese Debt and China’s Trade Surplus - Carnegie Endowment for International Peace"
  ],
  [
    1738832536000,
    "Europe could be a big loser in US-China trade war, ECB warns - Reuters"
  ],
  [
    1738835183000,
    "China says it opposes Trump's Gaza takeover proposal - Reuters"
  ],
  [
    1738837072000,
    "WATCH: Can America Win the AI War with China? - The FP"
  ],
  [
    1738837160000,
    "Tungsten Miner Says Clients in Shock as China Chokes Supply - Bloomberg"
  ],
  [
    1738841640000,
    "China appoints ‘wolf warrior’ ambassador to manage affairs with Europe - Financial Times"
  ],
  [
    1738844809000,
    "AstraZeneca shares rise as China probe update reassures - Reuters"
  ],
  [
    1738846800000,
    "The Quad: Duke’s Surprise China PR Trip - The Assembly"
  ],
  [
    1738847602000,
    "How Calvin Klein and Tommy Hilfiger got caught in Trump's trade war with China - CNBC"
  ],
  [
    1738849057000,
    "China Anger Over US Naval Drills: 'Illegal Claims' - Newsweek"
  ],
  [
    1738850513000,
    "China is the US’s biggest threat: Q&A with Washington Times reporter Bill Gertz - Hillsdale Collegian"
  ],
  [
    1738850936000,
    "China is infiltrating Taiwan’s armed forces - The Economist"
  ],
  [
    1738850936000,
    "Cuts in American aid are crippling groups promoting rights in China - The Economist"
  ],
  [
    1738850973000,
    "Global Cost of Renewables to Continue Falling in 2025 as China Extends Manufacturing Lead: BloombergNEF - BloombergNEF"
  ],
  [
    1738852620000,
    "U.S. lawmakers move to ban China's DeepSeek from government devices - NBC News"
  ],
  [
    1738857141000,
    "President Trump Pauses Tariffs on Mexico and Canada, but not China - Hunton Andrews Kurth LLP"
  ],
  [
    1738857720000,
    "China’s Firms Are Bleeding Cash—and Vulnerable to Trump’s Trade War - The Wall Street Journal"
  ],
  [
    1738858003000,
    "Trump, the Panama Canal and China’s Role: What We Know - The New York Times"
  ],
  [
    1738859314000,
    "Did Biden Get China Right? - Foreign Policy"
  ],
  [
    1738860145000,
    "Trump faces pressure from US industry over China tariff on medicines - Reuters"
  ],
  [
    1738860258000,
    "Shipping companies warn of delays and new charges from Trump’s China tariffs - The Verge"
  ],
  [
    1738863450000,
    "Internet-connected cameras made in China may be used to spy on US infrastructure: DHS - ABC News"
  ],
  [
    1738865580000,
    "US imposes sanctions on network that helps ship Iranian oil to China - The Associated Press"
  ],
  [
    1738867354000,
    "US slaps sanctions on network shipping Iranian oil to China - Reuters"
  ],
  [
    1738868400000,
    "News at a glance: Ebola vaccine test, asteroid watch, and China’s fusion laser lab - Science"
  ],
  [
    1738870021000,
    "Panama formally exits China’s Belt and Road Initiative as US claims ‘victory’ - South China Morning Post"
  ],
  [
    1738872117000,
    "China’s retaliatory tariffs will hurt Trump-voting counties most - Brookings Institution"
  ],
  [
    1738875560000,
    "China challenges Trump tariffs at WTO as package shippers warn of chaos - Reuters"
  ],
  [
    1738876082000,
    "China’s Long Economic Slowdown - Dissent"
  ],
  [
    1738876424000,
    "Though China might aim to fill aid void left by USAID, its own challenges could limit it - VOA Asia"
  ],
  [
    1738876842000,
    "Beyond Manufacturing: Why Services Are Key to U.S.-China Economic Competition - Center for Strategic & International Studies"
  ],
  [
    1738877397000,
    "Big companies see no China recovery soon, adding to trade tensions gloom - Reuters"
  ],
  [
    1738879302000,
    "Can India and China Turn the Corner? - Foreign Policy"
  ],
  [
    1738884855000,
    "White House monitoring China’s complaint on Trump tariffs at WTO - VOA Asia"
  ],
  [
    1738885215000,
    "China’s ability to launch DeepSeek chatbot draws US panel’s scrutiny - South China Morning Post"
  ],
  [
    1738886181000,
    "Trump's tariffs on China bite US bargain-hunting online shoppers - Reuters"
  ],
  [
    1738886347000,
    "China tariffs could drive US crude exports lower in 2025 - Reuters"
  ],
  [
    1738886519000,
    "Tesla's China-made EV sales fall 11.5% y/y in January - Reuters"
  ],
  [
    1738888332000,
    "Trump’s Tariffs on Canada, Mexico and China: Update and Analysis - Skadden, Arps, Slate, Meagher & Flom LLP"
  ],
  [
    1738888508000,
    "Trump tariffs hit China: See how tariffs work, which goods are impacted - USA TODAY"
  ],
  [
    1738894279000,
    "DeepSeek shows that ‘China eats the world’: Deutsche Bank - South China Morning Post"
  ],
  [
    1738894380000,
    "China's Xiaomi to explore ways to ramp up auto production, CEO says - Reuters"
  ],
  [
    1738901280000,
    "Xiaomi Hits Fresh Record High on China’s Subsidy Program Boost - Bloomberg"
  ],
  [
    1738906260000,
    "Wooing Chinese tourists, Thai leader says she has 'Chinese blood in her' - Reuters.com"
  ],
  [
    1738906560000,
    "Morning Bid: China AI rally rouses trade war-weary markets - Reuters"
  ],
  [
    1738908016000,
    "China can detect US Seawolf-class submarine with magnetic wake tracking: study - South China Morning Post"
  ],
  [
    1738910100000,
    "Thailand lobbies for chip investments as Trump's trade war with China kicks off - Reuters"
  ],
  [
    1738911576000,
    "Taiwan detects airplanes, 6 balloons from China near island - DW (English)"
  ],
  [
    1738916745000,
    "DeepSeek Shock Fires Up Bullish Bets on Cheap China Tech Stocks - Bloomberg"
  ],
  [
    1738917060000,
    "Trump says China ‘operates’ the Panama Canal – how deep are Beijing’s ties to the key waterway? - CNN"
  ],
  [
    1738919632000,
    "China’s Central Bank Buys More Gold as Prices Hit Record - Bloomberg"
  ],
  [
    1738920060000,
    "China lashes out at US ‘coercion’ after Panama declines to renew infrastructure agreement - The Associated Press"
  ],
  [
    1738921662000,
    "China's January bank lending seen surging, but demand still fragile: Reuters poll - Reuters"
  ],
  [
    1738922340000,
    "Tesla China sells 63,238 cars in Jan, down 33% from Dec - CnEVPost"
  ],
  [
    1738922493000,
    "Hong Kong Gets Swept Up in Trump’s Trade War With China - Bloomberg"
  ],
  [
    1738924140000,
    "Foreign Ministry Spokesperson Lin Jian’s Regular Press Conference on February 7, 2025 - MFA China"
  ],
  [
    1738924316000,
    "L'Oreal CEO bullish on US as China sales stay weak - Reuters"
  ],
  [
    1738927210000,
    "Tesla car sales in China fall 11.5% as competition intensifies - CNBC"
  ],
  [
    1738928410000,
    "China slams US as Panama quits Belt and Road Initiative - Al Jazeera English"
  ],
  [
    1738928988000,
    "Exclusive: VW's SEAT boss warns Spanish jobs at risk if China-made EV tariff is not lowered - Reuters"
  ],
  [
    1738929609000,
    "US risks ‘losing next industrial revolution’ as China races forward, panel told - South China Morning Post"
  ],
  [
    1738930440000,
    "China’s economic miracle appears to be over, and the future is looking bleak - MarketWatch"
  ],
  [
    1738931160000,
    "China derides U.S. \"pressure and coercion\" as Panama scraps Belt and Road deal with Beijing amid canal standoff - CBS News"
  ],
  [
    1738933200000,
    "Hopping robot will hunt for moon water on China's Chang'e 7 lunar mission in 2026 - Space.com"
  ],
  [
    1738940280000,
    "Tesla sales hold OK in China amid Model Y changeover - Electrek.co"
  ],
  [
    1738943161000,
    "Republican state attorneys scrutinize US asset managers over China funds - Reuters"
  ],
  [
    1738943445000,
    "US pressure has forced Panama to quit China’s Belt and Road Initiative – it could set the pattern for further superpower clashes - The Conversation"
  ],
  [
    1738945421000,
    "Sharpie maker Newell Brands working to reduce China dependency amid tariff pressure - Reuters"
  ],
  [
    1738945732000,
    "What does the TikTok saga reveal about China-US relations? - Brookings Institution"
  ],
  [
    1738948440000,
    "US cedes ground to China with ‘self-inflicted wound’ of USAid shutdown, analysts say - The Guardian"
  ],
  [
    1738948560000,
    "Congressman sponsoring DeepSeek ban says China has 'tried many, many' times to infiltrate the U.S. via software. 'We're right to be vigilant' - Fortune"
  ],
  [
    1738948997000,
    "China Throws Weight Behind Panama Amid US Pressure - Newsweek"
  ],
  [
    1738949040000,
    "Trump says dismantling USAID will save money. Experts say it’s a ‘great gift’ for China - CNN"
  ],
  [
    1738949220000,
    "What do Trump’s tariffs mean for US-China trade? - The Guardian"
  ],
  [
    1738949899000,
    "Trump delays cancellation of de minimis trade exemption targeting China imports - CNBC"
  ],
  [
    1738952814000,
    "Trump pauses tariffs on small packages from China, a win for Shein and Temu - Axios"
  ],
  [
    1738953426000,
    "Here’s Where China’s Retaliatory Tariffs on the U.S. Could Hit Hardest - TIME"
  ],
  [
    1738955880000,
    "Trump says reciprocal tariffs on countries are coming soon; China duties in effect - Yahoo Finance"
  ],
  [
    1738957980000,
    "Trump Delays Crackdown on China Imports Loophole - The Wall Street Journal"
  ],
  [
    1738958880000,
    "Trump Tariffs Live Updates: Exemption For Cheaper Chinese Goods Reinstated - Forbes"
  ],
  [
    1738960516000,
    "Trump delays order eliminating trade loophole amid Chinese package whiplash - USA TODAY"
  ],
  [
    1738960835000,
    "Chinese tech giant quietly unveils advanced AI model amid battle over TikTok - ABC News"
  ],
  [
    1738961100000,
    "Trump delays key piece of China tariff plan amid threats to other countries - The Guardian US"
  ],
  [
    1738965381000,
    "More mystery seeds from China turn up in Texas, state agriculture commissioner warns - KHOU.com"
  ],
  [
    1738965621000,
    "Why 12 more South Korean FA-50 fighter jets for Manila may make China ‘insecure’ - South China Morning Post"
  ],
  [
    1738965627000,
    "Cheap China e-bikes 'kick in teeth' for UK firms - BBC.com"
  ],
  [
    1738965961000,
    "China Condemns U.S. ‘Coercion’ Over Panama Canal - Foreign Policy"
  ],
  [
    1738966738000,
    "Trump signs order delaying tariffs on de minimis imports from China - South China Morning Post"
  ],
  [
    1738966800000,
    "Trump delayed tariffs on low-cost packages from China - The Hill"
  ],
  [
    1738978209000,
    "Being Chinese | To know who we are, China must remain open to foreigners - South China Morning Post"
  ],
  [
    1738983360000,
    "Canada task force says ex-Finance Minister Freeland target of China-linked campaign - Reuters"
  ],
  [
    1738990775000,
    "Canada detects China-linked campaign targeting Freeland - DW (English)"
  ],
  [
    1738994416000,
    "China’s exporters face a darker outlook in 2025 – even ‘magic crystal’ vendors - South China Morning Post"
  ],
  [
    1738996096000,
    "Donald Trump pauses tariffs on low-cost parcels in US-China trade reprieve - Financial Times"
  ],
  [
    1739001600000,
    "DeepSeek Sent Silicon Valley Reeling. In China, It’s a Different Story. - Barron's"
  ],
  [
    1739001616000,
    "China adds ‘ghost particle’ detector to South China Sea observation network - South China Morning Post"
  ],
  [
    1739004401000,
    "China Urges Insurance Groups to Hold Sufficient Liquidity Buffer - Bloomberg"
  ],
  [
    1739010600000,
    "Temu and Shein Raised Prices, Removed Products as Trump’s China Tariffs Went Into Effect - WIRED"
  ],
  [
    1739011251000,
    "30 missing, homes buried in landslide in southwest China - South China Morning Post"
  ],
  [
    1739012400000,
    "The US relies on China for key medicines. They won’t be spared from tariffs - The Hill"
  ],
  [
    1739013331000,
    "China Steps In to Replace USAID - Newsweek"
  ],
  [
    1739015143000,
    "US-China Economic Ties Take a Turn for the Worse - Bloomberg"
  ],
  [
    1739016367000,
    "EU signals pragmatic approach on fraught path between China and the US - South China Morning Post"
  ],
  [
    1739016778000,
    "China landslide: More than 30 missing in Sichuan with 'all out rescue' launched - BBC.com"
  ],
  [
    1739017807000,
    "China protests over Panama’s withdrawal from Belt and Road Initiative - South China Morning Post"
  ],
  [
    1739019600000,
    "This week, Trump shut down USAID. Here’s why China is cheering. - The Hill"
  ],
  [
    1739019607000,
    "China reaffirms support for Palestinian state after Trump’s Gaza comments - South China Morning Post"
  ],
  [
    1739021200000,
    "China hunts for survivors following landslide in Sichuan province - Al Jazeera English"
  ],
  [
    1739021407000,
    "Opinion | What Wukong, Nezha and DeepSeek hold for the future of China-US rivalry - South China Morning Post"
  ],
  [
    1739023214000,
    "China leading physics research, with US a distant rival, Nature Index shows - South China Morning Post"
  ],
  [
    1739034009000,
    "US tariffs on China face legal challenge, but not the taxes you might think - South China Morning Post"
  ],
  [
    1739034540000,
    "Rescuers search for some 30 people after a landslide in southwest China - The Associated Press"
  ],
  [
    1739036380000,
    "Landslide in southwest China prompts search for dozens; hundreds forced to evacuate - CBS News"
  ],
  [
    1739036567000,
    "China landslide: More than 30 missing in Sichuan - BBC.com"
  ],
  [
    1739037600000,
    "China’s credibility on trade and Taiwan remains elusive - The Hill"
  ],
  [
    1739037960000,
    "Hundreds protest against Chinese ‘mega-embassy’ in London - The Guardian"
  ],
  [
    1739041931000,
    "Deterring China, slashing waste top Pentagon priorities, Hegseth says - Defense News"
  ],
  [
    1739050208000,
    "Opinion | Another US-China trade war? How about a war on income inequality - South China Morning Post"
  ],
  [
    1739052008000,
    "Nezha 2: ancient Chinese tales are a winning formula for animated film success - South China Morning Post"
  ],
  [
    1739056140000,
    "China makes some of Americans’ most common medicines. They won’t be spared from Trump’s tariffs - The Independent"
  ],
  [
    1739059209000,
    "Can China fill a US-sized void in the Pacific after Trump’s foreign aid freeze? - South China Morning Post"
  ],
  [
    1739060564000,
    "Thailand leader seeks more cooperation with China - Voice of America"
  ],
  [
    1739062814000,
    "China boy behind car-destroying firecracker sewer blast faces US$39,000 claim - South China Morning Post"
  ],
  [
    1739062817000,
    "How a Chinese maker of car lights plans to survive Trump 2.0 - South China Morning Post"
  ],
  [
    1739065380000,
    "China’s Consumer Inflation Picks Up After Holiday Spending Spurt - Bloomberg"
  ],
  [
    1739066100000,
    "China’s Consumer Inflation Accelerated in January - The Wall Street Journal"
  ],
  [
    1739066411000,
    "Trump’s aid freeze sounds security alarm in Taiwan amid cross-strait tension - South China Morning Post"
  ],
  [
    1739070960000,
    "China's consumer inflation quickens in January, producer deflation persists - Reuters.com"
  ],
  [
    1739071813000,
    "Analysts expect China property recovery in 2025 after seeing January improvement - South China Morning Post"
  ],
  [
    1739072640000,
    "‘Ne Zha 2’ Crosses $1B At China Box Office; First Movie Ever To Milestone In A Single Market - Deadline"
  ],
  [
    1739072902000,
    "China faces an uphill battle to boost demand despite seasonal price rise - South China Morning Post"
  ],
  [
    1739077325000,
    "US and China teeter on edge of trade war as tariff deadline looms - Financial Times"
  ],
  [
    1739077331000,
    "‘What’s high tech about clothing?’ Life on the margins of China’s economic reboot - Financial Times"
  ],
  [
    1739080821000,
    "China’s super-rich have a new must-have possession: their own university - South China Morning Post"
  ],
  [
    1739083080000,
    "‘Ne Zha 2’ Sets China Box Office Record With $1 Billion in 10 Days - Bloomberg"
  ],
  [
    1739083800000,
    "Dalai Lama’s elder brother, who led several rounds of talks with China, dies at 97 - The Associated Press"
  ],
  [
    1739085240000,
    "A rare diplomatic spat exposes growing pressures in the Pacific as US, China vie for influence - CNN"
  ],
  [
    1739085895000,
    "China’s inflation accelerates after rise in lunar new year demand - Financial Times"
  ],
  [
    1739086168000,
    "China to roll back clean power subsidies after boom - Yahoo Finance"
  ],
  [
    1739088724000,
    "China’s tech, quantum visionaries among those who died suddenly - South China Morning Post"
  ],
  [
    1739089680000,
    "Trump’s AI ambition and China’s DeepSeek overshadow an AI summit in Paris - The Associated Press"
  ],
  [
    1739089923000,
    "AI Summit opens as EU fears irrelevance in face of US, China - EURACTIV"
  ],
  [
    1739091621000,
    "China’s food security is a ‘political responsibility’, Xi Jinping says - South China Morning Post"
  ],
  [
    1739092082000,
    "Chinese construction risks turning the Yellow Sea into a flashpoint - Business Insider"
  ],
  [
    1739095919000,
    "One dead after landslide hits China’s Sichuan province - Al Jazeera English"
  ],
  [
    1739096724000,
    "PM Modi-Donald Trump Summit: Adani Group's IMEC Plan To Counter China - NDTV"
  ],
  [
    1739097000000,
    "Chinese tariffs on U.S. energy bring deja vu to local players - Pittsburgh Post-Gazette"
  ],
  [
    1739101692000,
    "DeepSeek's AI breakthrough could get global investors interested in China again - CNBC"
  ],
  [
    1739102230000,
    "Chinese companies detail use of AI amid DeepSeek frenzy - Reuters"
  ],
  [
    1739102407000,
    "Are China’s rural poor losing faith in education’s power to transform lives? - South China Morning Post"
  ],
  [
    1739106008000,
    "How China Became The World’s New Nuclear Energy Superstar - HuffPost"
  ],
  [
    1739107608000,
    "China's health regulator defends quality of local generic drugs - Reuters.com"
  ],
  [
    1739108940000,
    "Part of Russia’s island of Sakhalin on high alert after Chinese cargo ship runs aground - The Associated Press"
  ],
  [
    1739109276000,
    "China's tit-for-tat tariffs on US set to take effect - BBC.com"
  ],
  [
    1739113855000,
    "NSA Waltz says gutting USAID ‘absolutely not’ handing power to China and Russia: Full interview - NBC News"
  ],
  [
    1739117212000,
    "Sen. Andy Kim says U.S. is ‘doing China’s work for them’ as Trump guts USAID: Full interview - NBC News"
  ],
  [
    1739119172000,
    "Rescuers recover 1 body and search for 28 people in a landslide in southwest China - NBC News"
  ],
  [
    1739122097000,
    "China’s stunning new campaign to turn the world against Taiwan - The Economist"
  ],
  [
    1739122141000,
    "Deepseek’s AI model is ‘the best work’ out of China but the hype is 'exaggerated,' Google Deepmind CEO says - CNBC"
  ],
  [
    1739123160000,
    "Labour MP warns Starmer he is crossing a red line with China embassy deal - The Independent"
  ],
  [
    1739128320000,
    "‘Ne Zha 2’ At $1.1B In China Through Sunday, Already No. 7 Animated Movie Ever WW; ‘Mufasa’ Tops $671M Global, ‘Paddington In Peru’ Crosses $100M Overseas – International Box Office - Deadline"
  ],
  [
    1739129708000,
    "China imposes retaliatory tariffs on $14bn worth of US goods - Financial Times"
  ],
  [
    1739131243000,
    "China Takes Russian Undersea Cable Tactics to Taiwan - Bloomberg"
  ],
  [
    1739131424000,
    "Merck & Co. (MRK): ‘Forget It… It’s China,’ Jim Cramer on Vaccine Rollout Woes - Yahoo Finance"
  ],
  [
    1739132040000,
    "China’s retaliatory US tariffs loom as analysts warn of escalating trade war - Semafor"
  ],
  [
    1739132108000,
    "How mini dramas could be the next big thing in entertainment - South China Morning Post"
  ],
  [
    1739132255000,
    "Dozens Still Missing After Major Landslide in Southwest China - Newsweek"
  ],
  [
    1739138426000,
    "Exclusive Scholar Jing Qian on right sizing China’s economy in the age of Trump and DeepSeek - South China Morning Post"
  ],
  [
    1739140860000,
    "Trump to announce 25% aluminum and steel tariffs as China’s levies against US come into effect - The Guardian US"
  ],
  [
    1739142000000,
    "Ringgit Outperformance at Risk on Growing US-China Trade Tension - Bloomberg"
  ],
  [
    1739145540000,
    "Huawei revenue growing fast, suggesting China's scoffing at sanctions - The Register"
  ],
  [
    1739145619000,
    "Brics beckons: would the Philippines joining mend its ties with China? - South China Morning Post"
  ],
  [
    1739145780000,
    "Chinese Gold Buyers Forced to Sidelines as Prices Near $3,000 - Bloomberg"
  ],
  [
    1739147400000,
    "DeepSeek Sparks Hope for Renaissance in China’s Tech Megacaps - Bloomberg"
  ],
  [
    1739147412000,
    "Chinese buyers are buying more expensive properties in Australia - South China Morning Post"
  ],
  [
    1739147460000,
    "Chinese cargo ship runs aground on Russia's Pacific region of Sakhalin but no spill reported - The Associated Press"
  ],
  [
    1739149140000,
    "How Chinese EVs are ramping up competition: No down payment and 5-year interest-free loans - CNBC"
  ],
  [
    1739152140000,
    "Taiwan's legacy chip industry contemplates future as China eats into share​ - Reuters"
  ],
  [
    1739152800000,
    "China’s Strategy in Trade War: Threaten U.S. Tech Companies - The Wall Street Journal"
  ],
  [
    1739152800000,
    "Shein Asks Some Chinese Suppliers to Diversify to Vietnam - Bloomberg"
  ],
  [
    1739152812000,
    "Air pollution threat as lung cancer cases in never-smokers on the rise: study - South China Morning Post"
  ],
  [
    1739153150000,
    "China consumer inflation picks up as holiday boosts spending - Yahoo Finance"
  ],
  [
    1739155080000,
    "Australia's Global Lithium seeks government help, alleging Chinese control attempt - Reuters.com"
  ],
  [
    1739157480000,
    "Why Fentanyl Is at the Center of New US-China Trade Fight - Bloomberg"
  ],
  [
    1739157780000,
    "China Carmaker Dongfeng Surges as Restructuring News Sparks Consolidation Hope - Bloomberg"
  ],
  [
    1739159719000,
    "China's former UK ambassador clashes with 'AI godfather' at summit - BBC.com"
  ],
  [
    1739160009000,
    "Legal challenge to US tariffs, Chinese billionaires, Nezha 2: 5 weekend reads you missed - South China Morning Post"
  ],
  [
    1739161440000,
    "New Zealand raises ‘concern’ as Cook Islands prepares to sign China deal - The Guardian"
  ],
  [
    1739161620000,
    "Want to invest in China? Here's how the pros are investing in the face of trade frictions - CNBC"
  ],
  [
    1739162352000,
    "China has met most of its 5-year goals. It hasn’t done so well on emissions - South China Morning Post"
  ],
  [
    1739163600000,
    "France’s great AI hope sees opportunity in China’s chatbot success - POLITICO Europe"
  ],
  [
    1739163600000,
    "Don’t Fall for the Hype About China’s Critical Minerals Controls - Bloomberg"
  ],
  [
    1739163629000,
    "Cook Islands’ ‘strategic’ deal with China angers New Zealand - Financial Times"
  ],
  [
    1739163666000,
    "What DeepSeek’s Success Says About China’s Ability to Nurture Talent - The New York Times"
  ],
  [
    1739163666000,
    "Chinese chip champion’s ‘snowballing’ growth threatens Korean dominance - Financial Times"
  ],
  [
    1739165640000,
    "A US ally is reconsidering aid to a strategic Pacific nation. Will China move in? - CNN"
  ],
  [
    1739166144000,
    "China's Xi accepts invitation to attend Moscow's Victory Day in May, TASS reports - Reuters"
  ],
  [
    1739167309000,
    "China: Ne Zha 2 rakes in $1bn in days and stirs national pride - BBC.com"
  ],
  [
    1739168430000,
    "China’s birth crisis deepens as marriage registrations plunge to 40-year low - South China Morning Post"
  ],
  [
    1739168677000,
    "Low expectations for China provide a big opportunity for returns, strategist says - CNBC"
  ],
  [
    1739169060000,
    "New marriages in China crash to record low, while divorces on the rise - CNN"
  ],
  [
    1739169060000,
    "Fewer people than ever before are marrying in China. But divorces are up - CNN"
  ],
  [
    1739170800000,
    "China readies its legal arsenal for a trade war with Trump - Geopolitical Intelligence Services AG"
  ],
  [
    1739171911000,
    "Marriages in China plunge by a record in 2024, fanning birthrate concerns - Reuters"
  ],
  [
    1739173946000,
    "China-Russia ties: Xi to visit Moscow to mark Soviet WWII victory over Germany - South China Morning Post"
  ],
  [
    1739174160000,
    "China hopes Dalai Lama can 'return to right path', says its foreign ministry - Yahoo"
  ],
  [
    1739175007000,
    "Japan's Shiseido says annual profit plunges 73% amid sluggish sales in China - Reuters.com"
  ],
  [
    1739175180000,
    "The first shots of a potential trade war have been fired. What’s next for Beijing? - CNN"
  ],
  [
    1739175301000,
    "China Marriages Fall to Record Low as Demographic Crisis Deepens - Bloomberg"
  ],
  [
    1739176084000,
    "Chinese counter-tariffs to kick in as Trump threatens more to come - NPR"
  ],
  [
    1739176935000,
    "China Frees Possible $27 Billion From Insurers to Invest in Gold - Bloomberg"
  ],
  [
    1739178805000,
    "New Zealand voices renewed concern as Cook Islands PM eyes agreement with China - Reuters"
  ],
  [
    1739178900000,
    "'Ne Zha 2' Tops $1.Billion as China Box Office Surges Past $2 Billion - Variety"
  ],
  [
    1739179800000,
    "Laopu Gold's jewellery is selling like hot cakes despite tepid consumer spending in China - Yahoo Finance"
  ],
  [
    1739179809000,
    "Product of China’s potential car mega-merger would eclipse BYD in sales - South China Morning Post"
  ],
  [
    1739180707000,
    "China sends trade mission to Central Asia as it braces for US tariff war - South China Morning Post"
  ],
  [
    1739181601000,
    "Exclusive - Chinese Spy Balloon Was Packed With American Tech - Newsweek"
  ],
  [
    1739181660000,
    "China's targeted retaliatory tariffs on U.S. kick in: 5 things to know - Nikkei Asia"
  ],
  [
    1739181966000,
    "Demystifying DeepSeek: 4 burning questions about the AI start-up answered - South China Morning Post"
  ],
  [
    1739182766000,
    "Elon Musk’s China Threat - The American Prospect"
  ],
  [
    1739184180000,
    "China says a visit by Cook Islands' prime minister isn't meant to antagonize others in South Pacific - The Associated Press"
  ],
  [
    1739184643000,
    "In China's export hub of Yiwu, traders shrug off Trump's tariffs - Reuters"
  ],
  [
    1739185209000,
    "China Seems Unstoppable. Trump Thinks Otherwise. - The New York Times"
  ],
  [
    1739185234000,
    "South Korea Has More Leverage Over China Than You Think - Foreign Policy"
  ],
  [
    1739187047000,
    "CATL and Lopal Restart China Lithium Refinery Despite Price Rout - Bloomberg"
  ],
  [
    1739187589000,
    "China tightens rules on publishing information about the military - South China Morning Post"
  ],
  [
    1739188621000,
    "Russia says China’s Xi accepted invitation to attend ‘Victory Day’ events in May - Anadolu Agency | English"
  ],
  [
    1739188809000,
    "A man, a plan, a ban? Trump’s Panama tensions augur risk for Chinese investments - South China Morning Post"
  ],
  [
    1739188836000,
    "China hopes the aging Dalai Lama can 'return to right path' - Voice of America"
  ],
  [
    1739189668000,
    "China's BYD cuts entry price for smart EVs to below $10,000 - Yahoo Finance"
  ],
  [
    1739190608000,
    "Opinion | Why China’s not in a rush to make trade concessions to Trump - South China Morning Post"
  ],
  [
    1739191522000,
    "DHS warns Chinese-made internet cameras pose espionage threat to US critical infrastructure - IndustrialCyber"
  ],
  [
    1739192378000,
    "Why China could benefit most from Trump's tariffs - Sky News"
  ],
  [
    1739192400000,
    "5-figure ad buy urges states to crack down as China floods market with illicit vapes: 'Trump was right' - Fox News"
  ],
  [
    1739192420000,
    "Lung cancer in never-smokers, right-sizing China economy: SCMP daily highlights - South China Morning Post"
  ],
  [
    1739192459000,
    "China's BYD in advanced talks to form pool in Europe over carbon credits - Reuters.com"
  ],
  [
    1739193540000,
    "A timeline of US-China tit-for-tat tariffs since Trump’s first term - The Associated Press"
  ],
  [
    1739194235000,
    "China's foreign minister to visit Britain on Thursday for talks - Reuters"
  ],
  [
    1739194237000,
    "China builds ‘planetary defence’ team as concerns grow over 2024 YR4 asteroid - South China Morning Post"
  ],
  [
    1739195372000,
    "BYD to add autopilot system to lure buyers amid China’s EV price war - South China Morning Post"
  ],
  [
    1739197118000,
    "Why a China deal has set off a Cook Islands-New Zealand spat - Al Jazeera English"
  ],
  [
    1739201881000,
    "Cook Islands and New Zealand fall out over China deal - BBC.com"
  ],
  [
    1739202720000,
    "Tesla Is Losing Ground Against Its Biggest Rival in China - The Wall Street Journal"
  ],
  [
    1739203293000,
    "China Investigates Google for Antitrust Violations, More U.S. Tech Firms Could Face Scrutiny - Yahoo Finance"
  ],
  [
    1739203308000,
    "Trump's new tariff on China has automakers reassessing necessary parts - Detroit Free Press"
  ],
  [
    1739204544000,
    "US-China tensions are an opportunity – the EU could become the world’s third great power - The Conversation"
  ],
  [
    1739205058000,
    "Trump’s Initial Moves Will Benefit China - Council on Foreign Relations"
  ],
  [
    1739206275000,
    "Appaloosa's David Tepper hikes his 'everything' China bet, loads up on Alibaba, JD.com and ETFs - CNBC"
  ],
  [
    1739207578000,
    "China's BYD taps Italian parts makers to supply plants in Hungary, Turkey - Reuters"
  ],
  [
    1739208317000,
    "China’s 10% Tariffs on US Cars Hits GM, Ford and Mercedes SUVs - Bloomberg"
  ],
  [
    1739211300000,
    "China imposes tariffs on U.S. goods as new round of Trump tariffs coming - CBS News"
  ],
  [
    1739215440000,
    "L’Oréal is counting on American boomers spending big on antiaging as it ditches China - Fortune"
  ],
  [
    1739217780000,
    "Billionaire Investor Tepper’s Firm Loves China. Alibaba Is Its Biggest Bet. - Barron's"
  ],
  [
    1739221147000,
    "Billionaire Investor Tepper Boosted Bets on China Before Stocks Rally - Yahoo Finance"
  ],
  [
    1739221331000,
    "As USAID retreats, China pounces - POLITICO"
  ],
  [
    1739222906000,
    "Marriages in China Crash, Portending Deeper Demographic Woes - Council on Foreign Relations"
  ],
  [
    1739224366000,
    "Boston man cleared of US charges he acted as Chinese agent - Reuters"
  ],
  [
    1739224800000,
    "Smaller countries may ‘have to choose’ between the U.S. and China, warns author Robert Kaplan - Fortune"
  ],
  [
    1739224800000,
    "China’s Green Bond Debut Is Chance to Capitalize on US Retreat - Bloomberg"
  ],
  [
    1739225220000,
    "Opinion | U.K. Kicks Apple’s Door Open for China - The Wall Street Journal"
  ],
  [
    1739225340000,
    "Opinion | Trump Outsmarts China on Green Energy - The Wall Street Journal"
  ],
  [
    1739227560000,
    "Billionaire David Tepper built on his ‘everything’ China bet as rally faded - MarketWatch"
  ],
  [
    1739228410000,
    "My Take | Why DeepSeek’s true value for China goes beyond AI advance - South China Morning Post"
  ],
  [
    1739230253000,
    "Select Committee on China Calls Out LAM Research for Failure to Provide Documents on China Sales, Demands Full Compliance - Select Committee on the CCP |"
  ],
  [
    1739233764000,
    "China's Leapmotor launches $20,000 smart EV, after BYD cuts entry price - Reuters"
  ],
  [
    1739241000000,
    "A Timeline of the Tit-for-Tat Tariffs Between China and the U.S. Since 2017 - TIME"
  ],
  [
    1739241000000,
    "Timeline of U.S.-China Tariffs - TIME"
  ],
  [
    1739241533000,
    "US-China relations: Trump confirms talks with Xi since his inauguration - South China Morning Post"
  ],
  [
    1739243520000,
    "China’s Cabinet Pledges to Boost Spending, Attract Foreign Investment - The Wall Street Journal"
  ],
  [
    1739247480000,
    "DeepSeek hasn’t just disrupted OpenAI. Chinese tech giants are being upended too - CNN"
  ],
  [
    1739247980000,
    "China Vanke gets $383 million loan from state shareholder - Yahoo Finance"
  ],
  [
    1739248260000,
    "China EV insurance registrations by brand for week ending Feb 9: Nio 1,100, Tesla 6,200, Xiaomi 4,400, BYD 28,900 - CnEVPost"
  ],
  [
    1739248902000,
    "Who Needs Hollywood? Chinese Animated Film Shatters Box Office Records. - The New York Times"
  ],
  [
    1739249029000,
    "China’s ‘Ne Zha 2’ Shatters Box Office Records With $1.2 Billion - The New York Times"
  ],
  [
    1739250026000,
    "The start-ups seeking to challenge China’s stranglehold on rare minerals - Financial Times"
  ],
  [
    1739250077000,
    "PwC sheds 66 partners after China audit ban - Financial Times"
  ],
  [
    1739250180000,
    "China’s Xi Is Building Economic Fortress Against U.S. Pressure - The Wall Street Journal"
  ],
  [
    1739252676000,
    "China’s stratospheric airship can detect American F-35 fighter from nearly 2,000km: study - South China Morning Post"
  ],
  [
    1739252700000,
    "HEDGEFLOW China tops hedge funds' shopping lists so far this year, Goldman says - Reuters.com"
  ],
  [
    1739255466000,
    "China rises to 37% of billionaire investor David Tepper’s portfolio - South China Morning Post"
  ],
  [
    1739259840000,
    "Why China Can’t Sort Out Its Property Market Mess - Bloomberg"
  ],
  [
    1739260045000,
    "How Edward Snowden’s Leaks Benefited China - The Dispatch"
  ],
  [
    1739260702000,
    "Chinese tariffs take effect, ratcheting up nascent trade war with U.S. - The Washington Post"
  ],
  [
    1739261310000,
    "Trump says he has spoken to China's Xi since inauguration - Reuters"
  ],
  [
    1739262060000,
    "China tightens screws on what can be shared online about its military - CNN"
  ],
  [
    1739262691000,
    "China's car sales post biggest drop in almost a year in January - Reuters.com"
  ],
  [
    1739263560000,
    "Tesla sells 33,703 cars in China in Jan, exports 29,535 from Shanghai plant - CnEVPost"
  ],
  [
    1739264310000,
    "China unveils ‘silver trains’ for ageing tourists to keep economy on track - Financial Times"
  ],
  [
    1739264400000,
    "China expands influence near wealthy Florida enclave as migrants from communist country flood into US - Fox News"
  ],
  [
    1739267663000,
    "China's SMIC Q4 profit slumps 38.4%, misses estimates despite revenue growth - Reuters.com"
  ],
  [
    1739268086000,
    "Saudi crude to China to fall in March after prices hit over two-year high, sources say - Reuters.com"
  ],
  [
    1739271600000,
    "China builds space alliances in Africa as Trump cuts foreign aid - Reuters.com"
  ],
  [
    1739272320000,
    "BYD expands ‘God’s Eye’ intelligent driving into its entry level cars, sending other China EV shares tumbling - Fortune"
  ],
  [
    1739272660000,
    "How USAID Cuts Hand Big Win to China - Newsweek"
  ],
  [
    1739273400000,
    "Why economists got free trade with China so wrong : Planet Money - NPR"
  ],
  [
    1739274402000,
    "U.S aid freeze risks handing influence to China in Beijing's backyard - Reuters"
  ],
  [
    1739275620000,
    "Over 60 PwC partners in China have stepped down as the Big Four firm handles the fallout from the Evergrande scandal - Business Insider"
  ],
  [
    1739276521000,
    "Vance rails against AI regulation in Paris as US faces off with EU, China - Al Jazeera English"
  ],
  [
    1739276700000,
    "Top Republican condemns Elon Musk for ‘supplication’ to China in new book - The Guardian US"
  ],
  [
    1739277065000,
    "Explainer: What autonomous driving features are available in China? - Reuters"
  ],
  [
    1739278675000,
    "In fighting AI chip trade war with China, there's one big mistake U.S. can't afford to make - CNBC"
  ],
  [
    1739278851000,
    "China’s crude oil imports decreased from a record as refinery activity slowed - EIA"
  ],
  [
    1739282400000,
    "Apple Partners With Alibaba to Develop AI Features for iPhone Users in China - The Information"
  ],
  [
    1739283309000,
    "Donald Trump says China runs the Panama Canal. Is he right? - South China Morning Post"
  ],
  [
    1739284476000,
    "China is willing to share achievements in AI, vice premier says at Paris summit - Reuters.com"
  ],
  [
    1739284796000,
    "China Speaks to Europe in the Language of the Wolf - Center for European Policy Analysis"
  ],
  [
    1739286890000,
    "Marriott's full-year profit forecast dampened by China slowdown - Reuters"
  ],
  [
    1739288015000,
    "Alibaba pairs with Apple to develop AI features for China iPhones - South China Morning Post"
  ],
  [
    1739289222000,
    "Chinese Companies Use Legal Threats to Halt Foreign Research - The New York Times"
  ],
  [
    1739289690000,
    "US coal exports to India expected to rise due to China tariffs - Reuters.com"
  ],
  [
    1739291661000,
    "China AI rollout for Apple may be closer — plus, another big Home Depot call - CNBC"
  ],
  [
    1739291707000,
    "China launches new rocket designed to carry more satellites - Reuters"
  ],
  [
    1739293380000,
    "China’s wealthy shoppers have a new mentality—and it’s terrible news for luxury brands like LVMH and Kering who bet billions on their loyalty - Fortune"
  ],
  [
    1739297578000,
    "Tesla opens Megapack battery factory in China amid nascent trade war - The Washington Post"
  ],
  [
    1739297804000,
    "Experts: China’s Military Faces Major Challenges - NGAUS"
  ],
  [
    1739298120000,
    "Trump’s China Threats Aren’t a Bluff - Barron's"
  ],
  [
    1739301145000,
    "Can simplifying AI rules in Europe create competition for US and China? - Al Jazeera English"
  ],
  [
    1739305740000,
    "Air Force's Big Reorganization Effort Focused on China Paused by Defense Secretary - Military.com"
  ],
  [
    1739305827000,
    "Hegseth discusses DOGE plans, deterring China and more during first official trip abroad - DefenseScoop"
  ],
  [
    1739307504000,
    "Space security at crossroads: Report urges U.S.-China dialogue - SpaceNews"
  ],
  [
    1739307790000,
    "What Trump’s Steel Tariffs Mean for China - Foreign Policy"
  ],
  [
    1739307900000,
    "H9N2 avian flu infects 2 more in China - University of Minnesota Twin Cities"
  ],
  [
    1739308216000,
    "China’s ‘top puppet’ Elon Musk poses US national security risks: House Democrats - South China Morning Post"
  ],
  [
    1739308560000,
    "Apple Reportedly Picks Alibaba As China AI Partner - Investor's Business Daily"
  ],
  [
    1739309171000,
    "Will Apple's AI Partnership With Alibaba Solve Its China Problem? Here's What Analysts Think - Investopedia"
  ],
  [
    1739310554000,
    "Data-Centric Authoritarianism: How China’s Development of Frontier Technologies Could Globalize Repression - National Endowment for Democracy"
  ],
  [
    1739311223000,
    "China’s Property Crisis Enters a Dangerous New Phase - Bloomberg"
  ],
  [
    1739312235000,
    "China's CATL files for at least $5 billion Hong Kong listing - Reuters"
  ],
  [
    1739314188000,
    "'Ineffective' generic drugs fuel rare public anger in China - BBC.com"
  ],
  [
    1739314800000,
    "China Quants Rebound on Stocks Rally as Investors Woo New Stars - Bloomberg"
  ],
  [
    1739316262000,
    "China in ‘axis of evil’, says US lawmaker of countries under Trump and Xi - South China Morning Post"
  ],
  [
    1739318409000,
    "‘Poisoning the well’: concern over China-meddling claims in South Korea election - This Week In Asia"
  ],
  [
    1739319540000,
    "Chinese cranes at U.S. ports raise homeland security concerns - CBS News"
  ],
  [
    1739322014000,
    "Top chip designer Sun Nan leaves US and finds ‘room to play’ in China - South China Morning Post"
  ],
  [
    1739322258000,
    "China, Taiwan, and the PLA’s 2027 milestones - The Interpreter"
  ],
  [
    1739328098000,
    "China says US naval patrol of Taiwan Strait poses security risk - Al Jazeera English"
  ],
  [
    1739328174000,
    "Warner Bros to build 'Harry Potter Studio Tour' with Chinese group in Shanghai - Reuters"
  ],
  [
    1739332560000,
    "China’s New Game Plan for Dealing With Trump Tariffs - Bloomberg"
  ],
  [
    1739332809000,
    "Chinese GPUs outdo Nvidia chips nearly tenfold in supercomputer task - South China Morning Post"
  ],
  [
    1739332980000,
    "China’s Ne Zha 2 becomes first movie to break $1 billion in a single market, overtaking Star Wars - Fortune"
  ],
  [
    1739334600000,
    "Chinese tech giant Baidu to release next-generation AI model this year as DeepSeek shakes up market - CNBC"
  ],
  [
    1739334900000,
    "U.S.-China trade war hits small and midsize businesses especially hard - The Washington Post"
  ],
  [
    1739335155000,
    "China’s tech stocks enter bull market after DeepSeek breakthrough - Financial Times"
  ],
  [
    1739336472000,
    "Ex-Google chief warns west to focus on open-source AI in competition with China - Financial Times"
  ],
  [
    1739338176000,
    "Exclusive: China's record mergers in $8 trillion small banking sector raise future risks - Reuters"
  ],
  [
    1739339880000,
    "Is China's state-funded stock revival plan pie in the sky? - Reuters"
  ],
  [
    1739340008000,
    "Outrage in China as highway workers eat dog that escapes from boarding centre - South China Morning Post"
  ],
  [
    1739340081000,
    "Europe wants to be part of the AI race against China and the U.S. — and shake off its anti-innovation image - CNBC"
  ],
  [
    1739340195000,
    "China: one country, two economies, two strategies - Asia Times"
  ],
  [
    1739341020000,
    "She said no: marriages in China plummet to record low - The Guardian"
  ],
  [
    1739342933000,
    "China's purchases of chipmaking equipment to decline in 2025, consultancy says - Reuters"
  ],
  [
    1739344200000,
    "Temu, Shein See US Sales Drop After Trump Targets China Trade - Bloomberg"
  ],
  [
    1739345220000,
    "China Mulls $6.8 Billion Funding to Help Vanke Repay Debt - Bloomberg"
  ],
  [
    1739347111000,
    "When Will China’s Leader Talk to Trump? - The New York Times"
  ],
  [
    1739347747000,
    "China says Wuhan institute was not involved in creating COVID-19 virus - Reuters"
  ],
  [
    1739347801000,
    "China's SMIC flags chip oversupply risk on weakening demand, rising output - Reuters"
  ],
  [
    1739349060000,
    "Trump wants China to play a role in peace in Ukraine. Is Xi Jinping willing to help? - CNN"
  ],
  [
    1739350816000,
    "DeepSeek founder skips Paris summit as China champions its AI - South China Morning Post"
  ],
  [
    1739352600000,
    "With DeepSeek, China moves to take on Nvidia's CUDA ecosystem - Yahoo Finance"
  ],
  [
    1739354273000,
    "China Sets Up 'Planetary Defense' Unit Over 2032 Asteroid Threat - Newsweek"
  ],
  [
    1739355991000,
    "Will China and the US head into a full-blown trade war? - Al Jazeera English"
  ],
  [
    1739356315000,
    "'Ne Zha 2': Chinese animated film shatters box office records as it heads overseas - NBC News"
  ],
  [
    1739356699000,
    "India weighs temporary tax on cheap Chinese steel import, minister says - Reuters"
  ],
  [
    1739361432000,
    "Google's CEO Pichai says China's DeepSeek has done very good work - Reuters"
  ],
  [
    1739361608000,
    "In the US-China battle for critical minerals, where will Australia stand? - South China Morning Post"
  ],
  [
    1739362020000,
    "Tesla has sued customers and journalists in China — and won most times, review finds - CBS News"
  ],
  [
    1739363394000,
    "Is China ending its stint as major global grain importer? - Reuters"
  ],
  [
    1739364800000,
    "China’s Vast Energy Market Swallows DeepSeek Impact - Bloomberg"
  ],
  [
    1739365320000,
    "Takeaways: Tesla has sued Chinese customers and journalists — and won almost every time - The Associated Press"
  ],
  [
    1739368267000,
    "China flexes its media muscle in Africa – encouraging positive headlines as part of a soft power agenda - The Conversation"
  ],
  [
    1739368440000,
    "Dismantling USAID creates void for China? Expert slams it as 'false cognition built on bias' - Global Times"
  ],
  [
    1739368810000,
    "Manila uses ‘transparency initiative’ to offset Beijing’s South China Sea moves - South China Morning Post"
  ],
  [
    1739373300000,
    "Trump’s disdain for South American allies is China’s gain - The Guardian US"
  ],
  [
    1739375177000,
    "China’s advances could boost AI’s impact on global GDP - Goldman Sachs"
  ],
  [
    1739375580000,
    "China hawk picked for key US Commerce Dept job - Reuters"
  ],
  [
    1739376540000,
    "Jurassic fossil from China rewrites history of bird evolution - Reuters"
  ],
  [
    1739377980000,
    "Chinese car journalists are told not to be negative on Tesla as it sues customers and media - Electrek"
  ],
  [
    1739379780000,
    "Wittman ‘Positive’ U.S. Can Maintain Power Balance Between China, Russia - USNI News"
  ],
  [
    1739380631000,
    "DeepSeek: how China’s embrace of open-source AI caused a geopolitical earthquake - The Conversation"
  ],
  [
    1739382485000,
    "Ex-N.Y. Official Accused of Working for China Faces Bribery Allegation - The New York Times"
  ],
  [
    1739382840000,
    "Chinese Navy Tracks First U.S. Taiwan Strait Transit under Trump Administration - USNI News"
  ],
  [
    1739387042000,
    "How China’s Growth Headwinds Shape Its Response to Trump - Bloomberg"
  ],
  [
    1739389129000,
    "Which goods are most vulnerable to American tariffs on China? - The Economist"
  ],
  [
    1739396817000,
    "China aids Russian drone production with smuggled Western parts, says Estonia - Reuters"
  ],
  [
    1739397609000,
    "Beijing approves construction of first South China Sea deepwater ‘space station’ - South China Morning Post"
  ],
  [
    1739397950000,
    "'DeepSeek brought me to tears': How young Chinese find therapy in AI - BBC.com"
  ],
  [
    1739399420000,
    "Unprecedented US visit by all 13 Canadian premiers paints China as ‘enemy’ - South China Morning Post"
  ],
  [
    1739401567000,
    "New Fossils from China Fill Gap in Early Evolutionary History of Birds - Sci.News"
  ],
  [
    1739402042000,
    "Cook Islands prime minister discusses marine, climate and economics in China visit - Reuters"
  ],
  [
    1739403855000,
    "The China Excuse - The Dispatch"
  ],
  [
    1739404800000,
    "When coal won’t step aside: The challenge of scaling clean energy in China - Centre for Research on Energy and Clean Air"
  ],
  [
    1739404934000,
    "China’s construction of coal-fired power plants reaches highest in a decade - Financial Times"
  ],
  [
    1739405169000,
    "Trump’s assault on USAID leaves China soft power opening in Southeast Asia - Al Jazeera English"
  ],
  [
    1739405190000,
    "China’s construction of new coal-power plants ‘reached 10-year high’ in 2024 - Carbon Brief"
  ],
  [
    1739412840000,
    "China’s coal power habit undercuts ‘unprecedented pace’ of clean energy - The Guardian"
  ],
  [
    1739413980000,
    "BlackRock Fund Gives Up China Towers After Opting to Miss Loan - Bloomberg"
  ],
  [
    1739415600000,
    "Keir Starmer plots visit to China. He just needs a policy first - POLITICO Europe"
  ],
  [
    1739415960000,
    "China hopes new fleet of ‘silver trains’ will encourage its elderly to travel, and spend, more - CNN"
  ],
  [
    1739421960000,
    "DeepSeek gives China's chipmakers leg up in race for cheaper AI - Reuters"
  ],
  [
    1739422560000,
    "China’s Love for Dividends Sees REIT Demand Go Stratospheric - Bloomberg"
  ],
  [
    1739422800000,
    "China’s Salt Typhoon Spies Are Still Hacking Telecoms—Now by Exploiting Cisco Routers - WIRED"
  ],
  [
    1739424381000,
    "Alibaba Reportedly Revitalized by China’s AI Fever - PYMNTS.com"
  ],
  [
    1739425860000,
    "Exclusive | China Tries to Play the Role of Peacemaker in Ukraine - The Wall Street Journal"
  ],
  [
    1739426428000,
    "China hedges its energy bets as Russia pipeline plan remains on hold - South China Morning Post"
  ],
  [
    1739426940000,
    "China Plans to Sell 30-Year Yuan Bond in Hong Kong After Hiatus - Bloomberg"
  ],
  [
    1739430191000,
    "Chinese DNA study suggests southern Japanese came from home of Confucius - South China Morning Post"
  ],
  [
    1739432396000,
    "China proposes to host Trump-Putin talks without Ukraine's Zelensky, WSJ reports. - Kyiv Independent"
  ],
  [
    1739432929000,
    "Apple will integrate Alibaba's AI into iPhones in China, Chairman Joe Tsai says - CNBC"
  ],
  [
    1739432940000,
    "China proposes Putin-Trump summit to end Ukraine war, WSJ reports - Reuters"
  ],
  [
    1739433600000,
    "Thousands in Taiwan and China celebrate the Lantern Festival with high hopes and rice dumplings - The Associated Press"
  ],
  [
    1739433600000,
    "U.S. Relations With China - Department of State"
  ],
  [
    1739433902000,
    "Alibaba Wins Prized Role Powering AI on Apple’s iPhone in China - Bloomberg"
  ],
  [
    1739434520000,
    "Australia accuses China of 'unsafe' fighter jet move - BBC.com"
  ],
  [
    1739435340000,
    "What does Trump’s push for peace in Ukraine mean for China? - CNN"
  ],
  [
    1739435886000,
    "Alternative Chinese terminals emerge to take in sanctioned tankers, sources say - Reuters"
  ],
  [
    1739436761000,
    "Australia and China trade blame over fighter jet incident in South China Sea - Reuters"
  ],
  [
    1739440440000,
    "Apple picks Alibaba to launch AI features in China - CNN"
  ],
  [
    1739440860000,
    "Data Dive: China Tariffs Could Hike Cost of Food, Luggage, Furniture, Clothing - Honolulu Civil Beat"
  ],
  [
    1739442048000,
    "China's central bank pledges to adjust policy to support growth - Reuters.com"
  ],
  [
    1739442360000,
    "Australia accuses Chinese fighter of endangering Australian surveillance plane over South China Sea - The Associated Press"
  ],
  [
    1739442791000,
    "Australia, China trade barbs over midair encounter above South China Sea - Al Jazeera English"
  ],
  [
    1739443818000,
    "China sees 'in-depth' Cook Islands talks, partnership deal expected - Reuters"
  ],
  [
    1739446575000,
    "Chinese apps face scrutiny in US but users keep scrolling - Voice of America"
  ],
  [
    1739447601000,
    "Australia says Chinese fighter jet released flares that almost hit spy plane over South China Sea - CBS News"
  ],
  [
    1739447640000,
    "New coal power plant projects in China hit the highest level in nearly 10 years, report says - The Associated Press"
  ],
  [
    1739448984000,
    "China suggests Trump \"bullying\" Mexico - Newsweek"
  ],
  [
    1739449637000,
    "U.S. investors, Big Pharma race to find new medicines in China - CNBC"
  ],
  [
    1739450880000,
    "Has BBC changed its China coverage strategy? Recent positive stories surprise Chinese netizens - Global Times"
  ],
  [
    1739452717000,
    "China says Australian military plane intruded into its airspace - South China Morning Post"
  ],
  [
    1739453400000,
    "Trump must treat China, Iran, Russia and North Korea as a package deal - The Hill"
  ],
  [
    1739455507000,
    "iPhone AI features will be powered by Alibaba in China - The Verge"
  ],
  [
    1739457012000,
    "Exclusive: Trust in AI is much higher in China than in the U.S. - Axios"
  ],
  [
    1739457276000,
    "China’s answer to SpaceX - SpaceNews"
  ],
  [
    1739457739000,
    "Countering China’s diplomatic coup - The Economist"
  ],
  [
    1739457739000,
    "Hail China’s new “ice-and-snow economy” - The Economist"
  ],
  [
    1739457739000,
    "Tensions with the West are fuelling China’s anxiety about food supplies - The Economist"
  ],
  [
    1739457739000,
    "Chinese cars are taking over the global south - The Economist"
  ],
  [
    1739457739000,
    "South-East Asian producers are being hammered by Chinese imports - The Economist"
  ],
  [
    1739457739000,
    "New Zealand and the Cook Islands fall out over China - The Economist"
  ],
  [
    1739459005000,
    "Can China come out on top in a US trade war? - DW (English)"
  ],
  [
    1739459985000,
    "Lantern Festival celebrated with lights, rice dumplings in Taiwan and China - Al Jazeera English"
  ],
  [
    1739465286000,
    "China's 2024 coal power construction hits 10-year high, researchers say - Reuters"
  ],
  [
    1739467560000,
    "Top diplomats of Britain and China hold talks as part of efforts to rebuild ties - The Associated Press"
  ],
  [
    1739468323000,
    "Texas officials warn of mystery seed bags from China — again. What to do if you get one - Austin American-Statesman"
  ],
  [
    1739468393000,
    "How bleak is the outlook for China’s economy? - The Economist"
  ],
  [
    1739468858000,
    "China's Tencent wins video copyright infringement case in US district court - Reuters"
  ],
  [
    1739475580000,
    "How Disruptive Is DeepSeek? Stanford HAI Faculty Discuss China’s New Model - Stanford HAI"
  ],
  [
    1739475602000,
    "UN report: China expands forced labor in Xinjiang, Tibet - Voice of America"
  ],
  [
    1739475960000,
    "North Dakota was a leader in limiting China land purchases and sees no reason to stop - The Associated Press"
  ],
  [
    1739476260000,
    "Chinese Fighter Harassed Australian Surveillance Aircraft Over South China Sea, Official Say - USNI News"
  ],
  [
    1739476697000,
    "America’s rivalry with China will intensify, but must not escalate into war, writes Nicholas Burns - The Economist"
  ],
  [
    1739480743000,
    "Trump proposes nuclear deal with Russia and China to halve defense budgets - The Guardian US"
  ],
  [
    1739481521000,
    "NORAD Boss: China Will Increase Military Flights Near Alaska - Air & Space Forces Magazine"
  ],
  [
    1739482869000,
    "Trump wants U.S., China and Russia to cut military spending in half - Axios"
  ],
  [
    1739484949000,
    "Chinese diplomat visits UK, restarts dialogue - Voice of America"
  ],
  [
    1739485339000,
    "China military exercises near Taiwan could be used to conceal attack, US says - Financial Times"
  ],
  [
    1739485594000,
    "China is rehearsing for war, Indo-Pacific commander says - Defense One"
  ],
  [
    1739485606000,
    "Job seekers in China face gloomy labor market - Marketplace"
  ],
  [
    1739485713000,
    "Trump says he wants to work with Russia, China on limiting nuclear weapons - Reuters"
  ],
  [
    1739486520000,
    "'No reason' for new nukes: Trump floats disarmament talks with China, Russia - Fox News"
  ],
  [
    1739487831000,
    "Chinese exporters brace for 'rat race' in shift away from US - Reuters"
  ],
  [
    1739494080000,
    "China ready to continue improving ties, deepen cooperation with UK - Reuters"
  ],
  [
    1739497800000,
    "US Commander Warns of China, Russia, North Korea ‘Troublemakers’ - Bloomberg"
  ],
  [
    1739502840000,
    "Apple Plans to Overhaul China iPhones With AI by Middle of Year - Bloomberg"
  ],
  [
    1739503500000,
    "China keeps building mega coal projects - CNN"
  ],
  [
    1739503599000,
    "China’s marriage problem: fewer young people, and fewer weddings - Financial Times"
  ],
  [
    1739503920000,
    "Apple plans to launch AI features in China from May, Bloomberg News reports - Reuters"
  ],
  [
    1739504539000,
    "Trump’s tariffs shake global markets, but bigger shock is for China and India - The Economic Times"
  ],
  [
    1739507880000,
    "Iran is rearming its missile program and a ship of supplies just arrived from China, Western sources say - CNN"
  ],
  [
    1739509231000,
    "Calvin Klein blacklisting sends chill through US business in China - Financial Times"
  ],
  [
    1739509260000,
    "Chinese Companies Work Around Trump to Keep Selling to Americans - The Wall Street Journal"
  ],
  [
    1739510689000,
    "Alibaba Chair Confirms Apple AI Partnership in China - PYMNTS.com"
  ],
  [
    1739511000000,
    "After PVH blacklist, American fashion faces a rocky road in China - Vogue Business"
  ],
  [
    1739511720000,
    "China Money Markets Face $411 Billion Crunch as Congress Nears - Bloomberg"
  ],
  [
    1739512359000,
    "Where China’s Exports Begin: Inside the Vast Markets of Guangzhou - The New York Times"
  ],
  [
    1739513508000,
    "How China's DeepSeek could boost the already booming data center market - CNBC"
  ],
  [
    1739516396000,
    "China Invites Jack Ma and DeepSeek Founder to Meet Top Leaders - Yahoo Finance"
  ],
  [
    1739518620000,
    "Shipments of foreign-branded phones in China up 0.6% y/y in December, says CAICT - Reuters"
  ],
  [
    1739518740000,
    "Trump Floats Deal With Russia, China to Cut Defense Spending - Bloomberg"
  ],
  [
    1739519580000,
    "China rights monitors suspend work, lay off staff after U.S. aid freeze - Yahoo"
  ],
  [
    1739521136000,
    "China to develop gene-editing tools, new crop varieties in biotech initiative - Reuters"
  ],
  [
    1739522611000,
    "China’s Gaorong Ventures Invests $30 Million in Crypto Unicorn - Yahoo Finance"
  ],
  [
    1739523180000,
    "Trump wants denuclearization talks with Russia and China, hopes for defense spending cuts - The Associated Press"
  ],
  [
    1739524082000,
    "China’s EV giants are betting big on humanoid robots - MIT Technology Review"
  ],
  [
    1739525134000,
    "Xi to chair symposium attended by Jack Ma and other Chinese business leaders, sources say - Reuters"
  ],
  [
    1739525253000,
    "Xi to Meet With Business Leaders Such as Jack Ma, Reuters Says - Bloomberg"
  ],
  [
    1739526332000,
    "President Xi to meet China’s tech entrepreneurs in nod to breakthroughs - South China Morning Post"
  ],
  [
    1739527284000,
    "Exclusive: China's BYD holds mining rights in Brazil's Lithium Valley, documents show - Reuters"
  ],
  [
    1739527828000,
    "Lawmakers worry China could take over after Trump pauses foreign aid - ABC News"
  ],
  [
    1739528232000,
    "Philippines voices concern over China-Australia air encounter in South China Sea - Reuters"
  ],
  [
    1739528433000,
    "China Has Record Foreign Investment Outflow as $168 Billion Exit - Bloomberg"
  ],
  [
    1739528506000,
    "China's property loan contraction eases after government support - Reuters.com"
  ],
  [
    1739528760000,
    "Robotic exoskeletons help Chinese tourists climb the country’s most punishing mountain - CNN"
  ],
  [
    1739529713000,
    "China accuses Australia of deliberate provocation in South China Sea - Reuters"
  ],
  [
    1739530290000,
    "China January bank lending hits record high on policy stimulus - Reuters"
  ],
  [
    1739530320000,
    "Alibaba shares jump after reports that founder Jack Ma will meet president Xi Jinping, who oversaw crackdown on China's tech sector - Fortune"
  ],
  [
    1739530800000,
    "Meet 'Tansuo' and 'Wangyu,' China's next moon rover and astronaut spacesuit (video) - Space.com"
  ],
  [
    1739530800000,
    "China launches center to train 100-plus humanoid robots simultaneously - Fox News"
  ],
  [
    1739532360000,
    "China Says U.S. Should Lead Trump’s Proposed Arms Controls Push - The New York Times"
  ],
  [
    1739532942000,
    "China willing to deepen mutual political trust with Cook Islands, premier says - Reuters"
  ],
  [
    1739534446000,
    "The Last China Hand - Foreign Policy"
  ],
  [
    1739534722000,
    "China Reacts to Trump and Putin's Ukraine War Talks - Newsweek"
  ],
  [
    1739534725000,
    "FACTBOX China's AI firms take spotlight with deals, low-cost models - Reuters"
  ],
  [
    1739537460000,
    "China opens recruitment for ‘planetary defence force’ amid fears of asteroid hitting Earth - The Guardian"
  ],
  [
    1739538490000,
    "PVH’s Calvin Klein And Tommy Hilfiger Are First Fashion Victims Of U.S.-China Trade War - Forbes"
  ],
  [
    1739540220000,
    "Trump thinks antagonising China will help save the US economy. He couldn’t be more wrong - The Guardian"
  ],
  [
    1739541199000,
    "US-China Standoff on Who Runs the Afghanistan File at UN Signals Greater Tensions Ahead - Just Security"
  ],
  [
    1739541357000,
    "China hopes EU to reach 'political decision' on EV tariffs soon, commerce minister says - Reuters"
  ],
  [
    1739541638000,
    "South Korea’s likely next leader wants warmer ties with China, North Korea - The Washington Post"
  ],
  [
    1739543635000,
    "Applied Materials Stock Slips on Predicted China Sales Headwinds - Investopedia"
  ],
  [
    1739550274000,
    "China Hawks Are Reckoning With the Elon Musk Era - NOTUS"
  ],
  [
    1739552820000,
    "China’s role in global governance highlighted at 61st MSC - Global Times"
  ],
  [
    1739554254000,
    "China invites bids for lunar satellite to support crewed moon landing missions - SpaceNews"
  ],
  [
    1739557699000,
    "Wang Yi tells security forum China will respond ‘resolutely’ to US ‘bullying’ - South China Morning Post"
  ],
  [
    1739558069000,
    "China Will Have to Hit Back at US ‘Bullying,’ Top Diplomat Says - Bloomberg"
  ],
  [
    1739560891000,
    "Could Trump tariffs on China, Canada, Mexico hit Mississippi business and industry? - Clarion Ledger"
  ],
  [
    1739561420000,
    "China Finally Agrees With Trump - Newsweek"
  ],
  [
    1739566278000,
    "Nvidia cuts stake in Arm Holdings, discloses position in China's WeRide - Reuters"
  ],
  [
    1739566885000,
    "Brazil’s Lula chides Beijing, EU, US for practices that gave China its tech edge - South China Morning Post"
  ],
  [
    1739568410000,
    "U.S. Steel and Aluminum Tariffs Won’t Solve the Chinese Dumping Problem - Center for Strategic & International Studies"
  ],
  [
    1739568900000,
    "Vance turns on European allies in blistering speech that downplayed threats from Russia and China - CNN"
  ],
  [
    1739570414000,
    "China’s loss could be South Korea’s gain as Southeast Asia shifts arms spending - South China Morning Post"
  ],
  [
    1739572087000,
    "Quiet clash over Afghanistan may presage more US-China tensions at UN - South China Morning Post"
  ],
  [
    1739573085000,
    "GM closing plant in China as part of restructuring - Reuters"
  ],
  [
    1739576349000,
    "Cuts to U.S.-Backed Rights Groups Seen as a Win for China - The New York Times"
  ],
  [
    1739577608000,
    "How a Valentine’s Day fad sparked a ‘gold rush’ in China - South China Morning Post"
  ],
  [
    1739577764000,
    "Cook Islands signs partnership deal with China - Reuters"
  ],
  [
    1739583180000,
    "Rubio, Philippines’ Manalo Discuss South China Sea Coordination - Bloomberg"
  ],
  [
    1739587080000,
    "China’s animated blockbuster smashed box office records at home. Now it’s hitting Western cinemas - CNN"
  ],
  [
    1739590260000,
    "China says more Spanish firms welcome to tap its market - Reuters.com"
  ],
  [
    1739599220000,
    "Are China’s AI advancements a double-edged sword hanging over job prospects? - South China Morning Post"
  ],
  [
    1739602800000,
    "China and the UK: British Defenders of Jimmy Lai Need to Find Their Spines - Bloomberg"
  ],
  [
    1739604449000,
    "China extends reach in South Pacific with Cook Islands deal - The Washington Post"
  ],
  [
    1739604960000,
    "China will 'play along to the end' with U.S., its top diplomat says - Yahoo"
  ],
  [
    1739605260000,
    "China and US must not come into conflict, or the world will suffer, says Wang Yi at Munich Security Conference - Global Times"
  ],
  [
    1739605869000,
    "China, Cook Islands sign strategic partnership pact - Voice of America"
  ],
  [
    1739606400000,
    "Trump must avoid an 'ugly deal' with China - Nikkei Asia"
  ],
  [
    1739606408000,
    "Quantum entanglement theory first proved by Chinese woman in 1949 - South China Morning Post"
  ],
  [
    1739608200000,
    "China Stocks Rise Despite Tariffs and Property Woes. Will It Last? - Barron's"
  ],
  [
    1739608860000,
    "Iran’s oil sales to China plummet, revenue decline deepens | Iran International - ایران اینترنشنال"
  ],
  [
    1739613618000,
    "US aid freeze presents an opportunity for China in Afghanistan. Will it take it? - South China Morning Post"
  ],
  [
    1739615811000,
    "China calls for all stakeholders in Ukraine war to be in peace process - Reuters.com"
  ],
  [
    1739619909000,
    "In a Trump a Trade War Against Europe, China Wins: New Economy Saturday - Bloomberg"
  ],
  [
    1739620800000,
    "Metals Crucial to Clean Energy Are Getting Caught Up in the US–China Trade War - WIRED"
  ],
  [
    1739621520000,
    "Tesla is suing critics and customers in China alike—and can count on its ties to the regime to tip the scales in its favor - Fortune"
  ],
  [
    1739621520000,
    "US allies say China's fighter jets are using dangerous tactics to warn off aircraft — like popping flares and chaff - Business Insider"
  ],
  [
    1739622991000,
    "AI Replaces Boyfriends In China, Making Entrepreneur Yao Runhao A Billionaire - NDTV"
  ],
  [
    1739624414000,
    "MI5 investigates use of Chinese green technology in UK - Financial Times"
  ],
  [
    1739624803000,
    "DeepSeek, ancient Chinese wisdom mix as China underlines resolve at Munich forum - South China Morning Post"
  ],
  [
    1739635908000,
    "China seeks stronger cooperation with Germany and EU - Reuters"
  ],
  [
    1739639245000,
    "French foreign minister to visit China, hoping to end cognac tariffs - EURACTIV"
  ],
  [
    1739644008000,
    "China courts frazzled Europe as Western alliance wavers - South China Morning Post"
  ],
  [
    1739655027000,
    "MSC: Can China replace US as world leader? - DW (English)"
  ],
  [
    1739656326000,
    "Beijing, Philippines spar over South China Sea claims during Munich conference - South China Morning Post"
  ],
  [
    1739656819000,
    "How China’s adoption laws risk freezing children out of family life - South China Morning Post"
  ],
  [
    1739656925000,
    "Ukraine's senior officials discuss Kyiv's peace vision with China's foreign minister - Reuters UK"
  ],
  [
    1739659643000,
    "Ukraine says ‘China has a crucial role to play in achieving peace’ - South China Morning Post"
  ],
  [
    1739663160000,
    "China expects fair, lasting, binding peace agreement for Ukraine crisis: FM - Global Times"
  ],
  [
    1739663460000,
    "Revealed: Google facilitated Russia and China’s censorship requests - The Guardian"
  ],
  [
    1739664000000,
    "DeepSeek Drives $1.3 Trillion China Stock Rally as Funds Pile In - Bloomberg"
  ],
  [
    1739664027000,
    "Hong Kong: The A-level student who became an enemy of the Chinese state - BBC.com"
  ],
  [
    1739664960000,
    "Success of 'Ne Zha 2' spotlights appeal, prowess, creativity of Chinese culture - China Daily"
  ],
  [
    1739667615000,
    "How DeepSeek’s AI has become a must-have feature in Chinese smart EVs - South China Morning Post"
  ],
  [
    1739671211000,
    "Could DeepSeek help China’s yuan dethrone the US dollar? - South China Morning Post"
  ],
  [
    1739671216000,
    "Could USAID’s closure open the door for Chinese soft power in the Global South? - South China Morning Post"
  ],
  [
    1739671313000,
    "PHOTOS: 2025 San Francisco Chinese New Year Parade - ABC7 Bay Area"
  ],
  [
    1739673014000,
    "China’s online sellers face turmoil after Trump’s tariff reversal - South China Morning Post"
  ],
  [
    1739674820000,
    "China tightens grip on tech, minerals and engineers as trade war spirals - Financial Times"
  ],
  [
    1739676000000,
    "China open to good ties with Czech Republic provided core interests respected: FM - Global Times"
  ],
  [
    1739682000000,
    "Auto industry's China-driven evolution validates Warren Buffett's wariness - Nikkei Asia"
  ],
  [
    1739683860000,
    "Nearly 162K counterfeit US ‘forever’ stamps from China seized in Chicago - New York Post"
  ],
  [
    1739685605000,
    "Opinion | What America Can Gain if Trump Goes to China - The New York Times"
  ],
  [
    1739685609000,
    "China surgeon who lost 25kg in 42 days wins multiple awards in fitness contest - South China Morning Post"
  ],
  [
    1739685617000,
    "Chinese scientists investigate whether microbe in food eases autism symptoms - South China Morning Post"
  ],
  [
    1739689209000,
    "‘Wilful pollution’: China’s space debris puts Philippines on edge - South China Morning Post"
  ],
  [
    1739693013000,
    "Weixin is testing DeepSeek to put China’s super app on steroids - South China Morning Post"
  ],
  [
    1739696353000,
    "China still willing to boost Israel ties despite strains from Gaza conflict - South China Morning Post"
  ],
  [
    1739696410000,
    "Focus - Panama Canal caught in power struggle as US and China vie for trade dominance - FRANCE 24 English"
  ],
  [
    1739700008000,
    "China twin sisters and brothers hold joint engagement party, captivate millions - South China Morning Post"
  ],
  [
    1739700011000,
    "Will China fill gap left by the US at G20 meeting in South Africa? - South China Morning Post"
  ],
  [
    1739701422000,
    "Taiwan detects 24 Chinese military aircrafts near island - Al Jazeera English"
  ],
  [
    1739706689000,
    "Trump-Putin phone call: As Europe outrages, what are the views within China? - The Indian Express"
  ],
  [
    1739707208000,
    "Chinese scientists make rare, ultra-hard, pure ‘super diamond’ in the lab - South China Morning Post"
  ]
]