[
  [
    1732320000000,
    "Elon Musk’s Model Mother Sees Celebrity Takeoff in China - Bloomberg"
  ],
  [
    1732321020000,
    "Suspected China-linked hack on US telecoms worst in nation's history, senator says - Reuters"
  ],
  [
    1732325155000,
    "China's sinkholes: Tourist boom threatens ancient forests - BBC.com"
  ],
  [
    1732327278000,
    "Emerging Details of Chinese Hack Leave U.S. Officials Increasingly Concerned - The New York Times"
  ],
  [
    1732327479000,
    "White House officials meet with telecoms execs on suspected China hack - Reuters"
  ],
  [
    1732334760000,
    "Cambodia's flagship canal in hot water as China funding dries up - Reuters"
  ],
  [
    1732358760000,
    "Amber Glenn wins ISU GP Cup of China 2024 to surge into Grand Prix Final - Olympics"
  ],
  [
    1732363200000,
    "Amber Glenn wins Cup of China, joins exclusive U.S. figure skating club - NBC Sports"
  ],
  [
    1732363800000,
    "Google Exposes GLASSBRIDGE: A Pro-China Influence Network of Fake News Sites - The Hacker News"
  ],
  [
    1732371300000,
    "ISU Grand Prix Cup of China 2024: Full schedule, all results, scores, and standings - Complete list - Olympics"
  ],
  [
    1732374457000,
    "What happens when China puts boots on the ground in Myanmar? - Radio Free Asia"
  ],
  [
    1732384842000,
    "China looks to step into global vacuum as Trump vows to pull U.S. back - The Washington Post"
  ],
  [
    1732390221000,
    "Opinion | China’s crackdown on Hong Kong is a test for Trump - The Washington Post"
  ],
  [
    1732395744000,
    "The shocking truth behind China’s EV dominance and America’s uphill battle - Autoblog"
  ],
  [
    1732402860000,
    "National security officials meet with US telecom execs to share intel on Chinese cyber-espionage campaign, White House says - CNN"
  ],
  [
    1732403397000,
    "Admiral Warns Russia Will Help China Cut US Military Dominance: Here's How - Newsweek"
  ],
  [
    1732406400000,
    "Man Group, Abrdn Count on China Stimulus to Revive Bull Run - Bloomberg"
  ],
  [
    1732424467000,
    "China’s cash-strapped shoppers drawn to second-hand luxury items - Financial Times"
  ],
  [
    1732435208000,
    "‘Recoilless AK-47’ that can be used by most drones built by Chinese scientists - South China Morning Post"
  ],
  [
    1732435934000,
    "China to Crack Down on Unfair Algorithm-Based Internet Practices - Bloomberg"
  ],
  [
    1732443428000,
    "China's local governments step up public safety measures after attacks - Reuters"
  ],
  [
    1732443720000,
    "China Looks to Musk as Conduit to Trump, Seeking to Ward Off Harsh Policies - The Wall Street Journal"
  ],
  [
    1732454715000,
    "Fund managers at Fidelity share how they’re playing China’s stimulus plans - CNBC"
  ],
  [
    1732455720000,
    "China, EU reportedly nearing a solution over Chinese EV tariffs - Global Times"
  ],
  [
    1732470300000,
    "Beijing renews crackdown on Chinese tech companies’ use of algorithms - Semafor"
  ],
  [
    1732478640000,
    "China unnerved by Russia’s growing ties with North Korea, claims US official - The Guardian"
  ],
  [
    1732482000000,
    "China Investors Digest Another Letdown From Big Tech Earnings - Yahoo Finance"
  ],
  [
    1732483808000,
    "Opinion | Exit America, enter China? How Beijing can benefit from an isolationist US - South China Morning Post"
  ],
  [
    1732492800000,
    "Trump can do a business deal with China - China Daily"
  ],
  [
    1732492887000,
    "Huawei to launch phone with own software in sign of China-US splintering - Financial Times"
  ],
  [
    1732498740000,
    "Elon Musk Says FSD V13 'Coming Soon' As Tesla Cuts China Prices - Investor's Business Daily"
  ],
  [
    1732499400000,
    "China Keeps Policy Loan Rate Unchanged for Second Month - Bloomberg"
  ],
  [
    1732500018000,
    "Coating makes China’s stealth aircraft invisible to anti-stealth radar: study - South China Morning Post"
  ],
  [
    1732501323000,
    "China-India ties to be more resilient in the Trump 2.0 era - The Interpreter"
  ],
  [
    1732501980000,
    "Chinese startups suffer as IPO freeze prompts investors to exercise redemption rights - Reuters"
  ],
  [
    1732503480000,
    "Apple Chief Returns to China as Beijing Prepares to Fete CEOs - Bloomberg"
  ],
  [
    1732503600000,
    "Thailand, the 'Detroit of Southeast Asia', is at the forefront of China’s battle for the global auto market - Fortune"
  ],
  [
    1732503737000,
    "Taiwan reports Chinese balloon, first time in six months - Reuters"
  ],
  [
    1732503780000,
    "China’s Decades-Long Dairy Boom Is Drawing to a Close, Says S&P - Bloomberg"
  ],
  [
    1732506801000,
    "China calls for 'common disputes' to be probed following series of deadly attacks - UPI News"
  ],
  [
    1732507331000,
    "[News] Biden Reportedly to Unveil New China Export Rules This Week, Affecting 200 Chinese Chip Firms - TrendForce"
  ],
  [
    1732507864000,
    "Meituan, Chow Tai Fook Earnings to Offer Clues on China Consumer Sentiment - Yahoo Finance"
  ],
  [
    1732507920000,
    "Watch Why Elon Musk's Mother Is Popular in China - Bloomberg"
  ],
  [
    1732508760000,
    "China's central bank keeps medium-term loan rate unchanged amid yuan weakness - CNBC"
  ],
  [
    1732511040000,
    "EU, China close to minimum pricing deal for EVs, trade official says - Automotive News"
  ],
  [
    1732511322000,
    "Is China being played by North Korea and Russia? - Responsible Statecraft"
  ],
  [
    1732511400000,
    "China Box Office: ‘Her Story’ Claims Victory as ‘Gladiator II’ Opens in Fourth Place - Variety"
  ],
  [
    1732512480000,
    "How Trump’s Tariffs on China Changed U.S. Trade, in Charts - The Wall Street Journal"
  ],
  [
    1732513740000,
    "‘Kraven the Hunter’ Sets Release in Mainland China Theaters - Variety"
  ],
  [
    1732514040000,
    "Bessent at Treasury May Give China Breathing Room Over Tariffs - Bloomberg"
  ],
  [
    1732514431000,
    "Ex-Chinese gymnast Wu blasted by Olympic champion Guan for posting ‘sexy’ videos - South China Morning Post"
  ],
  [
    1732516489000,
    "China c.bank injects $124 bln into banking system via one-year policy loans - Reuters"
  ],
  [
    1732516655000,
    "Texas takes the lead in deeper decoupling from China - Asia Times"
  ],
  [
    1732517340000,
    "China issues extra crude oil import quota to independent refineries, sources say - Reuters"
  ],
  [
    1732518026000,
    "Apple’s Cook makes third trip to China in 2024 amid iPhone slump and AI uncertainty - South China Morning Post"
  ],
  [
    1732519740000,
    "China and EU are not adversaries, says Chinese foreign minister - Reuters"
  ],
  [
    1732519774000,
    "Taiwan says Chinese balloon detected near island - VOA Asia"
  ],
  [
    1732519920000,
    "China hopes Japan works towards improved people exchanges after visa-free announcement - Reuters.com"
  ],
  [
    1732521305000,
    "Taiwan reports sighting of Chinese balloon near island - Al Jazeera English"
  ],
  [
    1732523400000,
    "Will Trump’s plan to kill the EV tax credit help China? - Canary Media"
  ],
  [
    1732524463000,
    "Beyond TikTok — The National Security Risks of Chinese Agricultural Drones - War On The Rocks"
  ],
  [
    1732525200000,
    "'Be aware': House lawmakers describe what it's like living under threat by China, Iran - Fox News"
  ],
  [
    1732526845000,
    "China flies balloon close to Taiwan, Taipei says - DW (English)"
  ],
  [
    1732526942000,
    "G-7 Poised to Boost Pressure on China Over Russian Support - Bloomberg"
  ],
  [
    1732529372000,
    "Alex Wong: What Trump's New National Security Official Has Said About China - Newsweek"
  ],
  [
    1732532401000,
    "China's People Deserve the Truth—Not Censorship | Opinion - Newsweek"
  ],
  [
    1732532415000,
    "China’s GDP forecast cut as Trump trade worries take hold before new term - South China Morning Post"
  ],
  [
    1732532895000,
    "European Union launches WTO case against Chinese tariffs on brandy exports - South China Morning Post"
  ],
  [
    1732533420000,
    "Foreign Ministry Spokesperson Mao Ning’s Regular Press Conference on November 25, 2024 - MFA China"
  ],
  [
    1732535054000,
    "China launches pair of SuperView Neo-2 radar satellites - SpaceNews"
  ],
  [
    1732536060000,
    "China is increasingly unnerved by Russia and North Korea's growing alliance, says top US official - Business Insider"
  ],
  [
    1732537431000,
    "China welcomes Nvidia's continued presence, pledges better environment for foreign firms - Yahoo Finance"
  ],
  [
    1732539024000,
    "EU challenges Chinese brandy tariffs at WTO - Reuters"
  ],
  [
    1732539615000,
    "Russia’s ‘economic isolation’ seen benefiting China amid fresh US sanctions - South China Morning Post"
  ],
  [
    1732540500000,
    "China has utterly pwned 'thousands and thousands' of devices at US telcos - The Register"
  ],
  [
    1732541692000,
    "Apple’s Cook Joins CEO Summit With Chinese Premier on Trade - Bloomberg"
  ],
  [
    1732542300000,
    "China and Canada respond to Trump’s tariff threats and border comments – as it happened - The Guardian US"
  ],
  [
    1732543440000,
    "Is China Getting Ready For A Trade War? - Agweb Powered by Farm Journal"
  ],
  [
    1732544474000,
    "Is China headed for new White Paper protests? - DW (English)"
  ],
  [
    1732544984000,
    "Chinese trans woman awarded thousands over forced electroshock \"conversion therapy\" hopes for change - CBS News"
  ],
  [
    1732545345000,
    "EU not close to deal with China on EV tariffs, officials say - Reuters"
  ],
  [
    1732547863000,
    "China's White Emperor 6th Generation NGAD Fighter Summed Up in 2 Words - The National Interest Online"
  ],
  [
    1732548600000,
    "Apple’s Thin iPhone Has No Physical SIMs—That Could Dampen China Sales - The Information"
  ],
  [
    1732549448000,
    "EU To Target Chinese Firms With Asset Freezes, Visa Bans For Aiding Russia In Ukraine - Radio Free Europe / Radio Liberty"
  ],
  [
    1732551120000,
    "Trump tariff on China could lower global inflation, says UK economist - The Guardian"
  ],
  [
    1732555500000,
    "Huawei’s new smartphone marks a ‘turning point’ for US-China tech war - Semafor"
  ],
  [
    1732559695000,
    "China, the US, and Averting Nuclear Götterdämmerung - Center for European Policy Analysis"
  ],
  [
    1732559703000,
    "China Concedes to US Ally Japan Near Maritime Flashpoint - Newsweek"
  ],
  [
    1732564590000,
    "Denmark says in talks with China over ship linked to cut undersea cables - South China Morning Post"
  ],
  [
    1732566361000,
    "China’s Salt Typhoon hackers target telecom firms in Southeast Asia with new malware - The Record from Recorded Future News"
  ],
  [
    1732567598000,
    "Tariffs on China or Mexico, Not Both - American Enterprise Institute"
  ],
  [
    1732571861000,
    "News updates from November 25: Trump says he will hit China, Canada and Mexico with new tariffs, UniCredit makes €10bn offer for Italian rival Banco BPM - Financial Times"
  ],
  [
    1732574360000,
    "China could respond 'asymmetrically' to Trump tariffs: Expert - Yahoo Finance"
  ],
  [
    1732578507000,
    "Donald Trump Plans 10% Tariffs on China Goods, 25% on Mexico and Canada - Bloomberg"
  ],
  [
    1732578906000,
    "Trump Roils Markets With Tariff Threat on China, Mexico, Canada - Bloomberg"
  ],
  [
    1732579129000,
    "Trump vows new Canada, Mexico, China tariffs that threaten global trade - Reuters"
  ],
  [
    1732579140000,
    "Trump says he will impose new tariffs on Canada, Mexico and China on first day - The Hill"
  ],
  [
    1732579200000,
    "China, the U.S. & the Rise of Xi Jinping - PBS"
  ],
  [
    1732579218000,
    "US task force backs Philippine Sea operations in ‘clear signal to China’ - South China Morning Post"
  ],
  [
    1732579680000,
    "Trump vows 25% tariffs on Mexico and Canada and deeper tariffs on China - The Guardian US"
  ],
  [
    1732580285000,
    "Donald Trump Threatens Even Higher Tariffs on China, Canada and Mexico - Newsweek"
  ],
  [
    1732580310000,
    "Trump ups the ante on tariffs, vowing massive taxes on goods from Mexico, Canada and China on Day 1 - CNN"
  ],
  [
    1732580588000,
    "Trump plans new tariffs on Canada, Mexico and China - Axios"
  ],
  [
    1732581140000,
    "Trump Promises New Tariffs On China, Mexico, Canada After Taking Office - Forbes"
  ],
  [
    1732581180000,
    "Trump vows an additional 10% tariff on China, 25% tariffs on Canada and Mexico - CNBC"
  ],
  [
    1732582851000,
    "US-China Relations in the Biden-Era: A Timeline - China Briefing"
  ],
  [
    1732585097000,
    "Trump plans new tariffs on goods from China, Canada, and Mexico - NBC News"
  ],
  [
    1732585193000,
    "Trump threatens Canada, Mexico, China with tariffs - NPR"
  ],
  [
    1732586100000,
    "'No one will win a trade war,' China says after Trump tariff threat - Reuters"
  ],
  [
    1732587713000,
    "Trump vows massive tariffs on Mexico, Canada, and China on day one of his presidency - Le Monde"
  ],
  [
    1732589160000,
    "Trump threatens Mexico, China, and Canada with tariffs over immigration and drugs - The Independent"
  ],
  [
    1732590675000,
    "Trump says he'll slap tariffs on Canada, China and Mexico on Day 1 - ABC News"
  ],
  [
    1732590840000,
    "China Draws a Red Line for the Yuan as Trump Risks Return - Yahoo Finance"
  ],
  [
    1732591500000,
    "Trump Pledges Tariffs on Mexico, Canada and China - The Wall Street Journal"
  ],
  [
    1732591800000,
    "China's yuan slides to four-month low on Trump's tariff promise - Reuters"
  ],
  [
    1732596268000,
    "China is Negotiating Over Access to Bulker Suspected of Subsea Sabotage - The Maritime Executive"
  ],
  [
    1732597200000,
    "How America’s War on Chinese Tech Backfired: And Why Trump’s Plans Would Make Things Even Worse - Foreign Affairs Magazine"
  ],
  [
    1732597206000,
    "Apple hits hurdles in China with AI rollout for iPhones - Financial Times"
  ],
  [
    1732597211000,
    "China’s Police Are Preying on Small Firms in Search of Cash - The New York Times"
  ],
  [
    1732602564000,
    "Tim Cook and other U.S. executives attend China expo, meet officials as Trump tariff threat looms - CNBC"
  ],
  [
    1732604537000,
    "China Hits Back At Trump Tariff Announcement—As Asian Stocks Fall - Forbes"
  ],
  [
    1732606380000,
    "China's CATL says has no suppliers from Xinjiang region - Reuters"
  ],
  [
    1732606783000,
    "China Issues Warning to Trump Over Tariffs: 'No One Will Win' - Newsweek"
  ],
  [
    1732609380000,
    "Trump fires the first salvo in his renewed trade war with China: A 10% across-the-board tariff - Fortune"
  ],
  [
    1732609893000,
    "China sends naval, air forces to shadow US plane over Taiwan Strait - Reuters"
  ],
  [
    1732610505000,
    "US Air Force Chief's Stark Warning About War With Russia and China - Newsweek"
  ],
  [
    1732610991000,
    "China’s Huawei Takes Aim at Apple With Latest Smartphone - The New York Times"
  ],
  [
    1732613230000,
    "Myanmar rebel army ready for talks with junta, backed by China - NBC News"
  ],
  [
    1732614317000,
    "Pakistan tests secret China-like ‘firewall’ to tighten online surveillance - Al Jazeera English"
  ],
  [
    1732615751000,
    "Fentanyl Rises Again, This Time as Trump’s Diplomatic Weapon Against China - The New York Times"
  ],
  [
    1732616054000,
    "Chinese ship linked to cable sabotage urged to move into Swedish waters - Financial Times"
  ],
  [
    1732616103000,
    "After Trump’s Tariff Threat, Is a China Currency War Next? - The New York Times"
  ],
  [
    1732616760000,
    "Ex-Bank of China chairman gets suspended death sentence for bribery, state media reports - Reuters"
  ],
  [
    1732621747000,
    "Tencent to end Nintendo Switch eShop sales and services in China from 2026 - Reuters"
  ],
  [
    1732622045000,
    "Trump Threatens 25% Import Tariffs on Mexico, Canada, Additional 10% on China - Investopedia"
  ],
  [
    1732622400000,
    "Trump camp says China is ‘attacking’ U.S. with fentanyl. A fight looms - Reuters"
  ],
  [
    1732626000000,
    "China sucks up seaborne thermal coal, but domestic output caps prices - Reuters"
  ],
  [
    1732626000000,
    "China’s famously rich dinosaur fossil beds get a new origins story - Science News Magazine"
  ],
  [
    1732626211000,
    "New Report: China Cuts Pilot Training Time, Aims to Modernize by 2030 - Air & Space Forces Magazine"
  ],
  [
    1732627162000,
    "Myanmar: How far will China go to keep junta afloat? - DW (English)"
  ],
  [
    1732627877000,
    "Donald Trump says he will hit China, Canada and Mexico with new tariffs - Financial Times"
  ],
  [
    1732628126000,
    "'I don't want to do this anymore!': China's new 5,000 foot attraction terrifies tourist - CNN"
  ],
  [
    1732628220000,
    "Donald Trump Threatens Big Tariff Hikes On China, Canada, Mexico On Day One - Investor's Business Daily"
  ],
  [
    1732628331000,
    "China’s influence grows at COP29 climate talks as US leadership fades - The Conversation"
  ],
  [
    1732628680000,
    "3 Essential Vitamins Tell the Story of U.S. Dependence on China - HBR.org Daily"
  ],
  [
    1732629600000,
    "TSMC’s Push to Be Tech’s Switzerland in Doubt as U.S.-China Tensions Grow - The Information"
  ],
  [
    1732630092000,
    "U.S. Navy aircraft shadowed by Chinese warplanes as it flies over Taiwan Strait - CBS News"
  ],
  [
    1732630186000,
    "Nintendo to close Switch eShop and online services in China in 2026 - GamesIndustry.biz"
  ],
  [
    1732632120000,
    "Trump’s sharp tariff hikes could speed up China’s shift to new markets and offshore factories - The Associated Press"
  ],
  [
    1732632422000,
    "China in Latin America: November 2024 - Council on Foreign Relations"
  ],
  [
    1732634550000,
    "'Counter to facts and reality': China, Mexico, Canada respond to Trump tariff threats - USA TODAY"
  ],
  [
    1732636735000,
    "Trump pledges Mexico, Canada, China tariffs over border, fentanyl - NewsNation Now"
  ],
  [
    1732638600000,
    "What are Trump’s plans for tariffs on China, Canada and Mexico? - Al Jazeera English"
  ],
  [
    1732638924000,
    "China Scrambles Jets Against US Military Plane - Newsweek"
  ],
  [
    1732639760000,
    "As Trump Vows Larger China Tariffs, How Did His Trade War Play Out the First Time Around? - PBS"
  ],
  [
    1732645496000,
    "Trump threatens to impose sweeping new tariffs on Mexico, Canada and China on first day in office - CBS News"
  ],
  [
    1732646788000,
    "Violent attacks in China fuel concerns some are ‘taking revenge’ on society - The Washington Post"
  ],
  [
    1732647180000,
    "Is the China-US fentanyl pipeline really responsible for the US opioid crisis? - The Guardian"
  ],
  [
    1732648865000,
    "China's been trying to 'Trump-proof' its economy amid his tariff threats, experts say - ABC News"
  ],
  [
    1732650900000,
    "Opinion | The U.S. Is Losing the Ability to Deter War With China - The Wall Street Journal"
  ],
  [
    1732651955000,
    "The Turning Point? U.S.-China Relations, Economic Growth, and the Race for Technology Leadership - Center for Strategic & International Studies"
  ],
  [
    1732653016000,
    "Opinion | Trump can’t bully the world out of doing business with China - The Washington Post"
  ],
  [
    1732653930000,
    "China warns NZ against joining AUKUS amid security concerns -report - Reuters.com"
  ],
  [
    1732656480000,
    "What Trump’s Tariffs Will Mean for China - Foreign Policy"
  ],
  [
    1732658400000,
    "Chinese Carmakers Are Trouncing Once-Unbeatable Japanese Rivals - Bloomberg"
  ],
  [
    1732665697000,
    "Five things the market got wrong about China’s stimulus package - Financial Times"
  ],
  [
    1732667283000,
    "China state media warn Trump against mutually destructive tariff war - Reuters"
  ],
  [
    1732668960000,
    "US' largest trade partners Mexico, Canada and China respond to Trump's tariff threat - The Times of India"
  ],
  [
    1732670759000,
    "Pakistan and China’s diplomatic relations reach a low ebb - The Interpreter"
  ],
  [
    1732671840000,
    "China's industrial profits fall by 10% in October as deflation worries linger - CNBC"
  ],
  [
    1732672503000,
    "Exclusive: In careful protest, China Evergrande's investors press for action - Reuters.com"
  ],
  [
    1732674401000,
    "China’s emissions peak in sight as solar and electric cars boom - Financial Times"
  ],
  [
    1732675980000,
    "China’s hottest new tourist attraction is 5,000 feet in the air - CNN"
  ],
  [
    1732676828000,
    "Canada, Mexico and China respond to Trump tariff threats - BBC.com"
  ],
  [
    1732678140000,
    "China’s bid to join major trade bloc kicked into the long grass - POLITICO Europe"
  ],
  [
    1732680600000,
    "China’s Battling Solar Exporters Aim to End ‘Unfair’ Competition - Bloomberg"
  ],
  [
    1732683634000,
    "China investigates defense minister for corruption — report - DW (English)"
  ],
  [
    1732683677000,
    "China’s market targets are ‘just psychological’, says former regulator - Financial Times"
  ],
  [
    1732684020000,
    "China Is Bombarding Tech Talent With Job Offers. The West Is Freaking Out. - The Wall Street Journal"
  ],
  [
    1732684860000,
    "Leaked BYD Letter Signals China EV Price War Is Set to Intensify - Bloomberg"
  ],
  [
    1732685850000,
    "China’s defence minister placed under investigation for corruption - Financial Times"
  ],
  [
    1732688073000,
    "China Oct industrial profits narrow decline, but headwinds loom - Reuters"
  ],
  [
    1732690273000,
    "China launches corruption probe against Defence Minister Dong Jun: Report - Al Jazeera English"
  ],
  [
    1732690500000,
    "A moment that changed me: at seven, I saw the truth of China’s one-child policy – and felt my parents’ pain - The Guardian"
  ],
  [
    1732692420000,
    "China calls report that Defence Minister Dong Jun is under probe 'shadow-chasing' - Reuters.com"
  ],
  [
    1732693980000,
    "Sweden urges Chinese ship to return for undersea cable investigation - Reuters"
  ],
  [
    1732694635000,
    "China Defense Minister Investigated for Corruption, FT Says - Bloomberg"
  ],
  [
    1732695687000,
    "Volkswagen to Exit China’s Xinjiang Region After 12 Years - The New York Times"
  ],
  [
    1732696087000,
    "Foreign smartphone sales in China drop 44.25% y/y in Oct, data shows - Reuters"
  ],
  [
    1732697368000,
    "BYD asks suppliers to cut prices as China auto war intensifies - Yahoo Finance"
  ],
  [
    1732699058000,
    "Trump’s Trade Chief Advocates ‘Strategic Decoupling’ From China - Bloomberg"
  ],
  [
    1732701720000,
    "China’s CO2 emissions have peaked or will in 2025, say 44% of experts in survey - The Guardian"
  ],
  [
    1732702957000,
    "BYD and Rivals in China Tell Suppliers to Cut Costs Amid Price War - The New York Times"
  ],
  [
    1732704421000,
    "It’s not us, it’s you: China’s surging overcapacities and distortive exports are pressuring many developing countries too - Mercator Institute for China Studies (MERICS)"
  ],
  [
    1732707238000,
    "China Responds to Possible EU Sanctions Over Russia War Drones - Newsweek"
  ],
  [
    1732707717000,
    "Germany issues more investment guarantees for business in China - Reuters"
  ],
  [
    1732709813000,
    "'Supergiant' gold deposit discovered in China is one of the largest on Earth — and is worth more than $80 billion - Livescience.com"
  ],
  [
    1732710785000,
    "China could launch military drills near Taiwan over president's Pacific visit, sources say - Reuters"
  ],
  [
    1732716720000,
    "China releases 3 'wrongfully detained' Americans, White House says - Fox News"
  ],
  [
    1732717227000,
    "Three Americans Held for Years in China Released - Newsweek"
  ],
  [
    1732718340000,
    "Volkswagen sells its car plant in Xinjiang, citing ‘economic reasons’ - CNN"
  ],
  [
    1732718760000,
    "Exclusive | Chinese Ship’s Crew Suspected of Deliberately Dragging Anchor for 100 Miles to Cut Baltic Cables - The Wall Street Journal"
  ],
  [
    1732718917000,
    "3 Americans held for years in China, Mark Swidan, Kai Li and John Leung, have been released, White House says - ABC7 Los Angeles"
  ],
  [
    1732720348000,
    "3 Americans released by China - VOA Asia"
  ],
  [
    1732720980000,
    "China releases three US citizens held for years in prisoner swap - The Guardian US"
  ],
  [
    1732721827000,
    "Volkswagen to exit China's Xinjiang, sell factory - DW (English)"
  ],
  [
    1732721844000,
    "US exchanges Chinese detainees for 3 imprisoned Americans - POLITICO"
  ],
  [
    1732723449000,
    "US brokers release of three Americans it says were wrongly detained in China - USA TODAY"
  ],
  [
    1732724829000,
    "Houstonian Mark Swidan to be released from Chinese imprisonment - The Texas Tribune"
  ],
  [
    1732725049000,
    "China releases three US citizens in final days of Biden term: White House - Al Jazeera English"
  ],
  [
    1732726120000,
    "China's cut to coal power share is a rare but key climate win - Reuters"
  ],
  [
    1732726188000,
    "China off track on emissions goals as energy demand offsets renewables push, researchers say - Reuters"
  ],
  [
    1732726963000,
    "China Has a New Playbook to Counter Trump: ‘Supply Chain Warfare’ - The New York Times"
  ],
  [
    1732730040000,
    "Three Americans wrongfully detained in China released in prisoner swap - The Washington Post"
  ],
  [
    1732730340000,
    "Three Americans freed in prisoner swap with China - Axios"
  ],
  [
    1732730682000,
    "How Trump’s Tariffs Could Impact Top Imports From Mexico, Canada, and China - TIME"
  ],
  [
    1732732320000,
    "Trump's proposed tariffs on Mexico, Canada, China will increase inflation, Goldman Sachs warns - Fox Business"
  ],
  [
    1732732447000,
    "China has freed 3 Americans following an apparent prisoner swap deal with the U.S. - NPR"
  ],
  [
    1732734662000,
    "State Dept. downgrades China travel warning after prisoner swap - POLITICO"
  ],
  [
    1732735125000,
    "Three Americans detained by China are released - MSNBC"
  ],
  [
    1732741260000,
    "What are tariffs and why is Trump levying them on Canada, Mexico and China? - The Guardian US"
  ],
  [
    1732741651000,
    "Houstonian Mark Swidan among 3 Americans released from China as part of agreement with U.S. - ABC13 Houston"
  ],
  [
    1732741800000,
    "Nvidia Slips Again On Post-Earnings Blues, New China Trade War - Investor's Business Daily"
  ],
  [
    1732742700000,
    "China Releases Three American Prisoners in Swap With U.S. - The Wall Street Journal"
  ],
  [
    1732747260000,
    "3 Americans held for years in China have been released, White House says - WESH 2 Orlando"
  ],
  [
    1732747809000,
    "US to Introduce New Restrictions on China’s Access to Cutting-Edge Chips - WIRED"
  ],
  [
    1732748429000,
    "Buying Into China Stimulus Is ‘Painful Trade,’ Lombard Odier Says - Bloomberg"
  ],
  [
    1732750440000,
    "US secures release of 3 Americans in prisoner swap with China - CNN"
  ],
  [
    1732753696000,
    "Convicted ex-Chicago Illinois Institute of Technology college student Chaoqun Ji part of U.S.-China spy swap - ABC7 Chicago"
  ],
  [
    1732755600000,
    "Why Is China Purging Some of Its Most Senior Military Leaders? - Bloomberg"
  ],
  [
    1732755900000,
    "China’s EV Boom Threatens to Push Gasoline Demand Off a Cliff - Bloomberg"
  ],
  [
    1732756350000,
    "E.U. Vessels Surround Anchored Chinese Ship After Baltic Sea Cables Are Severed - The New York Times"
  ],
  [
    1732756533000,
    "Kylie Jenner’s vodka seltzer deal signals China VC investor’s global push - Financial Times"
  ],
  [
    1732757991000,
    "Plane carrying Americans wrongfully jailed in China lands on US soil - ABC News"
  ],
  [
    1732759659000,
    "New missile plan by US-Japan eyes Chinese invasion of Taiwan - VOA Asia"
  ],
  [
    1732765986000,
    "Understanding Indonesia's Gambit With China in the South China Sea - The Maritime Executive"
  ],
  [
    1732768440000,
    "China to test new-gen Beidou network rivalling GPS in 2027 - Reuters"
  ],
  [
    1732771575000,
    "3 Americans Are Said to Be Freed From China in Prisoner Swap - The New York Times"
  ],
  [
    1732773602000,
    "Opinion | Is Communist China Coming for Your Turkey, Too? - The New York Times"
  ],
  [
    1732775639000,
    "Chinese companies apologise for 'shrunken' sanitary pads - BBC.com"
  ],
  [
    1732779480000,
    "Nornickel sees new technologies sustaining China's palladium demand - Reuters"
  ],
  [
    1732779866000,
    "China tells ICC to be 'just and fair' after it sought warrant for Myanmar junta chief - Reuters.com"
  ],
  [
    1732782071000,
    "Shares of key chip suppliers jump as U.S. reportedly considers toned-down China curbs - CNBC"
  ],
  [
    1732782432000,
    "Is China holding back fire to deal with Trump tariffs? - DW (English)"
  ],
  [
    1732782473000,
    "Shares in ASML and peers climb amid hopes for less severe US curbs on China chips - Yahoo Finance"
  ],
  [
    1732782480000,
    "China’s EV price war is so brutal that BYD is trying to pinch its suppliers - CNN"
  ],
  [
    1732782507000,
    "China to launch next-generation Beidou satellites in 2027 - SpaceNews"
  ],
  [
    1732783050000,
    "China releases 3 Americans it imprisoned for years; Beijing says US returned 4 people to China - WISN Milwaukee"
  ],
  [
    1732783846000,
    "Three Americans released in US-China prisoner exchange - BBC.com"
  ],
  [
    1732784386000,
    "China Defence Minister Dong Jun’s fate unclear as corruption probe sparks differing account - Reuters"
  ],
  [
    1732784648000,
    "China’s Property Slump May Extend Into 2025, Fitch Says - Bloomberg"
  ],
  [
    1732786042000,
    "US Preps China Chip Curbs That Stop Short of Early Proposals - Bloomberg"
  ],
  [
    1732786200000,
    "Tech war: new US chip sanctions to deal fresh blow to China's self-reliance push - Yahoo Finance"
  ],
  [
    1732786425000,
    "Taiwan conducts air drill amid China pressure - DW (English)"
  ],
  [
    1732787879000,
    "China says top military official suspended, placed under investigation - Al Jazeera English"
  ],
  [
    1732788040000,
    "Tariffs may be just the start of U.S.-China disputes in a second Trump term - NBC News"
  ],
  [
    1732788456000,
    "A Top Chinese Commander Is Suspended Under Suspicion of Corruption - The New York Times"
  ],
  [
    1732788957000,
    "China warns of 'necessary actions' if US escalates chip curbs - Reuters"
  ],
  [
    1732789167000,
    "AstraZeneca's Enhertu breast cancer drug added to China's state insurance list - Reuters"
  ],
  [
    1732789947000,
    "Is China better prepared for another trade row with the US? - Al Jazeera English"
  ],
  [
    1732790007000,
    "‘A Lack of Respect’: Chinese Women Mobilize Against Subpar Sanitary Pads - The New York Times"
  ],
  [
    1732790587000,
    "China: X must immediately end shadow ban of prominent human rights account - ARTICLE 19"
  ],
  [
    1732791153000,
    "U.S. eases China travel advisory after 3 detained Americans are released - NBC News"
  ],
  [
    1732791626000,
    "Satellite Photos Capture Chinese Ship Swarm Near US Ally's Territory - Newsweek"
  ],
  [
    1732793340000,
    "China’s EV boom signals demise of gasoline - Automotive News"
  ],
  [
    1732794363000,
    "Exclusive: Chinese ships gather near island disputed with Philippines, satellite images show - Reuters"
  ],
  [
    1732795211000,
    "Xi Jinping Doesn’t Have an Answer for China’s Demographic Crisis - Foreign Policy"
  ],
  [
    1732796764000,
    "China and Pakistan talk security as they target terrorism against belt and road - South China Morning Post"
  ],
  [
    1732797900000,
    "China and Trump's tariffs: Beijing tries to unleash economy - DW (English)"
  ],
  [
    1732798842000,
    "Ahead of Taiwan president's Hawaii trip, China says it will defeat secessionism - Reuters"
  ],
  [
    1732802011000,
    "China suffers eruptions from its simmering discontents - The Economist"
  ],
  [
    1732802011000,
    "China’s government is badgering women to have babies - The Economist"
  ],
  [
    1732804553000,
    "France, Germany, Sweden urge EU battery sector push to avoid China reliance - Reuters.com"
  ],
  [
    1732808987000,
    "China hails US release of citizen convicted over child pornography - Financial Times"
  ],
  [
    1732810440000,
    "Sweden asks for China's cooperation over Baltic Sea cables cut while a Chinese ship was nearby - The Associated Press"
  ],
  [
    1732811220000,
    "Sweden seeks clarity from China about suspected sabotage of undersea cables - The Guardian"
  ],
  [
    1732811510000,
    "Renault Goes on China Hiring Spree to Bolster EV Push at Home - Bloomberg"
  ],
  [
    1732812205000,
    "Sweden asks China to co-operate with severed cable investigation - BBC.com"
  ],
  [
    1732813021000,
    "China criticises Trump tariff threat, says it won't solve America's problems - Reuters"
  ],
  [
    1732813880000,
    "Dragons In Detroit? China’s Secret To Automotive Success - Forbes"
  ],
  [
    1732814040000,
    "Carrier USS Abraham Lincoln Now in the South China Sea, Russian Surface Action Group Also Underway - USNI News"
  ],
  [
    1732815389000,
    "China Issues New Missile Warning to US and Philippines - Newsweek"
  ],
  [
    1732815633000,
    "US, China swap detained citizens after years of diplomacy - Reuters"
  ],
  [
    1732820514000,
    "China announces top military official is under investigation - The Washington Post"
  ],
  [
    1732829194000,
    "High-Ranking Military Official in China Placed Under Investigation, Defense Ministry Says - Military.com"
  ],
  [
    1732834583000,
    "Macquarie Seeks Japan, India Fund Bets as China Appetite Cools - Bloomberg"
  ],
  [
    1732835091000,
    "China plans to restrict exports of a critical metal. But the market isn't that worried - CNBC"
  ],
  [
    1732839060000,
    "3 Americans detained in China released in prisoner swap and back in U.S. - NBC News"
  ],
  [
    1732839780000,
    "China Probes Senior Military Official for ‘Serious Violations’ - Bloomberg"
  ],
  [
    1732841040000,
    "Drawing lines in the South China Sea: what Beijing’s new claims over a disputed coral reef mean - The Conversation"
  ],
  [
    1732844280000,
    "China's Nov manufacturing activity seen expanding for second month: Reuters poll - Reuters"
  ],
  [
    1732846920000,
    "China investigates a top military official as Xi broadens purge of PLA generals - CNN International"
  ],
  [
    1732847412000,
    "World's Largest Gold Deposit Found In China, Valued At A Staggering Rs 7 Lakh Crore - NDTV"
  ],
  [
    1732848420000,
    "China's home prices set to stabilise by 2026 after slower falls: Reuters poll - Reuters"
  ],
  [
    1732849020000,
    "Chinese court to announce verdict in veteran journalist spy case-media group - Reuters"
  ],
  [
    1732852427000,
    "China to extend tariff exemptions for some US products to 2025 - Reuters"
  ],
  [
    1732854900000,
    "China court sentences journalist to seven years on spy charges, family says - CNN"
  ],
  [
    1732854960000,
    "Did China just blink in the South China Sea? - Asia Times"
  ],
  [
    1732855440000,
    "China Resumes Multiple-Entry Visas for Shenzhen to Hong Kong - Bloomberg"
  ],
  [
    1732856400000,
    "The Trump Administration’s China Challenge - Foreign Affairs Magazine"
  ],
  [
    1732856443000,
    "South Korea scrambles jets as China, Russia warplanes fly over Sea of Japan - South China Morning Post"
  ],
  [
    1732856464000,
    "Elon Musk: the ‘wild card’ in Trump’s dealings with China - Financial Times"
  ],
  [
    1732856520000,
    "China’s Local Governments Hold Back Wages in Desperate Scrape for Cash - The Wall Street Journal"
  ],
  [
    1732857120000,
    "Stimulus Bets Drive Chinese Stocks Higher Before Key Meeting - Bloomberg"
  ],
  [
    1732857849000,
    "China Journalist, Dong Yuyu, Is Sentenced to Prison for Espionage - The New York Times"
  ],
  [
    1732858260000,
    "U.S. Citizen Sentenced for Spying on Behalf of China's Intelligence Agency - The Hacker News"
  ],
  [
    1732859085000,
    "South China Sea: US alliances mar peace and stability, China envoy tells Asean - South China Morning Post"
  ],
  [
    1732859389000,
    "China sentences veteran journalist on espionage charges - NPR"
  ],
  [
    1732859640000,
    "China’s aging population fuels ‘silver economy’ boom, but profits can prove elusive - The Associated Press"
  ],
  [
    1732859640000,
    "Chinese, Russian military planes enter South Korea's air defence zone, Seoul says - Reuters"
  ],
  [
    1732860820000,
    "How China Became the World’s Largest Car Exporter - The New York Times"
  ],
  [
    1732862619000,
    "China sentences former journalist to seven years for espionage - BBC.com"
  ],
  [
    1732863197000,
    "EU and China advance towards alternative solution for EV tariffs - Euronews"
  ],
  [
    1732863720000,
    "Exclusive: HSBC pulling back from China credit card business after struggling to expand - Reuters"
  ],
  [
    1732868670000,
    "Chinese bond market grapples with ‘Japanification’ - Financial Times"
  ],
  [
    1732870959000,
    "China jails journalist for seven years on espionage charges - Al Jazeera English"
  ],
  [
    1732872638000,
    "US Defies China to Greenlight Taiwan President's Pacific Stopovers - Newsweek"
  ],
  [
    1732873973000,
    "Inside the AI back-channel between China and the West - The Economist"
  ],
  [
    1732874422000,
    "U.S. Zoos Gave a Fortune to Protect Pandas. That’s Not How China Spent It. - The New York Times"
  ],
  [
    1732874506000,
    "Russia and China stage nuclear bomber exercise near US allies - Newsweek"
  ],
  [
    1732877448000,
    "Chinese-born buyer of US$6.2 million banana art eats it in Hong Kong - South China Morning Post"
  ]
]